; ModuleID = './main.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._contact = type { [32 x i8], [32 x i8], [16 x i8], i16, i8, i8, i32, i32, %struct._contact*, %struct._contact* }

@cookie = dso_local global i32 0, align 4, !dbg !0
@head = dso_local local_unnamed_addr global %struct._contact* null, align 8, !dbg !72
@.str = private unnamed_addr constant [47 x i8] c"Couldn't allocate contact.  Something's wrong.\00", align 1
@.str.1 = private unnamed_addr constant [55 x i8] c"Invalid first name.  Must begin with a capital letter.\00", align 1
@.str.2 = private unnamed_addr constant [54 x i8] c"Invalid last name.  Must begin with a capital letter.\00", align 1
@.str.3 = private unnamed_addr constant [52 x i8] c"Invalid phone number...must look like (nnn)nnn-nnnn\00", align 1
@.str.7 = private unnamed_addr constant [6 x i8] c"Other\00", align 1
@.str.6 = private unnamed_addr constant [13 x i8] c"Trans-Gender\00", align 1
@.str.5 = private unnamed_addr constant [7 x i8] c"Female\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c"Male\00", align 1
@.str.8 = private unnamed_addr constant [14 x i8] c"First Name: \09\00", align 1
@.str.9 = private unnamed_addr constant [13 x i8] c"Last Name: \09\00", align 1
@.str.10 = private unnamed_addr constant [16 x i8] c"Phone Number: \09\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "cookie", scope: !2, file: !3, line: 38, type: !39, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !71, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "yolodex.c", directory: "/home/salman/DPP/data/DARPA/CROMU_00003/src")
!4 = !{}
!5 = !{!6, !13, !21, !44, !47, !50, !54, !57, !60, !35, !63, !68}
!6 = !DISubprogram(name: "strlen", scope: !7, file: !7, line: 76, type: !8, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!7 = !DIFile(filename: "./stdlib.h", directory: "/home/salman/DPP/data/DARPA/CROMU_00003/src")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !11}
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!13 = !DISubprogram(name: "transmit", scope: !14, file: !14, line: 53, type: !15, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!14 = !DIFile(filename: "./libcgc.h", directory: "/home/salman/DPP/data/DARPA/CROMU_00003/src")
!15 = !DISubroutineType(types: !16)
!16 = !{!17, !17, !18, !10, !20}
!17 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "contact", file: !3, line: 51, baseType: !23)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_contact", file: !3, line: 40, size: 896, elements: !24)
!24 = !{!25, !29, !30, !34, !36, !37, !38, !40, !41, !43}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !23, file: !3, line: 41, baseType: !26, size: 256)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 256, elements: !27)
!27 = !{!28}
!28 = !DISubrange(count: 32, lowerBound: 0)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !23, file: !3, line: 42, baseType: !26, size: 256, offset: 256)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "phone", scope: !23, file: !3, line: 43, baseType: !31, size: 128, offset: 512)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 128, elements: !32)
!32 = !{!33}
!33 = !DISubrange(count: 16, lowerBound: 0)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "officenum", scope: !23, file: !3, line: 44, baseType: !35, size: 16, offset: 640)
!35 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "gender", scope: !23, file: !3, line: 45, baseType: !12, size: 8, offset: 656)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "hacker", scope: !23, file: !3, line: 46, baseType: !12, size: 8, offset: 664)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !23, file: !3, line: 47, baseType: !39, size: 32, offset: 672)
!39 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !23, file: !3, line: 48, baseType: !17, size: 32, offset: 704)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !23, file: !3, line: 49, baseType: !42, size: 64, offset: 768)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !23, file: !3, line: 50, baseType: !42, size: 64, offset: 832)
!44 = !DISubprogram(name: "puts", scope: !7, file: !7, line: 73, type: !45, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !11}
!47 = !DISubprogram(name: "_terminate", scope: !14, file: !14, line: 52, type: !48, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !4)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !39}
!50 = !DISubprogram(name: "memcpy", scope: !7, file: !7, line: 74, type: !51, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!51 = !DISubroutineType(types: !52)
!52 = !{!53, !53, !53, !39}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DISubprogram(name: "free", scope: !7, file: !7, line: 60, type: !55, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !53}
!57 = !DISubprogram(name: "receive", scope: !14, file: !14, line: 54, type: !58, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!58 = !DISubroutineType(types: !59)
!59 = !{!17, !17, !53, !10, !20}
!60 = !DISubprogram(name: "memset", scope: !7, file: !7, line: 75, type: !61, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!61 = !DISubroutineType(types: !62)
!62 = !{!53, !53, !12, !39}
!63 = !DISubprogram(name: "atoi", scope: !7, file: !7, line: 58, type: !64, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!64 = !DISubroutineType(types: !65)
!65 = !{!17, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!68 = !DISubprogram(name: "itoa", scope: !7, file: !7, line: 72, type: !69, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!69 = !DISubroutineType(types: !70)
!70 = !{!10, !11, !10, !10}
!71 = !{!0, !72}
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "head", scope: !2, file: !3, line: 53, type: !21, isLocal: false, isDefinition: true)
!74 = !{!"clang version 10.0.0-4ubuntu1 "}
!75 = !{i32 7, !"Dwarf Version", i32 4}
!76 = !{i32 2, !"Debug Info Version", i32 3}
!77 = !{i32 1, !"wchar_size", i32 4}
!78 = distinct !DISubprogram(name: "put", scope: !3, file: !3, line: 55, type: !45, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !79)
!79 = !{!80}
!80 = !DILocalVariable(name: "str", arg: 1, scope: !78, file: !3, line: 55, type: !11)
!81 = !DILocation(line: 0, scope: !78)
!82 = !DILocation(line: 56, column: 19, scope: !78)
!83 = !DILocation(line: 56, column: 2, scope: !78)
!84 = !DILocation(line: 57, column: 1, scope: !78)
!85 = distinct !DISubprogram(name: "validateName", scope: !3, file: !3, line: 59, type: !86, scopeLine: 60, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !88)
!86 = !DISubroutineType(types: !87)
!87 = !{!17, !11}
!88 = !{!89}
!89 = !DILocalVariable(name: "name", arg: 1, scope: !85, file: !3, line: 59, type: !11)
!90 = !DILocation(line: 0, scope: !85)
!91 = !DILocation(line: 62, column: 5, scope: !92)
!92 = distinct !DILexicalBlock(scope: !85, file: !3, line: 62, column: 5)
!93 = !{!94, !94, i64 0}
!94 = !{!"omnipotent char", !95, i64 0}
!95 = !{!"Simple C/C++ TBAA"}
!96 = !DILocation(line: 62, column: 20, scope: !92)
!97 = !DILocation(line: 66, column: 1, scope: !85)
!98 = distinct !DISubprogram(name: "validatePhone", scope: !3, file: !3, line: 68, type: !86, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !99)
!99 = !{!100, !101, !102}
