; ModuleID = './main.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._vars = type { [128 x i8], i8, [128 x i8], %struct._vars*, %struct._vars* }

@.str = private unnamed_addr constant [17 x i8] c"InitVARS failure\00", align 1
@pVARS = dso_local local_unnamed_addr global %struct._vars* null, align 8, !dbg !0
@.str.7 = private unnamed_addr constant [12 x i8] c"system.name\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"CGC CB\00", align 1

; Function Attrs: nounwind uwtable
define dso_local i32 @main() local_unnamed_addr #0 !dbg !99 {
  %1 = alloca [256 x i8], align 16
  %2 = getelementptr inbounds [256 x i8], [256 x i8]* %1, i64 0, i64 0, !dbg !105
  call void @llvm.lifetime.start.p0i8(i64 256, i8* nonnull %2) #12, !dbg !105
  call void @llvm.dbg.declare(metadata [256 x i8]* %1, metadata !101, metadata !DIExpression()), !dbg !106
  %3 = call i32 @InitVARS() #12, !dbg !107
  %4 = icmp eq i32 %3, 0, !dbg !107
  br i1 %4, label %8, label %5, !dbg !109

5:                                                ; preds = %0
  %6 = call i32 @ReceivePacket(i8* nonnull %2) #12, !dbg !110
  %7 = icmp eq i32 %6, 0, !dbg !113
  br i1 %7, label %13, label %9, !dbg !114

8:                                                ; preds = %0

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "pVARS", scope: !2, file: !3, line: 31, type: !44, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !43, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "vars.c", directory: "/home/salman/DPP/data/DARPA/CROMU_00039/src")
!4 = !{}
!5 = !{!6, !28, !32, !26, !37}
!6 = !DISubprogram(name: "CreateVARSObject", scope: !7, file: !7, line: 44, type: !8, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!7 = !DIFile(filename: "./vars.h", directory: "/home/salman/DPP/data/DARPA/CROMU_00039/src")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !26, !21, !27}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vars", file: !7, line: 30, size: 2240, elements: !12)
!12 = !{!13, !18, !22, !24, !25}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !11, file: !7, line: 31, baseType: !14, size: 1024)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 1024, elements: !16)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!16 = !{!17}
!17 = !DISubrange(count: 128, lowerBound: 0)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !11, file: !7, line: 32, baseType: !19, size: 8, offset: 1024)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !20, line: 34, baseType: !21)
!20 = !DIFile(filename: "./stdint.h", directory: "/home/salman/DPP/data/DARPA/CROMU_00039/src")
!21 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !11, file: !7, line: 33, baseType: !23, size: 1024, offset: 1032)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 1024, elements: !16)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !11, file: !7, line: 34, baseType: !10, size: 64, offset: 2112)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !11, file: !7, line: 35, baseType: !10, size: 64, offset: 2176)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!28 = !DISubprogram(name: "free", scope: !29, file: !29, line: 55, type: !30, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!29 = !DIFile(filename: "./malloc.h", directory: "/home/salman/DPP/data/DARPA/CROMU_00039/src")
!30 = !DISubroutineType(types: !31)
!31 = !{null, !27}
!32 = !DISubprogram(name: "_terminate", scope: !33, file: !33, line: 52, type: !34, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !4)
!33 = !DIFile(filename: "./libcgc.h", directory: "/home/salman/DPP/data/DARPA/CROMU_00039/src")
!34 = !DISubroutineType(types: !35)
!35 = !{null, !36}
!36 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!37 = !DISubprogram(name: "memcpy", scope: !38, file: !38, line: 42, type: !39, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!38 = !DIFile(filename: "./stdlib.h", directory: "/home/salman/DPP/data/DARPA/CROMU_00039/src")
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !27, !27, !42}
!41 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!42 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!43 = !{!0}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "vars_t", file: !7, line: 36, baseType: !11)
!46 = distinct !DICompileUnit(language: DW_LANG_C99, file: !47, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !48, splitDebugInlining: false, nameTableKind: None)
!47 = !DIFile(filename: "service.c", directory: "/home/salman/DPP/data/DARPA/CROMU_00039/src")
!48 = !{!49, !52, !32, !55, !60, !61}
!49 = !DISubprogram(name: "InitVARS", scope: !7, file: !7, line: 41, type: !50, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!50 = !DISubroutineType(types: !51)
!51 = !{!41}
!52 = !DISubprogram(name: "puts", scope: !38, file: !38, line: 56, type: !53, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !26}
!55 = !DISubprogram(name: "ReceivePacket", scope: !56, file: !56, line: 39, type: !57, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!56 = !DIFile(filename: "./packet.h", directory: "/home/salman/DPP/data/DARPA/CROMU_00039/src")
!57 = !DISubroutineType(types: !58)
!58 = !{!41, !59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!60 = !DISubprogram(name: "HandlePacket", scope: !56, file: !56, line: 40, type: !57, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!61 = !DISubprogram(name: "DestroyVARS", scope: !7, file: !7, line: 42, type: !50, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!62 = distinct !DICompileUnit(language: DW_LANG_C99, file: !63, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !64, splitDebugInlining: false, nameTableKind: None)
!63 = !DIFile(filename: "packet.c", directory: "/home/salman/DPP/data/DARPA/CROMU_00039/src")
!64 = !{!65, !69, !26, !75, !78, !37, !81, !92}
!65 = !DISubprogram(name: "receive", scope: !33, file: !33, line: 54, type: !66, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!66 = !DISubroutineType(types: !67)
!67 = !{!41, !41, !27, !42, !68}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!69 = !DISubprogram(name: "write", scope: !38, file: !38, line: 59, type: !70, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!70 = !DISubroutineType(types: !71)
!71 = !{!72, !73, !42}
!72 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!75 = !DISubprogram(name: "strlen", scope: !38, file: !38, line: 54, type: !76, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!76 = !DISubroutineType(types: !77)
!77 = !{!42, !26}
!78 = !DISubprogram(name: "strcpy", scope: !38, file: !38, line: 44, type: !79, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!79 = !DISubroutineType(types: !80)
!80 = !{!26, !26, !26}
!81 = !DISubprogram(name: "SearchVARS", scope: !7, file: !7, line: 43, type: !82, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !26}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vars", file: !7, line: 30, size: 2240, elements: !86)
!86 = !{!87, !88, !89, !90, !91}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !85, file: !7, line: 31, baseType: !14, size: 1024)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !85, file: !7, line: 32, baseType: !19, size: 8, offset: 1024)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !85, file: !7, line: 33, baseType: !23, size: 1024, offset: 1032)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !85, file: !7, line: 34, baseType: !84, size: 64, offset: 2112)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !85, file: !7, line: 35, baseType: !84, size: 64, offset: 2176)
!92 = !DISubprogram(name: "UpdateVARSObject", scope: !7, file: !7, line: 47, type: !93, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!93 = !DISubroutineType(types: !94)
!94 = !{!84, !26, !21, !27}
!95 = !{!"clang version 10.0.0-4ubuntu1 "}
!96 = !{i32 7, !"Dwarf Version", i32 4}
!97 = !{i32 2, !"Debug Info Version", i32 3}
!98 = !{i32 1, !"wchar_size", i32 4}
!99 = distinct !DISubprogram(name: "main", scope: !47, file: !47, line: 32, type: !50, scopeLine: 32, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !100)
!100 = !{!101}
!101 = !DILocalVariable(name: "pkt", scope: !99, file: !47, line: 33, type: !102)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2048, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 256, lowerBound: 0)
!105 = !DILocation(line: 33, column: 2, scope: !99)
!106 = !DILocation(line: 33, column: 16, scope: !99)
!107 = !DILocation(line: 36, column: 7, scope: !108)
!108 = distinct !DILexicalBlock(scope: !99, file: !47, line: 36, column: 6)
!109 = !DILocation(line: 36, column: 6, scope: !99)
!110 = !DILocation(line: 43, column: 7, scope: !111)
!111 = distinct !DILexicalBlock(scope: !112, file: !47, line: 43, column: 7)
!112 = distinct !DILexicalBlock(scope: !99, file: !47, line: 42, column: 12)
!113 = !DILocation(line: 43, column: 26, scope: !111)
!114 = !DILocation(line: 43, column: 7, scope: !112)
!115 = !DILocation(line: 37, column: 3, scope: !116)
!116 = distinct !DILexicalBlock(scope: !108, file: !47, line: 36, column: 19)
!117 = !DILocation(line: 38, column: 3, scope: !116)
!118 = !DILocation(line: 46, column: 3, scope: !112)
!119 = distinct !{!119, !120, !121}
!120 = !DILocation(line: 42, column: 2, scope: !99)
!121 = !DILocation(line: 47, column: 2, scope: !99)
!122 = !DILocation(line: 50, column: 2, scope: !99)
!123 = !DILocation(line: 53, column: 1, scope: !99)
!124 = !DILocation(line: 52, column: 2, scope: !99)
!125 = distinct !DISubprogram(name: "ReceivePacket", scope: !63, file: !63, line: 58, type: !126, scopeLine: 58, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !62, retainedNodes: !129)
!126 = !DISubroutineType(types: !127)
!127 = !{!128, !59}
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !20, line: 31, baseType: !41)
!129 = !{!130, !131, !133, !135, !136}
!130 = !DILocalVariable(name: "pkt", arg: 1, scope: !125, file: !63, line: 58, type: !59)
!131 = !DILocalVariable(name: "total_bytes", scope: !125, file: !63, line: 59, type: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !20, line: 36, baseType: !36)
!133 = !DILocalVariable(name: "rx_bytes", scope: !125, file: !63, line: 60, type: !134)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !33, line: 13, baseType: !42)
!135 = !DILocalVariable(name: "pkt_len", scope: !125, file: !63, line: 61, type: !19)
!136 = !DILocalVariable(name: "retval", scope: !125, file: !63, line: 62, type: !41)
!137 = !DILocation(line: 0, scope: !125)
!138 = !DILocation(line: 60, column: 2, scope: !125)
!139 = !DILocation(line: 66, column: 2, scope: !125)
!140 = !DILocation(line: 66, column: 21, scope: !125)
!141 = distinct !{!141, !139, !142}
!142 = !DILocation(line: 75, column: 2, scope: !125)
!143 = !DILocation(line: 67, column: 31, scope: !144)
!144 = distinct !DILexicalBlock(scope: !145, file: !63, line: 67, column: 7)
!145 = distinct !DILexicalBlock(scope: !125, file: !63, line: 66, column: 27)
!146 = !DILocation(line: 67, column: 46, scope: !144)
!147 = !DILocation(line: 67, column: 45, scope: !144)
!148 = !DILocation(line: 67, column: 17, scope: !144)
!149 = !DILocation(line: 67, column: 72, scope: !144)
!150 = !DILocation(line: 67, column: 7, scope: !145)
!151 = !DILocation(line: 71, column: 7, scope: !152)
