; ModuleID = './main.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.movie.0 = type { i8*, i8*, i32, i32, i32, i32, {}* }
%struct.movie_node.1 = type { %struct.movie.0*, %struct.movie_node.1* }
%struct.movie_node = type { %struct.movie*, %struct.movie_node* }
%struct.movie = type { i8*, i8*, i32, i32, i32, i32, void (i32, %struct.movie*)* }

@switch.table.movie_g2s = private unnamed_addr constant [4 x i8*] [i8* getelementptr inbounds ([7 x i8], [7 x i8]* @.str, i64 0, i64 0), i8* getelementptr inbounds ([8 x i8], [8 x i8]* @.str.1, i64 0, i64 0), i8* getelementptr inbounds ([7 x i8], [7 x i8]* @.str.2, i64 0, i64 0), i8* getelementptr inbounds ([7 x i8], [7 x i8]* @.str.3, i64 0, i64 0)], align 8
@.str.4 = private unnamed_addr constant [6 x i8] c"Other\00", align 1
@.str = private unnamed_addr constant [7 x i8] c"Action\00", align 1
@.str.1 = private unnamed_addr constant [8 x i8] c"Romance\00", align 1
@.str.2 = private unnamed_addr constant [7 x i8] c"Comedy\00", align 1
@.str.3 = private unnamed_addr constant [7 x i8] c"Horror\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "default_movies", scope: !2, file: !3, line: 36, type: !105, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !90, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "main.c", directory: "/home/salman/DPP/data/DARPA/KPRCA_00011/src")
!4 = !{!5, !14}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "genre_t", file: !6, line: 29, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./movie.h", directory: "/home/salman/DPP/data/DARPA/KPRCA_00011/src")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "G_ACTION", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "G_ROMANCE", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "G_COMEDY", value: 3, isUnsigned: true)
!12 = !DIEnumerator(name: "G_HORROR", value: 4, isUnsigned: true)
!13 = !DIEnumerator(name: "G_OTHER", value: 5, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rating_t", file: !6, line: 37, baseType: !7, size: 32, elements: !15)
!15 = !{!16, !17, !18, !19, !20}
!16 = !DIEnumerator(name: "R_G", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "R_PG", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "R_PG13", value: 3, isUnsigned: true)
!19 = !DIEnumerator(name: "R_R", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "R_UNKNOWN", value: 5, isUnsigned: true)
!21 = !{!22, !31, !36, !48, !57, !60, !63, !66, !69, !72, !76, !79, !84, !87}
!22 = !DISubprogram(name: "random", scope: !23, file: !23, line: 59, type: !24, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!23 = !DIFile(filename: "./libcgc.h", directory: "/home/salman/DPP/data/DARPA/KPRCA_00011/src")
!24 = !DISubroutineType(types: !25)
!25 = !{!26, !27, !28, !29}
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!28 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!30 = !{}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "movie_t", file: !6, line: 53, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "movie", file: !6, line: 45, size: 320, elements: !34)
!34 = !{!35, !38, !39, !40, !41, !42, !43}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !33, file: !6, line: 46, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !33, file: !6, line: 47, baseType: !36, size: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !33, file: !6, line: 48, baseType: !26, size: 32, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "score", scope: !33, file: !6, line: 49, baseType: !26, size: 32, offset: 160)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "genre", scope: !33, file: !6, line: 50, baseType: !5, size: 32, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "rating", scope: !33, file: !6, line: 51, baseType: !14, size: 32, offset: 224)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "print_info", scope: !33, file: !6, line: 52, baseType: !44, size: 64, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !26, !47}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!48 = !DISubprogram(name: "movie_add", scope: !6, file: !6, line: 65, type: !49, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!49 = !DISubroutineType(types: !50)
!50 = !{!26, !51, !47}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "movie_node", file: !6, line: 55, size: 128, elements: !54)
!54 = !{!55, !56}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "movie", scope: !53, file: !6, line: 56, baseType: !31, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !53, file: !6, line: 57, baseType: !52, size: 64, offset: 64)
!57 = !DISubprogram(name: "quit", scope: !3, file: !3, line: 33, type: !58, spFlags: DISPFlagOptimized, retainedNodes: !30)
!58 = !DISubroutineType(types: !59)
!59 = !{null, null}
!60 = !DISubprogram(name: "receive", scope: !23, file: !23, line: 54, type: !61, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!61 = !DISubroutineType(types: !62)
!62 = !{!26, !26, !27, !28, !29}
!63 = !DISubprogram(name: "movie_find_by_id", scope: !6, file: !6, line: 69, type: !64, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!64 = !DISubroutineType(types: !65)
!65 = !{!52, !52, !26}
!66 = !DISubprogram(name: "movie_find", scope: !6, file: !6, line: 68, type: !67, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!67 = !DISubroutineType(types: !68)
!68 = !{!52, !52, !36}
!69 = !DISubprogram(name: "movie_delete", scope: !6, file: !6, line: 66, type: !70, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!70 = !DISubroutineType(types: !71)
!71 = !{!26, !51, !26}
!72 = !DISubprogram(name: "free", scope: !73, file: !73, line: 16, type: !74, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!73 = !DIFile(filename: "./stdlib.h", directory: "/home/salman/DPP/data/DARPA/KPRCA_00011/src")
!74 = !DISubroutineType(types: !75)
!75 = !{null, !27}
!76 = !DISubprogram(name: "free_movie", scope: !6, file: !6, line: 70, type: !77, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !47}
!79 = !DISubprogram(name: "movie_g2s", scope: !6, file: !6, line: 62, type: !80, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!80 = !DISubroutineType(types: !81)
!81 = !{!82, !5}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!84 = !DISubprogram(name: "movie_r2s", scope: !6, file: !6, line: 63, type: !85, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!85 = !DISubroutineType(types: !86)
!86 = !{!82, !14}
!87 = !DISubprogram(name: "_terminate", scope: !23, file: !23, line: 52, type: !88, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !30)
!88 = !DISubroutineType(types: !89)
!89 = !{null, !7}
!90 = !{!0, !91, !93, !98, !103}
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "g_num_movies", scope: !2, file: !3, line: 50, type: !7, isLocal: false, isDefinition: true)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "g_password", scope: !2, file: !3, line: 49, type: !95, isLocal: false, isDefinition: true)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 168, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 21, lowerBound: 0)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "movies_full", scope: !2, file: !3, line: 51, type: !100, isLocal: false, isDefinition: true)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "movie_list_t", file: !6, line: 60, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "movie_node_t", file: !6, line: 58, baseType: !53)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "movies_rented", scope: !2, file: !3, line: 52, type: !100, isLocal: false, isDefinition: true)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 3200, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 10, lowerBound: 0)
!108 = distinct !DICompileUnit(language: DW_LANG_C99, file: !109, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !110, splitDebugInlining: false, nameTableKind: None)
!109 = !DIFile(filename: "movie.c", directory: "/home/salman/DPP/data/DARPA/KPRCA_00011/src")
!110 = !{!111, !27, !133, !136}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "movie_node_t", file: !6, line: 58, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "movie_node", file: !6, line: 55, size: 128, elements: !114)
!114 = !{!115, !131}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "movie", scope: !113, file: !6, line: 56, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "movie_t", file: !6, line: 53, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "movie", file: !6, line: 45, size: 320, elements: !119)
!119 = !{!120, !121, !122, !123, !124, !125, !126}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !118, file: !6, line: 46, baseType: !36, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !118, file: !6, line: 47, baseType: !36, size: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !118, file: !6, line: 48, baseType: !26, size: 32, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "score", scope: !118, file: !6, line: 49, baseType: !26, size: 32, offset: 160)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "genre", scope: !118, file: !6, line: 50, baseType: !5, size: 32, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "rating", scope: !118, file: !6, line: 51, baseType: !14, size: 32, offset: 224)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "print_info", scope: !118, file: !6, line: 52, baseType: !127, size: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !26, !130}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !113, file: !6, line: 57, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!133 = !DISubprogram(name: "movie_find", scope: !6, file: !6, line: 68, type: !134, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!134 = !DISubroutineType(types: !135)
!135 = !{!132, !132, !36}
!136 = !DISubprogram(name: "free", scope: !137, file: !137, line: 565, type: !74, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!137 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!138 = !{!"clang version 10.0.0-4ubuntu1 "}
!139 = !{i32 7, !"Dwarf Version", i32 4}
!140 = !{i32 2, !"Debug Info Version", i32 3}
!141 = !{i32 1, !"wchar_size", i32 4}
!142 = distinct !DISubprogram(name: "movie_g2s", scope: !109, file: !109, line: 31, type: !80, scopeLine: 32, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !108, retainedNodes: !143)
!143 = !{!144, !145}
!144 = !DILocalVariable(name: "genre", arg: 1, scope: !142, file: !109, line: 31, type: !5)
!145 = !DILocalVariable(name: "genre_str", scope: !142, file: !109, line: 33, type: !82)
!146 = !DILocation(line: 0, scope: !142)
!147 = !DILocation(line: 34, column: 3, scope: !142)
!148 = !DILocation(line: 47, column: 3, scope: !142)
!149 = distinct !DISubprogram(name: "movie_r2s", scope: !109, file: !109, line: 50, type: !85, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !108, retainedNodes: !150)
!150 = !{!151, !152}
!151 = !DILocalVariable(name: "rating", arg: 1, scope: !149, file: !109, line: 50, type: !14)
!152 = !DILocalVariable(name: "rating_str", scope: !149, file: !109, line: 52, type: !82)
!153 = !DILocation(line: 0, scope: !149)
!154 = !DILocation(line: 53, column: 3, scope: !149)
!155 = !DILocation(line: 66, column: 3, scope: !149)
!156 = distinct !DISubprogram(name: "movie_add", scope: !109, file: !109, line: 69, type: !157, scopeLine: 70, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !108, retainedNodes: !161)
!157 = !DISubroutineType(types: !158)
!158 = !{!26, !159, !116}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "movie_list_t", file: !6, line: 60, baseType: !111)
!161 = !{!162, !163, !164, !167}
!162 = !DILocalVariable(name: "list", arg: 1, scope: !156, file: !109, line: 69, type: !159)
!163 = !DILocalVariable(name: "movie", arg: 2, scope: !156, file: !109, line: 69, type: !116)
!164 = !DILocalVariable(name: "node", scope: !165, file: !109, line: 73, type: !111)
!165 = distinct !DILexicalBlock(scope: !166, file: !109, line: 72, column: 3)
!166 = distinct !DILexicalBlock(scope: !156, file: !109, line: 71, column: 7)
!167 = !DILocalVariable(name: "tmp", scope: !165, file: !109, line: 85, type: !111)
!168 = !DILocation(line: 0, scope: !156)
!169 = !DILocation(line: 71, column: 7, scope: !166)
!170 = !DILocation(line: 71, column: 7, scope: !156)
!171 = !DILocation(line: 73, column: 43, scope: !165)
!172 = !DILocation(line: 0, scope: !165)
!173 = !DILocation(line: 74, column: 14, scope: !174)
!174 = distinct !DILexicalBlock(scope: !165, file: !109, line: 74, column: 9)
!175 = !DILocation(line: 74, column: 9, scope: !165)
!176 = !DILocation(line: 77, column: 9, scope: !177)
!177 = distinct !DILexicalBlock(scope: !165, file: !109, line: 77, column: 9)
!178 = !{!179, !179, i64 0}
!179 = !{!"any pointer", !180, i64 0}
!180 = !{!"omnipotent char", !181, i64 0}
!181 = !{!"Simple C/C++ TBAA"}
!182 = !DILocation(line: 77, column: 15, scope: !177)
!183 = !DILocation(line: 77, column: 9, scope: !165)
!184 = !DILocation(line: 79, column: 13, scope: !185)
!185 = distinct !DILexicalBlock(scope: !177, file: !109, line: 78, column: 5)
!186 = !DILocation(line: 79, column: 19, scope: !185)
