; ModuleID = './main.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.sl_node = type { i8*, %struct.sl_node* }
%struct.cgcf_Shdr = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8* }
%struct.cgcf_Sym = type { i32, i32, i32, i8, i8, i16, i8* }
%struct.cgcf_Ehdr = type { [16 x i8], i16, i16, i32, i32, i32, i32, i32, i16, i16, i16, i16, i16, i16 }

@.str = private unnamed_addr constant [2 x i8] c" \00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"%d section header(s):\0A\00", align 1
@.str.2 = private unnamed_addr constant [13 x i8] c"  [No.] Name\00", align 1
@.str.3 = private unnamed_addr constant [39 x i8] c"  Type           Addr     Off    Size\0A\00", align 1
@.str.4 = private unnamed_addr constant [11 x i8] c"  [%3d] %s\00", align 1
@.str.5 = private unnamed_addr constant [5 x i8] c"  %s\00", align 1
@.str.6 = private unnamed_addr constant [17 x i8] c" %08x %06x %06x\0A\00", align 1
@.str.7 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1
@.str.8 = private unnamed_addr constant [15 x i8] c"%d symbol(s):\0A\00", align 1
@.str.9 = private unnamed_addr constant [47 x i8] c"  [No.] Value       Size Type    Bind    Name\0A\00", align 1
@.str.10 = private unnamed_addr constant [19 x i8] c"  [%3d] 0x%08x %5d\00", align 1
@.str.11 = private unnamed_addr constant [4 x i8] c" %s\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "readuntil.c", directory: "/home/salman/DPP/data/DARPA/KPRCA_00037/src")
!2 = !{}
!3 = !{!4}
!4 = !DISubprogram(name: "receive", scope: !5, file: !5, line: 52, type: !6, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!5 = !DIFile(filename: "./libcgc.h", directory: "/home/salman/DPP/data/DARPA/KPRCA_00037/src")
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !8, !9, !10, !11}
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!12 = distinct !DICompileUnit(language: DW_LANG_C99, file: !13, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !14, splitDebugInlining: false, nameTableKind: None)
!13 = !DIFile(filename: "slist.c", directory: "/home/salman/DPP/data/DARPA/KPRCA_00037/src")
!14 = !{!15, !9, !23}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "sl_node", file: !17, line: 30, baseType: !18)
!17 = !DIFile(filename: "./slist.h", directory: "/home/salman/DPP/data/DARPA/KPRCA_00037/src")
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sl_node", file: !17, line: 27, size: 128, elements: !19)
!19 = !{!20, !21}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !18, file: !17, line: 28, baseType: !9, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !18, file: !17, line: 29, baseType: !22, size: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!23 = !DISubprogram(name: "free", scope: !24, file: !24, line: 21, type: !25, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!24 = !DIFile(filename: "./stdlib.h", directory: "/home/salman/DPP/data/DARPA/KPRCA_00037/src")
!25 = !DISubroutineType(types: !26)
!26 = !{null, !9}
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !29, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "main.c", directory: "/home/salman/DPP/data/DARPA/KPRCA_00037/src")
!29 = !{!30, !49, !54, !57, !70, !73, !23, !47, !74, !9, !78, !101, !104, !36, !109, !120}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "cgcf_Shdr", file: !32, line: 64, baseType: !33)
!32 = !DIFile(filename: "./cgcf.h", directory: "/home/salman/DPP/data/DARPA/KPRCA_00037/src")
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 52, size: 384, elements: !34)
!34 = !{!35, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "sh_name", scope: !33, file: !32, line: 53, baseType: !36, size: 32)
!36 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "sh_type", scope: !33, file: !32, line: 54, baseType: !36, size: 32, offset: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "sh_flags", scope: !33, file: !32, line: 55, baseType: !36, size: 32, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "sh_addr", scope: !33, file: !32, line: 56, baseType: !36, size: 32, offset: 96)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "sh_offset", scope: !33, file: !32, line: 57, baseType: !36, size: 32, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "sh_size", scope: !33, file: !32, line: 58, baseType: !36, size: 32, offset: 160)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "sh_link", scope: !33, file: !32, line: 59, baseType: !36, size: 32, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "sh_info", scope: !33, file: !32, line: 60, baseType: !36, size: 32, offset: 224)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "sh_addralign", scope: !33, file: !32, line: 61, baseType: !36, size: 32, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "sh_entsize", scope: !33, file: !32, line: 62, baseType: !36, size: 32, offset: 288)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sh_name_str", scope: !33, file: !32, line: 63, baseType: !47, size: 64, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!49 = !DISubprogram(name: "fdprintf", scope: !24, file: !24, line: 11, type: !50, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!50 = !DISubroutineType(types: !51)
!51 = !{!8, !8, !52, null}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!54 = !DISubprogram(name: "cgcf_section_type2str", scope: !32, file: !32, line: 113, type: !55, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!55 = !DISubroutineType(types: !56)
!56 = !{!47, !36}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "cgcf_Sym", file: !32, line: 95, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 87, size: 192, elements: !60)
!60 = !{!61, !62, !63, !64, !66, !67, !69}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "st_name", scope: !59, file: !32, line: 88, baseType: !36, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "st_value", scope: !59, file: !32, line: 89, baseType: !36, size: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !59, file: !32, line: 90, baseType: !36, size: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "st_info", scope: !59, file: !32, line: 91, baseType: !65, size: 8, offset: 96)
!65 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "st_other", scope: !59, file: !32, line: 92, baseType: !65, size: 8, offset: 104)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "st_shndx", scope: !59, file: !32, line: 93, baseType: !68, size: 16, offset: 112)
!68 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "st_name_str", scope: !59, file: !32, line: 94, baseType: !47, size: 64, offset: 128)
!70 = !DISubprogram(name: "cgcf_symbol_type2str", scope: !32, file: !32, line: 115, type: !71, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!71 = !DISubroutineType(types: !72)
!72 = !{!47, !65}
!73 = !DISubprogram(name: "cgcf_symbol_bind2str", scope: !32, file: !32, line: 114, type: !71, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!74 = !DISubprogram(name: "read_n", scope: !75, file: !75, line: 30, type: !76, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!75 = !DIFile(filename: "./readuntil.h", directory: "/home/salman/DPP/data/DARPA/KPRCA_00037/src")
!76 = !DISubroutineType(types: !77)
!77 = !{!8, !8, !47, !10}
!78 = !DISubprogram(name: "cgcf_parse_file_header", scope: !32, file: !32, line: 117, type: !79, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!79 = !DISubroutineType(types: !80)
!80 = !{!8, !52, !10, !81}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 34, size: 416, elements: !83)
!83 = !{!84, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "e_ident", scope: !82, file: !32, line: 35, baseType: !85, size: 128)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 128, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 16, lowerBound: 0)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "e_type", scope: !82, file: !32, line: 36, baseType: !68, size: 16, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "e_machine", scope: !82, file: !32, line: 37, baseType: !68, size: 16, offset: 144)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "e_version", scope: !82, file: !32, line: 38, baseType: !36, size: 32, offset: 160)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "e_entry", scope: !82, file: !32, line: 39, baseType: !36, size: 32, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "e_phoff", scope: !82, file: !32, line: 40, baseType: !36, size: 32, offset: 224)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "e_shoff", scope: !82, file: !32, line: 41, baseType: !36, size: 32, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "e_flags", scope: !82, file: !32, line: 42, baseType: !36, size: 32, offset: 288)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "e_ehsize", scope: !82, file: !32, line: 43, baseType: !68, size: 16, offset: 320)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "e_phentsize", scope: !82, file: !32, line: 44, baseType: !68, size: 16, offset: 336)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "e_phnum", scope: !82, file: !32, line: 45, baseType: !68, size: 16, offset: 352)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "e_shentsize", scope: !82, file: !32, line: 46, baseType: !68, size: 16, offset: 368)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "e_shnum", scope: !82, file: !32, line: 47, baseType: !68, size: 16, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "e_shstrndx", scope: !82, file: !32, line: 48, baseType: !68, size: 16, offset: 400)
!101 = !DISubprogram(name: "cgcf_is_valid", scope: !32, file: !32, line: 116, type: !102, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!102 = !DISubroutineType(types: !103)
!103 = !{!8, !81}
!104 = !DISubprogram(name: "cgcf_parse_section_header", scope: !32, file: !32, line: 118, type: !105, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!105 = !DISubroutineType(types: !106)
!106 = !{!8, !52, !10, !107, !108}
!107 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!109 = !DISubprogram(name: "sl_insert", scope: !17, file: !17, line: 35, type: !110, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!110 = !DISubroutineType(types: !111)
!111 = !{!112, !112, !9, !117}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sl_node", file: !17, line: 27, size: 128, elements: !114)
!114 = !{!115, !116}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !113, file: !17, line: 28, baseType: !9, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !113, file: !17, line: 29, baseType: !112, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!8, !9, !9}
!120 = !DISubprogram(name: "sl_destroy", scope: !17, file: !17, line: 36, type: !121, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !112, !123}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !125, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !126, splitDebugInlining: false, nameTableKind: None)
!125 = !DIFile(filename: "cgcf.c", directory: "/home/salman/DPP/data/DARPA/KPRCA_00037/src")
!126 = !{!127, !9}
!127 = !DISubprogram(name: "memcmp", scope: !128, file: !128, line: 9, type: !129, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!128 = !DIFile(filename: "./string.h", directory: "/home/salman/DPP/data/DARPA/KPRCA_00037/src")
!129 = !DISubroutineType(types: !130)
!130 = !{!8, !9, !131, !10}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!133 = !{!"clang version 10.0.0-4ubuntu1 "}
!134 = !{i32 7, !"Dwarf Version", i32 4}
!135 = !{i32 2, !"Debug Info Version", i32 3}
!136 = !{i32 1, !"wchar_size", i32 4}
!137 = distinct !DISubprogram(name: "read_until", scope: !1, file: !1, line: 26, type: !138, scopeLine: 27, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !141)
!138 = !DISubroutineType(types: !139)
!139 = !{!8, !8, !47, !140, !48}
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !5, line: 10, baseType: !10)
!141 = !{!142, !143, !144, !145, !146, !147, !148}
!142 = !DILocalVariable(name: "fd", arg: 1, scope: !137, file: !1, line: 26, type: !8)
!143 = !DILocalVariable(name: "buf", arg: 2, scope: !137, file: !1, line: 26, type: !47)
!144 = !DILocalVariable(name: "len", arg: 3, scope: !137, file: !1, line: 26, type: !140)
!145 = !DILocalVariable(name: "delim", arg: 4, scope: !137, file: !1, line: 26, type: !48)
!146 = !DILocalVariable(name: "i", scope: !137, file: !1, line: 28, type: !140)
!147 = !DILocalVariable(name: "c", scope: !137, file: !1, line: 29, type: !47)
!148 = !DILocalVariable(name: "rx", scope: !149, file: !1, line: 32, type: !140)
!149 = distinct !DILexicalBlock(scope: !150, file: !1, line: 31, column: 3)
!150 = distinct !DILexicalBlock(scope: !151, file: !1, line: 30, column: 3)
!151 = distinct !DILexicalBlock(scope: !137, file: !1, line: 30, column: 3)
!152 = !DILocation(line: 0, scope: !137)
!153 = !DILocation(line: 30, column: 17, scope: !150)
!154 = !DILocation(line: 30, column: 3, scope: !151)
!155 = !DILocation(line: 0, scope: !149)
!156 = !DILocation(line: 32, column: 5, scope: !149)
!157 = !DILocation(line: 33, column: 9, scope: !158)
!158 = distinct !DILexicalBlock(scope: !149, file: !1, line: 33, column: 9)
!159 = !DILocation(line: 33, column: 32, scope: !158)
!160 = !DILocation(line: 33, column: 40, scope: !158)
!161 = !DILocation(line: 33, column: 43, scope: !158)
!162 = !DILocation(line: 33, column: 37, scope: !158)
!163 = !DILocation(line: 35, column: 12, scope: !164)
!164 = distinct !DILexicalBlock(scope: !149, file: !1, line: 35, column: 9)
!165 = !DILocation(line: 35, column: 9, scope: !164)
!166 = !{!167, !167, i64 0}
!167 = !{!"omnipotent char", !168, i64 0}
!168 = !{!"Simple C/C++ TBAA"}
!169 = !DILocation(line: 35, column: 16, scope: !164)
!170 = !DILocation(line: 0, scope: !150)
!171 = !DILocation(line: 37, column: 3, scope: !150)
!172 = !DILocation(line: 30, column: 24, scope: !150)
!173 = distinct !{!173, !154, !174}
!174 = !DILocation(line: 37, column: 3, scope: !151)
!175 = !DILocation(line: 29, column: 9, scope: !137)
!176 = !DILocation(line: 38, column: 9, scope: !177)
!177 = distinct !DILexicalBlock(scope: !137, file: !1, line: 38, column: 7)
!178 = !DILocation(line: 38, column: 7, scope: !137)
!179 = !DILocation(line: 39, column: 8, scope: !177)
!180 = !DILocation(line: 39, column: 12, scope: !177)
!181 = !DILocation(line: 39, column: 5, scope: !177)
!182 = !DILocation(line: 40, column: 12, scope: !137)
!183 = !DILocation(line: 40, column: 10, scope: !137)
!184 = !DILocation(line: 40, column: 3, scope: !137)
!185 = !DILocation(line: 41, column: 1, scope: !137)
!186 = distinct !DISubprogram(name: "read_n", scope: !1, file: !1, line: 43, type: !187, scopeLine: 44, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !189)
!187 = !DISubroutineType(types: !188)
!188 = !{!8, !8, !47, !140}
!189 = !{!190, !191, !192, !193, !194, !195}
!190 = !DILocalVariable(name: "fd", arg: 1, scope: !186, file: !1, line: 43, type: !8)
!191 = !DILocalVariable(name: "buf", arg: 2, scope: !186, file: !1, line: 43, type: !47)
!192 = !DILocalVariable(name: "len", arg: 3, scope: !186, file: !1, line: 43, type: !140)
!193 = !DILocalVariable(name: "i", scope: !186, file: !1, line: 45, type: !140)
!194 = !DILocalVariable(name: "c", scope: !186, file: !1, line: 46, type: !47)
!195 = !DILocalVariable(name: "rx", scope: !196, file: !1, line: 49, type: !140)
!196 = distinct !DILexicalBlock(scope: !197, file: !1, line: 48, column: 3)
!197 = distinct !DILexicalBlock(scope: !198, file: !1, line: 47, column: 3)
!198 = distinct !DILexicalBlock(scope: !186, file: !1, line: 47, column: 3)
!199 = !DILocation(line: 0, scope: !186)
!200 = !DILocation(line: 47, column: 17, scope: !197)
!201 = !DILocation(line: 47, column: 3, scope: !198)
!202 = !DILocation(line: 0, scope: !196)
!203 = !DILocation(line: 49, column: 5, scope: !196)
!204 = !DILocation(line: 50, column: 9, scope: !205)
!205 = distinct !DILexicalBlock(scope: !196, file: !1, line: 50, column: 9)
!206 = !DILocation(line: 50, column: 32, scope: !205)
!207 = !DILocation(line: 50, column: 40, scope: !205)
!208 = !DILocation(line: 50, column: 43, scope: !205)
!209 = !DILocation(line: 50, column: 37, scope: !205)
!210 = !DILocation(line: 53, column: 3, scope: !197)
!211 = !DILocation(line: 47, column: 24, scope: !197)
!212 = distinct !{!212, !201, !213}
!213 = !DILocation(line: 53, column: 3, scope: !198)
!214 = !DILocation(line: 46, column: 9, scope: !186)
!215 = !DILocation(line: 54, column: 12, scope: !186)
!216 = !DILocation(line: 54, column: 10, scope: !186)
!217 = !DILocation(line: 54, column: 3, scope: !186)
!218 = distinct !DISubprogram(name: "sl_insert", scope: !13, file: !13, line: 27, type: !219, scopeLine: 28, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !12, retainedNodes: !222)
!219 = !DISubroutineType(types: !220)
!220 = !{!15, !15, !9, !221}
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmp_fn", file: !17, line: 32, baseType: !117)
!222 = !{!223, !224, !225, !226, !227, !228}
!223 = !DILocalVariable(name: "head", arg: 1, scope: !218, file: !13, line: 27, type: !15)
!224 = !DILocalVariable(name: "elem", arg: 2, scope: !218, file: !13, line: 27, type: !9)
!225 = !DILocalVariable(name: "cmp", arg: 3, scope: !218, file: !13, line: 27, type: !221)
!226 = !DILocalVariable(name: "cur", scope: !218, file: !13, line: 29, type: !15)
!227 = !DILocalVariable(name: "prev", scope: !218, file: !13, line: 29, type: !15)
!228 = !DILocalVariable(name: "new", scope: !218, file: !13, line: 29, type: !15)
!229 = !DILocation(line: 0, scope: !218)
!230 = !DILocation(line: 32, column: 7, scope: !231)
!231 = distinct !DILexicalBlock(scope: !218, file: !13, line: 32, column: 7)
!232 = !DILocation(line: 32, column: 7, scope: !218)
!233 = !DILocation(line: 34, column: 23, scope: !234)
!234 = distinct !DILexicalBlock(scope: !231, file: !13, line: 33, column: 3)
!235 = !DILocation(line: 34, column: 11, scope: !234)
!236 = !DILocation(line: 35, column: 9, scope: !237)
!237 = distinct !DILexicalBlock(scope: !234, file: !13, line: 35, column: 9)
!238 = !DILocation(line: 35, column: 9, scope: !234)
!239 = !DILocation(line: 37, column: 12, scope: !240)
!240 = distinct !DILexicalBlock(scope: !237, file: !13, line: 36, column: 5)
!241 = !DILocation(line: 37, column: 17, scope: !240)
!242 = !{!243, !244, i64 0}
!243 = !{!"sl_node", !244, i64 0, !244, i64 8}
!244 = !{!"any pointer", !167, i64 0}
!245 = !DILocation(line: 39, column: 16, scope: !246)
!246 = distinct !DILexicalBlock(scope: !240, file: !13, line: 39, column: 11)
!247 = !DILocation(line: 39, column: 11, scope: !240)
!248 = !DILocation(line: 52, column: 24, scope: !249)
!249 = distinct !DILexicalBlock(scope: !250, file: !13, line: 52, column: 15)
!250 = distinct !DILexicalBlock(scope: !251, file: !13, line: 51, column: 9)
!251 = distinct !DILexicalBlock(scope: !246, file: !13, line: 46, column: 7)
!252 = !DILocation(line: 52, column: 35, scope: !249)
!253 = !DILocation(line: 52, column: 15, scope: !249)
!254 = !DILocation(line: 52, column: 41, scope: !249)
!255 = !DILocation(line: 52, column: 15, scope: !250)
!256 = !DILocation(line: 43, column: 15, scope: !257)
!257 = distinct !DILexicalBlock(scope: !246, file: !13, line: 40, column: 7)
!258 = !DILocation(line: 43, column: 20, scope: !257)
!259 = !{!243, !244, i64 8}
!260 = !DILocation(line: 44, column: 7, scope: !257)
!261 = distinct !{!261, !262, !263}
!262 = !DILocation(line: 50, column: 9, scope: !251)
!263 = !DILocation(line: 56, column: 9, scope: !251)
!264 = !DILocation(line: 55, column: 22, scope: !250)
!265 = !DILocation(line: 60, column: 17, scope: !266)
!266 = distinct !DILexicalBlock(scope: !251, file: !13, line: 59, column: 13)
!267 = !DILocation(line: 60, column: 22, scope: !266)
!268 = !DILocation(line: 60, column: 11, scope: !266)
!269 = !DILocation(line: 65, column: 20, scope: !270)
!270 = distinct !DILexicalBlock(scope: !271, file: !13, line: 65, column: 15)
!271 = distinct !DILexicalBlock(scope: !266, file: !13, line: 63, column: 9)
!272 = !DILocation(line: 65, column: 15, scope: !271)
!273 = !DILocation(line: 67, column: 18, scope: !274)
!274 = distinct !DILexicalBlock(scope: !270, file: !13, line: 66, column: 11)
!275 = !DILocation(line: 67, column: 23, scope: !274)
!276 = !DILocation(line: 69, column: 11, scope: !274)
!277 = !DILocation(line: 73, column: 31, scope: !278)
!278 = distinct !DILexicalBlock(scope: !270, file: !13, line: 72, column: 11)
!279 = !DILocation(line: 73, column: 18, scope: !278)
!280 = !DILocation(line: 73, column: 23, scope: !278)
!281 = !DILocation(line: 74, column: 24, scope: !278)
!282 = !DILocation(line: 80, column: 3, scope: !218)
!283 = distinct !DISubprogram(name: "sl_destroy", scope: !13, file: !13, line: 83, type: !284, scopeLine: 84, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !12, retainedNodes: !287)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !15, !286}
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_fn", file: !17, line: 33, baseType: !123)
!287 = !{!288, !289, !290, !291}
!288 = !DILocalVariable(name: "head", arg: 1, scope: !283, file: !13, line: 83, type: !15)
!289 = !DILocalVariable(name: "ffn", arg: 2, scope: !283, file: !13, line: 83, type: !286)
!290 = !DILocalVariable(name: "cur", scope: !283, file: !13, line: 85, type: !15)
!291 = !DILocalVariable(name: "tmp", scope: !283, file: !13, line: 85, type: !15)
!292 = !DILocation(line: 0, scope: !283)
!293 = !DILocation(line: 91, column: 3, scope: !283)
!294 = !DILocation(line: 93, column: 16, scope: !295)
!295 = distinct !DILexicalBlock(scope: !283, file: !13, line: 92, column: 3)
!296 = !DILocation(line: 94, column: 14, scope: !297)
!297 = distinct !DILexicalBlock(scope: !295, file: !13, line: 94, column: 9)
!298 = !DILocation(line: 94, column: 9, scope: !297)
!299 = !DILocation(line: 94, column: 9, scope: !295)
!300 = !DILocation(line: 95, column: 7, scope: !297)
!301 = !DILocation(line: 96, column: 10, scope: !295)
!302 = !DILocation(line: 96, column: 5, scope: !295)
!303 = distinct !{!303, !293, !304}
!304 = !DILocation(line: 98, column: 3, scope: !283)
!305 = !DILocation(line: 99, column: 1, scope: !283)
!306 = distinct !DISubprogram(name: "max_section_name_len", scope: !28, file: !28, line: 34, type: !307, scopeLine: 35, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !27, retainedNodes: !311)
!307 = !DISubroutineType(types: !308)
!308 = !{!8, !309}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "sl_node", file: !17, line: 30, baseType: !113)
!311 = !{!312, !313, !314, !315, !316}
!312 = !DILocalVariable(name: "sections", arg: 1, scope: !306, file: !28, line: 34, type: !309)
!313 = !DILocalVariable(name: "max", scope: !306, file: !28, line: 36, type: !8)
!314 = !DILocalVariable(name: "len", scope: !306, file: !28, line: 36, type: !8)
!315 = !DILocalVariable(name: "shdr", scope: !306, file: !28, line: 37, type: !30)
!316 = !DILocalVariable(name: "cur", scope: !306, file: !28, line: 38, type: !309)
!317 = !DILocation(line: 0, scope: !306)
!318 = !DILocation(line: 40, column: 3, scope: !306)
!319 = !DILocation(line: 42, column: 31, scope: !320)
!320 = distinct !DILexicalBlock(scope: !306, file: !28, line: 41, column: 3)
!321 = !DILocation(line: 43, column: 9, scope: !322)
!322 = distinct !DILexicalBlock(scope: !320, file: !28, line: 43, column: 9)
!323 = !DILocation(line: 43, column: 9, scope: !320)
!324 = !DILocation(line: 45, column: 26, scope: !325)
!325 = distinct !DILexicalBlock(scope: !322, file: !28, line: 44, column: 5)
!326 = !{!327, !244, i64 40}
!327 = !{!"", !328, i64 0, !328, i64 4, !328, i64 8, !328, i64 12, !328, i64 16, !328, i64 20, !328, i64 24, !328, i64 28, !328, i64 32, !328, i64 36, !244, i64 40}
!328 = !{!"int", !167, i64 0}
!329 = !DILocation(line: 45, column: 13, scope: !325)
!330 = !DILocation(line: 46, column: 15, scope: !331)
!331 = distinct !DILexicalBlock(scope: !325, file: !28, line: 46, column: 11)
!332 = !DILocation(line: 46, column: 11, scope: !325)
!333 = !DILocation(line: 49, column: 16, scope: !320)
!334 = distinct !{!334, !318, !335}
!335 = !DILocation(line: 50, column: 3, scope: !306)
!336 = !DILocation(line: 51, column: 3, scope: !306)
!337 = distinct !DISubprogram(name: "print_ws", scope: !28, file: !28, line: 54, type: !338, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !27, retainedNodes: !340)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !8}
!340 = !{!341, !342}
!341 = !DILocalVariable(name: "n", arg: 1, scope: !337, file: !28, line: 54, type: !8)
!342 = !DILocalVariable(name: "i", scope: !337, file: !28, line: 56, type: !8)
!343 = !DILocation(line: 0, scope: !337)
!344 = !DILocation(line: 57, column: 17, scope: !345)
!345 = distinct !DILexicalBlock(scope: !346, file: !28, line: 57, column: 3)
!346 = distinct !DILexicalBlock(scope: !337, file: !28, line: 57, column: 3)
!347 = !DILocation(line: 57, column: 3, scope: !346)
!348 = !DILocation(line: 58, column: 5, scope: !345)
!349 = !DILocation(line: 57, column: 22, scope: !345)
!350 = distinct !{!350, !347, !351}
!351 = !DILocation(line: 58, column: 5, scope: !346)
!352 = !DILocation(line: 59, column: 1, scope: !337)
!353 = distinct !DISubprogram(name: "print_sections", scope: !28, file: !28, line: 62, type: !354, scopeLine: 63, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !27, retainedNodes: !356)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !309, !8}
!356 = !{!357, !358, !359, !360, !361, !362, !363}
!357 = !DILocalVariable(name: "sections", arg: 1, scope: !353, file: !28, line: 62, type: !309)
!358 = !DILocalVariable(name: "count", arg: 2, scope: !353, file: !28, line: 62, type: !8)
!359 = !DILocalVariable(name: "i", scope: !353, file: !28, line: 64, type: !8)
!360 = !DILocalVariable(name: "len", scope: !353, file: !28, line: 64, type: !8)
!361 = !DILocalVariable(name: "type_str", scope: !353, file: !28, line: 65, type: !47)
!362 = !DILocalVariable(name: "shdr", scope: !353, file: !28, line: 66, type: !30)
!363 = !DILocalVariable(name: "cur", scope: !353, file: !28, line: 67, type: !309)
!364 = !DILocation(line: 0, scope: !353)
!365 = !DILocation(line: 69, column: 3, scope: !353)
!366 = !DILocation(line: 70, column: 9, scope: !353)
!367 = !DILocation(line: 71, column: 3, scope: !353)
!368 = !DILocation(line: 72, column: 16, scope: !353)
!369 = !DILocation(line: 72, column: 3, scope: !353)
!370 = !DILocation(line: 73, column: 3, scope: !353)
!371 = !DILocation(line: 75, column: 3, scope: !353)
!372 = !DILocation(line: 77, column: 31, scope: !373)
!373 = distinct !DILexicalBlock(scope: !353, file: !28, line: 76, column: 3)
!374 = !DILocation(line: 78, column: 9, scope: !375)
!375 = distinct !DILexicalBlock(scope: !373, file: !28, line: 78, column: 9)
!376 = !DILocation(line: 78, column: 9, scope: !373)
!377 = !DILocation(line: 80, column: 7, scope: !378)
!378 = distinct !DILexicalBlock(scope: !375, file: !28, line: 79, column: 5)
!379 = !DILocation(line: 81, column: 35, scope: !378)
!380 = !DILocation(line: 81, column: 22, scope: !378)
!381 = !DILocation(line: 81, column: 16, scope: !378)
!382 = !DILocation(line: 81, column: 7, scope: !378)
!383 = !DILocation(line: 82, column: 46, scope: !378)
!384 = !{!327, !328, i64 4}
!385 = !DILocation(line: 82, column: 18, scope: !378)
!386 = !DILocation(line: 83, column: 7, scope: !378)
!387 = !DILocation(line: 84, column: 21, scope: !378)
!388 = !DILocation(line: 84, column: 16, scope: !378)
!389 = !DILocation(line: 84, column: 7, scope: !378)
!390 = !DILocation(line: 85, column: 7, scope: !378)
!391 = !{!327, !328, i64 12}
!392 = !{!327, !328, i64 16}
!393 = !{!327, !328, i64 20}
!394 = !DILocation(line: 86, column: 5, scope: !378)
!395 = !DILocation(line: 87, column: 16, scope: !373)
!396 = distinct !{!396, !371, !397}
!397 = !DILocation(line: 88, column: 3, scope: !353)
!398 = !DILocation(line: 89, column: 3, scope: !353)
!399 = !DILocation(line: 90, column: 1, scope: !353)
!400 = distinct !DISubprogram(name: "print_symbols", scope: !28, file: !28, line: 92, type: !354, scopeLine: 93, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !27, retainedNodes: !401)
!401 = !{!402, !403, !404, !405, !406, !407, !408}
!402 = !DILocalVariable(name: "symbols", arg: 1, scope: !400, file: !28, line: 92, type: !309)
!403 = !DILocalVariable(name: "count", arg: 2, scope: !400, file: !28, line: 92, type: !8)
!404 = !DILocalVariable(name: "type", scope: !400, file: !28, line: 94, type: !47)
!405 = !DILocalVariable(name: "bind", scope: !400, file: !28, line: 94, type: !47)
!406 = !DILocalVariable(name: "i", scope: !400, file: !28, line: 95, type: !8)
!407 = !DILocalVariable(name: "symb", scope: !400, file: !28, line: 96, type: !57)
!408 = !DILocalVariable(name: "cur", scope: !400, file: !28, line: 97, type: !309)
!409 = !DILocation(line: 0, scope: !400)
!410 = !DILocation(line: 99, column: 3, scope: !400)
!411 = !DILocation(line: 100, column: 3, scope: !400)
!412 = !DILocation(line: 101, column: 3, scope: !400)
!413 = !DILocation(line: 103, column: 30, scope: !414)
!414 = distinct !DILexicalBlock(scope: !400, file: !28, line: 102, column: 3)
!415 = !DILocation(line: 104, column: 9, scope: !416)
!416 = distinct !DILexicalBlock(scope: !414, file: !28, line: 104, column: 9)
!417 = !DILocation(line: 104, column: 9, scope: !414)
!418 = !DILocation(line: 106, column: 41, scope: !419)
!419 = distinct !DILexicalBlock(scope: !416, file: !28, line: 105, column: 5)
!420 = !{!421, !167, i64 12}
!421 = !{!"", !328, i64 0, !328, i64 4, !328, i64 8, !167, i64 12, !167, i64 13, !422, i64 14, !244, i64 16}
!422 = !{!"short", !167, i64 0}
!423 = !DILocation(line: 106, column: 49, scope: !419)
!424 = !DILocation(line: 106, column: 14, scope: !419)
!425 = !DILocation(line: 107, column: 41, scope: !419)
!426 = !DILocation(line: 107, column: 49, scope: !419)
!427 = !DILocation(line: 107, column: 14, scope: !419)
!428 = !DILocation(line: 108, column: 7, scope: !419)
!429 = !{!421, !328, i64 4}
!430 = !{!421, !328, i64 8}
!431 = !DILocation(line: 109, column: 7, scope: !419)
!432 = !DILocation(line: 110, column: 20, scope: !419)
!433 = !DILocation(line: 110, column: 16, scope: !419)
!434 = !DILocation(line: 110, column: 7, scope: !419)
!435 = !DILocation(line: 111, column: 7, scope: !419)
!436 = !DILocation(line: 112, column: 20, scope: !419)
!437 = !DILocation(line: 112, column: 16, scope: !419)
!438 = !DILocation(line: 112, column: 7, scope: !419)
!439 = !DILocation(line: 113, column: 7, scope: !419)
!440 = !{!421, !244, i64 16}
!441 = !DILocation(line: 114, column: 5, scope: !419)
!442 = !DILocation(line: 115, column: 16, scope: !414)
!443 = distinct !{!443, !412, !444}
!444 = !DILocation(line: 116, column: 3, scope: !400)
!445 = !DILocation(line: 117, column: 3, scope: !400)
!446 = !DILocation(line: 118, column: 1, scope: !400)
!447 = distinct !DISubprogram(name: "cmp_section", scope: !28, file: !28, line: 120, type: !118, scopeLine: 121, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !27, retainedNodes: !448)
!448 = !{!449, !450, !451, !454}
!449 = !DILocalVariable(name: "e1", arg: 1, scope: !447, file: !28, line: 120, type: !9)
!450 = !DILocalVariable(name: "e2", arg: 2, scope: !447, file: !28, line: 120, type: !9)
!451 = !DILocalVariable(name: "s1", scope: !452, file: !28, line: 124, type: !30)
!452 = distinct !DILexicalBlock(scope: !453, file: !28, line: 123, column: 3)
!453 = distinct !DILexicalBlock(scope: !447, file: !28, line: 122, column: 7)
!454 = !DILocalVariable(name: "s2", scope: !452, file: !28, line: 125, type: !30)
!455 = !DILocation(line: 0, scope: !447)
!456 = !DILocation(line: 122, column: 7, scope: !453)
!457 = !DILocation(line: 122, column: 13, scope: !453)
!458 = !DILocation(line: 122, column: 10, scope: !453)
!459 = !DILocation(line: 0, scope: !452)
!460 = !DILocation(line: 126, column: 16, scope: !452)
!461 = !DILocation(line: 126, column: 32, scope: !452)
!462 = !DILocation(line: 126, column: 26, scope: !452)
!463 = !DILocation(line: 129, column: 1, scope: !447)
!464 = distinct !DISubprogram(name: "cmp_symbol", scope: !28, file: !28, line: 131, type: !118, scopeLine: 132, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !27, retainedNodes: !465)
!465 = !{!466, !467, !468, !471}
!466 = !DILocalVariable(name: "e1", arg: 1, scope: !464, file: !28, line: 131, type: !9)
!467 = !DILocalVariable(name: "e2", arg: 2, scope: !464, file: !28, line: 131, type: !9)
!468 = !DILocalVariable(name: "s1", scope: !469, file: !28, line: 135, type: !57)
!469 = distinct !DILexicalBlock(scope: !470, file: !28, line: 134, column: 3)
!470 = distinct !DILexicalBlock(scope: !464, file: !28, line: 133, column: 7)
!471 = !DILocalVariable(name: "s2", scope: !469, file: !28, line: 136, type: !57)
!472 = !DILocation(line: 0, scope: !464)
!473 = !DILocation(line: 133, column: 7, scope: !470)
!474 = !DILocation(line: 133, column: 13, scope: !470)
!475 = !DILocation(line: 133, column: 10, scope: !470)
!476 = !DILocation(line: 0, scope: !469)
!477 = !DILocation(line: 137, column: 23, scope: !469)
!478 = !DILocation(line: 137, column: 40, scope: !469)
!479 = !DILocation(line: 137, column: 12, scope: !469)
!480 = !DILocation(line: 140, column: 1, scope: !464)
!481 = distinct !DISubprogram(name: "free_section", scope: !28, file: !28, line: 142, type: !25, scopeLine: 143, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !27, retainedNodes: !482)
!482 = !{!483, !484}
!483 = !DILocalVariable(name: "e", arg: 1, scope: !481, file: !28, line: 142, type: !9)
!484 = !DILocalVariable(name: "s", scope: !485, file: !28, line: 146, type: !30)
!485 = distinct !DILexicalBlock(scope: !486, file: !28, line: 145, column: 3)
!486 = distinct !DILexicalBlock(scope: !481, file: !28, line: 144, column: 7)
!487 = !DILocation(line: 0, scope: !481)
!488 = !DILocation(line: 144, column: 7, scope: !486)
!489 = !DILocation(line: 144, column: 7, scope: !481)
!490 = !DILocation(line: 0, scope: !485)
!491 = !DILocation(line: 147, column: 12, scope: !492)
!492 = distinct !DILexicalBlock(scope: !485, file: !28, line: 147, column: 9)
!493 = !DILocation(line: 147, column: 9, scope: !492)
!494 = !DILocation(line: 147, column: 9, scope: !485)
!495 = !DILocation(line: 148, column: 7, scope: !492)
!496 = !DILocation(line: 149, column: 5, scope: !485)
!497 = !DILocation(line: 150, column: 3, scope: !485)
!498 = !DILocation(line: 151, column: 1, scope: !481)
!499 = distinct !DISubprogram(name: "free_symbol", scope: !28, file: !28, line: 153, type: !25, scopeLine: 154, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !27, retainedNodes: !500)
!500 = !{!501, !502}
!501 = !DILocalVariable(name: "e", arg: 1, scope: !499, file: !28, line: 153, type: !9)
!502 = !DILocalVariable(name: "s", scope: !503, file: !28, line: 157, type: !57)
!503 = distinct !DILexicalBlock(scope: !504, file: !28, line: 156, column: 3)
!504 = distinct !DILexicalBlock(scope: !499, file: !28, line: 155, column: 7)
!505 = !DILocation(line: 0, scope: !499)
!506 = !DILocation(line: 155, column: 7, scope: !504)
!507 = !DILocation(line: 155, column: 7, scope: !499)
!508 = !DILocation(line: 0, scope: !503)
!509 = !DILocation(line: 158, column: 12, scope: !510)
!510 = distinct !DILexicalBlock(scope: !503, file: !28, line: 158, column: 9)
!511 = !DILocation(line: 158, column: 9, scope: !510)
!512 = !DILocation(line: 158, column: 9, scope: !503)
!513 = !DILocation(line: 159, column: 7, scope: !510)
!514 = !DILocation(line: 160, column: 5, scope: !503)
!515 = !DILocation(line: 161, column: 3, scope: !503)
!516 = !DILocation(line: 162, column: 1, scope: !499)
!517 = distinct !DISubprogram(name: "main", scope: !28, file: !28, line: 164, type: !518, scopeLine: 165, flags: DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !27, retainedNodes: !520)
!518 = !DISubroutineType(types: !519)
!519 = !{!8}
!520 = !{!521, !522, !523, !524, !526, !527, !528, !529, !530, !531, !532, !533, !535, !536, !539, !540, !544}
!521 = !DILocalVariable(name: "i", scope: !517, file: !28, line: 166, type: !8)
!522 = !DILocalVariable(name: "size", scope: !517, file: !28, line: 167, type: !140)
!523 = !DILocalVariable(name: "file", scope: !517, file: !28, line: 168, type: !47)
!524 = !DILocalVariable(name: "ehdr", scope: !517, file: !28, line: 169, type: !525)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "cgcf_Ehdr", file: !32, line: 49, baseType: !82)
!526 = !DILocalVariable(name: "shdr", scope: !517, file: !28, line: 170, type: !30)
!527 = !DILocalVariable(name: "cur", scope: !517, file: !28, line: 171, type: !309)
!528 = !DILocalVariable(name: "sections", scope: !517, file: !28, line: 172, type: !309)
!529 = !DILocalVariable(name: "symbols", scope: !517, file: !28, line: 173, type: !309)
!530 = !DILocalVariable(name: "tmp", scope: !517, file: !28, line: 212, type: !31)
!531 = !DILocalVariable(name: "shstrtab", scope: !517, file: !28, line: 217, type: !47)
!532 = !DILocalVariable(name: "num_syms", scope: !517, file: !28, line: 242, type: !8)
!533 = !DILocalVariable(name: "s", scope: !534, file: !28, line: 246, type: !30)
!534 = distinct !DILexicalBlock(scope: !517, file: !28, line: 245, column: 3)
!535 = !DILocalVariable(name: "strtab_sec", scope: !534, file: !28, line: 247, type: !31)
!536 = !DILocalVariable(name: "strtab", scope: !537, file: !28, line: 252, type: !47)
!537 = distinct !DILexicalBlock(scope: !538, file: !28, line: 249, column: 5)
!538 = distinct !DILexicalBlock(scope: !534, file: !28, line: 248, column: 9)
!539 = !DILocalVariable(name: "sz", scope: !537, file: !28, line: 253, type: !140)
!540 = !DILocalVariable(name: "sym", scope: !541, file: !28, line: 261, type: !57)
!541 = distinct !DILexicalBlock(scope: !542, file: !28, line: 260, column: 7)
!542 = distinct !DILexicalBlock(scope: !543, file: !28, line: 259, column: 7)
!543 = distinct !DILexicalBlock(scope: !537, file: !28, line: 259, column: 7)
!544 = !DILabel(scope: !517, name: "error", file: !28, line: 286)
!545 = !DILocation(line: 167, column: 3, scope: !517)
!546 = !DILocation(line: 169, column: 3, scope: !517)
!547 = !DILocation(line: 169, column: 13, scope: !517)
!548 = !DILocation(line: 0, scope: !517)
!549 = !DILocation(line: 176, column: 7, scope: !550)
!550 = distinct !DILexicalBlock(scope: !517, file: !28, line: 176, column: 7)
!551 = !DILocation(line: 176, column: 50, scope: !550)
!552 = !DILocation(line: 176, column: 7, scope: !517)
!553 = !DILocation(line: 180, column: 7, scope: !554)
!554 = distinct !DILexicalBlock(scope: !517, file: !28, line: 180, column: 7)
!555 = !{!556, !556, i64 0}
!556 = !{!"long", !167, i64 0}
!557 = !DILocation(line: 180, column: 12, scope: !554)
!558 = !DILocation(line: 180, column: 7, scope: !517)
!559 = !DILocation(line: 182, column: 5, scope: !560)
!560 = distinct !DILexicalBlock(scope: !554, file: !28, line: 181, column: 3)
!561 = !DILocation(line: 183, column: 5, scope: !560)
!562 = !DILocation(line: 187, column: 10, scope: !517)
!563 = !DILocation(line: 188, column: 12, scope: !564)
!564 = distinct !DILexicalBlock(scope: !517, file: !28, line: 188, column: 7)
!565 = !DILocation(line: 188, column: 7, scope: !517)
!566 = !DILocation(line: 192, column: 7, scope: !567)
!567 = distinct !DILexicalBlock(scope: !517, file: !28, line: 192, column: 7)
!568 = !DILocation(line: 192, column: 36, scope: !567)
!569 = !DILocation(line: 192, column: 33, scope: !567)
!570 = !DILocation(line: 192, column: 7, scope: !517)
!571 = !DILocation(line: 196, column: 7, scope: !572)
!572 = distinct !DILexicalBlock(scope: !517, file: !28, line: 196, column: 7)
!573 = !DILocation(line: 196, column: 49, scope: !572)
!574 = !DILocation(line: 196, column: 7, scope: !517)
!575 = !DILocation(line: 198, column: 5, scope: !576)
!576 = distinct !DILexicalBlock(scope: !572, file: !28, line: 197, column: 3)
!577 = !DILocation(line: 199, column: 5, scope: !576)
!578 = !DILocation(line: 203, column: 8, scope: !579)
!579 = distinct !DILexicalBlock(scope: !517, file: !28, line: 203, column: 7)
!580 = !DILocation(line: 203, column: 7, scope: !517)
!581 = !DILocation(line: 205, column: 5, scope: !582)
!582 = distinct !DILexicalBlock(scope: !579, file: !28, line: 204, column: 3)
!583 = !DILocation(line: 206, column: 5, scope: !582)
!584 = !DILocation(line: 209, column: 3, scope: !517)
!585 = !DILocation(line: 212, column: 13, scope: !517)
!586 = !DILocation(line: 213, column: 39, scope: !587)
!587 = distinct !DILexicalBlock(scope: !517, file: !28, line: 213, column: 7)
!588 = !DILocation(line: 213, column: 50, scope: !587)
!589 = !{!590, !422, i64 50}
!590 = !{!"", !167, i64 0, !422, i64 16, !422, i64 18, !328, i64 20, !328, i64 24, !328, i64 28, !328, i64 32, !328, i64 36, !422, i64 40, !422, i64 42, !422, i64 44, !422, i64 46, !422, i64 48, !422, i64 50}
!591 = !DILocation(line: 213, column: 7, scope: !587)
!592 = !DILocation(line: 213, column: 68, scope: !587)
!593 = !DILocation(line: 213, column: 7, scope: !517)
!594 = !DILocation(line: 215, column: 11, scope: !595)
!595 = distinct !DILexicalBlock(scope: !517, file: !28, line: 215, column: 7)
!596 = !DILocation(line: 215, column: 7, scope: !595)
!597 = !DILocation(line: 215, column: 24, scope: !595)
!598 = !DILocation(line: 215, column: 21, scope: !595)
!599 = !DILocation(line: 215, column: 7, scope: !517)
!600 = !DILocation(line: 217, column: 26, scope: !517)
!601 = !DILocation(line: 220, column: 24, scope: !602)
!602 = distinct !DILexicalBlock(scope: !603, file: !28, line: 220, column: 3)
!603 = distinct !DILexicalBlock(scope: !517, file: !28, line: 220, column: 3)
!604 = !{!590, !422, i64 48}
!605 = !DILocation(line: 220, column: 17, scope: !602)
!606 = !DILocation(line: 220, column: 3, scope: !603)
!607 = !DILocation(line: 0, scope: !608)
!608 = distinct !DILexicalBlock(scope: !609, file: !28, line: 227, column: 9)
!609 = distinct !DILexicalBlock(scope: !602, file: !28, line: 221, column: 3)
!610 = !DILocation(line: 222, column: 26, scope: !609)
!611 = !DILocation(line: 223, column: 14, scope: !612)
!612 = distinct !DILexicalBlock(scope: !609, file: !28, line: 223, column: 9)
!613 = !DILocation(line: 223, column: 9, scope: !609)
!614 = !DILocation(line: 222, column: 12, scope: !609)
!615 = !DILocation(line: 225, column: 41, scope: !616)
!616 = distinct !DILexicalBlock(scope: !609, file: !28, line: 225, column: 9)
!617 = !DILocation(line: 225, column: 47, scope: !616)
!618 = !DILocation(line: 225, column: 9, scope: !616)
!619 = !DILocation(line: 225, column: 56, scope: !616)
!620 = !DILocation(line: 225, column: 9, scope: !609)
!621 = !DILocation(line: 227, column: 16, scope: !608)
!622 = !{!327, !328, i64 0}
!623 = !DILocation(line: 227, column: 24, scope: !608)
!624 = !DILocation(line: 227, column: 69, scope: !608)
!625 = !DILocation(line: 227, column: 56, scope: !608)
!626 = !DILocation(line: 227, column: 29, scope: !608)
!627 = !DILocation(line: 229, column: 18, scope: !628)
!628 = distinct !DILexicalBlock(scope: !609, file: !28, line: 229, column: 9)
!629 = !DILocation(line: 229, column: 44, scope: !628)
!630 = !DILocation(line: 229, column: 42, scope: !628)
!631 = !DILocation(line: 229, column: 34, scope: !628)
!632 = !DILocation(line: 229, column: 77, scope: !628)
!633 = !DILocation(line: 229, column: 49, scope: !628)
!634 = !DILocation(line: 231, column: 32, scope: !609)
!635 = !DILocation(line: 231, column: 65, scope: !609)
!636 = !DILocation(line: 231, column: 25, scope: !609)
!637 = !DILocation(line: 231, column: 11, scope: !609)
!638 = !DILocation(line: 231, column: 23, scope: !609)
!639 = !DILocation(line: 232, column: 27, scope: !640)
!640 = distinct !DILexicalBlock(scope: !609, file: !28, line: 232, column: 9)
!641 = !DILocation(line: 232, column: 9, scope: !609)
!642 = !DILocation(line: 234, column: 5, scope: !609)
!643 = !DILocation(line: 235, column: 16, scope: !609)
!644 = !DILocation(line: 220, column: 33, scope: !602)
!645 = !DILocation(line: 220, column: 19, scope: !602)
!646 = distinct !{!646, !606, !647}
!647 = !DILocation(line: 236, column: 3, scope: !603)
!648 = !DILocation(line: 239, column: 3, scope: !517)
!649 = !DILocation(line: 0, scope: !534)
!650 = !DILocation(line: 0, scope: !537)
!651 = !DILocation(line: 244, column: 3, scope: !517)
!652 = !DILocation(line: 173, column: 12, scope: !517)
!653 = !DILocation(line: 242, column: 7, scope: !517)
!654 = !DILocation(line: 243, column: 7, scope: !517)
!655 = !DILocation(line: 246, column: 39, scope: !534)
!656 = !DILocation(line: 247, column: 5, scope: !534)
!657 = !DILocation(line: 247, column: 15, scope: !534)
!658 = !DILocation(line: 248, column: 12, scope: !538)
!659 = !DILocation(line: 248, column: 20, scope: !538)
!660 = !DILocation(line: 248, column: 9, scope: !534)
!661 = !DILocation(line: 250, column: 43, scope: !662)
!662 = distinct !DILexicalBlock(scope: !537, file: !28, line: 250, column: 11)
!663 = !DILocation(line: 250, column: 52, scope: !662)
!664 = !{!327, !328, i64 24}
!665 = !DILocation(line: 250, column: 49, scope: !662)
!666 = !DILocation(line: 250, column: 11, scope: !662)
!667 = !DILocation(line: 250, column: 74, scope: !662)
!668 = !DILocation(line: 250, column: 11, scope: !537)
!669 = !DILocation(line: 252, column: 41, scope: !537)
!670 = !DILocation(line: 252, column: 28, scope: !537)
!671 = !DILocation(line: 254, column: 21, scope: !537)
!672 = !DILocation(line: 254, column: 29, scope: !537)
!673 = !DILocation(line: 255, column: 14, scope: !674)
!674 = distinct !DILexicalBlock(scope: !537, file: !28, line: 255, column: 11)
!675 = !DILocation(line: 255, column: 11, scope: !674)
!676 = !DILocation(line: 255, column: 48, scope: !674)
!677 = !DILocation(line: 255, column: 37, scope: !674)
!678 = !DILocation(line: 255, column: 24, scope: !674)
!679 = !DILocation(line: 255, column: 11, scope: !537)
!680 = !DILocation(line: 257, column: 24, scope: !681)
!681 = distinct !DILexicalBlock(scope: !537, file: !28, line: 257, column: 11)
!682 = !DILocation(line: 257, column: 43, scope: !681)
!683 = !DILocation(line: 257, column: 40, scope: !681)
!684 = !DILocation(line: 257, column: 11, scope: !537)
!685 = !DILocation(line: 259, column: 21, scope: !542)
!686 = !DILocation(line: 259, column: 7, scope: !543)
!687 = !DILocation(line: 0, scope: !688)
!688 = distinct !DILexicalBlock(scope: !541, file: !28, line: 265, column: 13)
!689 = distinct !{!689, !686, !690}
!690 = !DILocation(line: 274, column: 7, scope: !543)
!691 = !DILocation(line: 261, column: 38, scope: !541)
!692 = !DILocation(line: 0, scope: !541)
!693 = !DILocation(line: 262, column: 17, scope: !694)
!694 = distinct !DILexicalBlock(scope: !541, file: !28, line: 262, column: 13)
!695 = !DILocation(line: 262, column: 13, scope: !541)
!696 = !DILocation(line: 264, column: 41, scope: !541)
!697 = !DILocation(line: 264, column: 36, scope: !541)
!698 = !DILocation(line: 264, column: 55, scope: !541)
!699 = !DILocation(line: 264, column: 51, scope: !541)
!700 = !DILocation(line: 264, column: 9, scope: !541)
!701 = !DILocation(line: 265, column: 19, scope: !688)
!702 = !{!421, !328, i64 0}
!703 = !DILocation(line: 265, column: 27, scope: !688)
!704 = !DILocation(line: 265, column: 70, scope: !688)
!705 = !DILocation(line: 265, column: 57, scope: !688)
!706 = !DILocation(line: 265, column: 32, scope: !688)
!707 = !DILocation(line: 267, column: 20, scope: !708)
!708 = distinct !DILexicalBlock(scope: !541, file: !28, line: 267, column: 13)
!709 = !DILocation(line: 267, column: 45, scope: !708)
!710 = !DILocation(line: 267, column: 43, scope: !708)
!711 = !DILocation(line: 267, column: 35, scope: !708)
!712 = !DILocation(line: 267, column: 75, scope: !708)
!713 = !DILocation(line: 267, column: 50, scope: !708)
!714 = !DILocation(line: 269, column: 35, scope: !541)
!715 = !DILocation(line: 269, column: 65, scope: !541)
!716 = !DILocation(line: 269, column: 28, scope: !541)
!717 = !DILocation(line: 269, column: 14, scope: !541)
!718 = !DILocation(line: 269, column: 26, scope: !541)
!719 = !DILocation(line: 270, column: 30, scope: !720)
!720 = distinct !DILexicalBlock(scope: !541, file: !28, line: 270, column: 13)
!721 = !DILocation(line: 270, column: 13, scope: !541)
!722 = !DILocation(line: 272, column: 9, scope: !541)
!723 = !DILocation(line: 273, column: 19, scope: !541)
!724 = !DILocation(line: 274, column: 7, scope: !542)
!725 = !DILocation(line: 259, column: 33, scope: !542)
!726 = !DILocation(line: 276, column: 16, scope: !534)
!727 = !DILocation(line: 277, column: 3, scope: !517)
!728 = distinct !{!728, !651, !727}
!729 = !DILocation(line: 280, column: 3, scope: !517)
!730 = !DILocation(line: 282, column: 3, scope: !517)
!731 = !DILocation(line: 284, column: 3, scope: !517)
!732 = !DILocation(line: 172, column: 12, scope: !517)
!733 = !DILocation(line: 286, column: 1, scope: !517)
!734 = !DILocation(line: 287, column: 3, scope: !517)
!735 = !DILocation(line: 289, column: 5, scope: !736)
!736 = distinct !DILexicalBlock(scope: !517, file: !28, line: 288, column: 7)
!737 = !DILocation(line: 290, column: 7, scope: !738)
!738 = distinct !DILexicalBlock(scope: !517, file: !28, line: 290, column: 7)
!739 = !DILocation(line: 290, column: 7, scope: !517)
!740 = !DILocation(line: 291, column: 5, scope: !738)
!741 = !DILocation(line: 292, column: 7, scope: !742)
!742 = distinct !DILexicalBlock(scope: !517, file: !28, line: 292, column: 7)
!743 = !DILocation(line: 292, column: 7, scope: !517)
!744 = !DILocation(line: 293, column: 5, scope: !742)
!745 = !DILocation(line: 295, column: 1, scope: !517)
!746 = distinct !DISubprogram(name: "cgcf_section_type2str", scope: !125, file: !125, line: 31, type: !55, scopeLine: 32, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !124, retainedNodes: !747)
!747 = !{!748}
!748 = !DILocalVariable(name: "type", arg: 1, scope: !746, file: !125, line: 31, type: !36)
!749 = !DILocation(line: 0, scope: !746)
!750 = !DILocation(line: 33, column: 3, scope: !746)
!751 = !DILocation(line: 56, column: 1, scope: !746)
!752 = distinct !DISubprogram(name: "cgcf_symbol_bind2str", scope: !125, file: !125, line: 58, type: !71, scopeLine: 59, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !124, retainedNodes: !753)
!753 = !{!754}
!754 = !DILocalVariable(name: "bind", arg: 1, scope: !752, file: !125, line: 58, type: !65)
!755 = !DILocation(line: 0, scope: !752)
!756 = !DILocation(line: 60, column: 3, scope: !752)
!757 = !DILocation(line: 69, column: 1, scope: !752)
!758 = distinct !DISubprogram(name: "cgcf_symbol_type2str", scope: !125, file: !125, line: 71, type: !71, scopeLine: 72, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !124, retainedNodes: !759)
!759 = !{!760}
!760 = !DILocalVariable(name: "type", arg: 1, scope: !758, file: !125, line: 71, type: !65)
!761 = !DILocation(line: 0, scope: !758)
!762 = !DILocation(line: 73, column: 3, scope: !758)
!763 = !DILocation(line: 86, column: 1, scope: !758)
!764 = distinct !DISubprogram(name: "cgcf_is_valid", scope: !125, file: !125, line: 88, type: !765, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !124, retainedNodes: !785)
!765 = !DISubroutineType(types: !766)
!766 = !{!8, !767}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "cgcf_Ehdr", file: !32, line: 49, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 34, size: 416, elements: !770)
!770 = !{!771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "e_ident", scope: !769, file: !32, line: 35, baseType: !85, size: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "e_type", scope: !769, file: !32, line: 36, baseType: !68, size: 16, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "e_machine", scope: !769, file: !32, line: 37, baseType: !68, size: 16, offset: 144)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "e_version", scope: !769, file: !32, line: 38, baseType: !36, size: 32, offset: 160)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "e_entry", scope: !769, file: !32, line: 39, baseType: !36, size: 32, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "e_phoff", scope: !769, file: !32, line: 40, baseType: !36, size: 32, offset: 224)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "e_shoff", scope: !769, file: !32, line: 41, baseType: !36, size: 32, offset: 256)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "e_flags", scope: !769, file: !32, line: 42, baseType: !36, size: 32, offset: 288)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "e_ehsize", scope: !769, file: !32, line: 43, baseType: !68, size: 16, offset: 320)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "e_phentsize", scope: !769, file: !32, line: 44, baseType: !68, size: 16, offset: 336)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "e_phnum", scope: !769, file: !32, line: 45, baseType: !68, size: 16, offset: 352)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "e_shentsize", scope: !769, file: !32, line: 46, baseType: !68, size: 16, offset: 368)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "e_shnum", scope: !769, file: !32, line: 47, baseType: !68, size: 16, offset: 384)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "e_shstrndx", scope: !769, file: !32, line: 48, baseType: !68, size: 16, offset: 400)
!785 = !{!786}
!786 = !DILocalVariable(name: "hdr", arg: 1, scope: !764, file: !125, line: 88, type: !767)
!787 = !DILocation(line: 0, scope: !764)
!788 = !DILocation(line: 90, column: 18, scope: !764)
!789 = !DILocation(line: 90, column: 11, scope: !764)
!790 = !DILocation(line: 90, column: 48, scope: !764)
!791 = !DILocation(line: 90, column: 3, scope: !764)
!792 = distinct !DISubprogram(name: "cgcf_parse_file_header", scope: !125, file: !125, line: 93, type: !793, scopeLine: 94, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !124, retainedNodes: !795)
!793 = !DISubroutineType(types: !794)
!794 = !{!8, !52, !140, !767}
!795 = !{!796, !797, !798}
!796 = !DILocalVariable(name: "buf", arg: 1, scope: !792, file: !125, line: 93, type: !52)
!797 = !DILocalVariable(name: "buf_len", arg: 2, scope: !792, file: !125, line: 93, type: !140)
!798 = !DILocalVariable(name: "hdr", arg: 3, scope: !792, file: !125, line: 93, type: !767)
!799 = !DILocation(line: 0, scope: !792)
!800 = !DILocation(line: 96, column: 11, scope: !801)
!801 = distinct !DILexicalBlock(scope: !792, file: !125, line: 96, column: 7)
!802 = !DILocation(line: 96, column: 26, scope: !801)
!803 = !DILocation(line: 96, column: 19, scope: !801)
!804 = !DILocation(line: 100, column: 15, scope: !805)
!805 = distinct !DILexicalBlock(scope: !792, file: !125, line: 100, column: 7)
!806 = !DILocation(line: 104, column: 3, scope: !792)
!807 = !DILocation(line: 106, column: 3, scope: !792)
!808 = !DILocation(line: 107, column: 1, scope: !792)
!809 = distinct !DISubprogram(name: "cgcf_parse_section_header", scope: !125, file: !125, line: 109, type: !810, scopeLine: 110, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !124, retainedNodes: !827)
!810 = !DISubroutineType(types: !811)
!811 = !{!8, !52, !140, !107, !812}
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "cgcf_Shdr", file: !32, line: 64, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 52, size: 384, elements: !815)
!815 = !{!816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "sh_name", scope: !814, file: !32, line: 53, baseType: !36, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "sh_type", scope: !814, file: !32, line: 54, baseType: !36, size: 32, offset: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "sh_flags", scope: !814, file: !32, line: 55, baseType: !36, size: 32, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "sh_addr", scope: !814, file: !32, line: 56, baseType: !36, size: 32, offset: 96)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "sh_offset", scope: !814, file: !32, line: 57, baseType: !36, size: 32, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "sh_size", scope: !814, file: !32, line: 58, baseType: !36, size: 32, offset: 160)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "sh_link", scope: !814, file: !32, line: 59, baseType: !36, size: 32, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "sh_info", scope: !814, file: !32, line: 60, baseType: !36, size: 32, offset: 224)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "sh_addralign", scope: !814, file: !32, line: 61, baseType: !36, size: 32, offset: 256)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "sh_entsize", scope: !814, file: !32, line: 62, baseType: !36, size: 32, offset: 288)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "sh_name_str", scope: !814, file: !32, line: 63, baseType: !47, size: 64, offset: 320)
!827 = !{!828, !829, !830, !831, !832, !833, !834}
!828 = !DILocalVariable(name: "buf", arg: 1, scope: !809, file: !125, line: 109, type: !52)
!829 = !DILocalVariable(name: "buf_len", arg: 2, scope: !809, file: !125, line: 109, type: !140)
!830 = !DILocalVariable(name: "idx", arg: 3, scope: !809, file: !125, line: 109, type: !107)
!831 = !DILocalVariable(name: "shdr", arg: 4, scope: !809, file: !125, line: 109, type: !812)
!832 = !DILocalVariable(name: "shnum", scope: !809, file: !125, line: 115, type: !107)
!833 = !DILocalVariable(name: "sz", scope: !809, file: !125, line: 116, type: !140)
!834 = !DILocalVariable(name: "ehdr", scope: !809, file: !125, line: 117, type: !768)
!835 = !DILocation(line: 0, scope: !809)
!836 = !DILocation(line: 112, column: 11, scope: !837)
!837 = distinct !DILexicalBlock(scope: !809, file: !125, line: 112, column: 7)
!838 = !DILocation(line: 112, column: 27, scope: !837)
!839 = !DILocation(line: 112, column: 19, scope: !837)
!840 = !DILocation(line: 117, column: 3, scope: !809)
!841 = !DILocation(line: 117, column: 13, scope: !809)
!842 = !DILocation(line: 118, column: 3, scope: !809)
!843 = !DILocation(line: 119, column: 12, scope: !844)
!844 = distinct !DILexicalBlock(scope: !809, file: !125, line: 119, column: 7)
!845 = !{!590, !328, i64 32}
!846 = !DILocation(line: 119, column: 27, scope: !844)
!847 = !{!590, !422, i64 46}
!848 = !DILocation(line: 119, column: 22, scope: !844)
!849 = !DILocation(line: 119, column: 41, scope: !844)
!850 = !DILocation(line: 119, column: 39, scope: !844)
!851 = !DILocation(line: 119, column: 20, scope: !844)
!852 = !DILocation(line: 119, column: 7, scope: !844)
!853 = !DILocation(line: 119, column: 45, scope: !844)
!854 = !DILocation(line: 119, column: 50, scope: !844)
!855 = !DILocation(line: 119, column: 7, scope: !809)
!856 = !DILocation(line: 121, column: 16, scope: !809)
!857 = !DILocation(line: 125, column: 11, scope: !858)
!858 = distinct !DILexicalBlock(scope: !809, file: !125, line: 125, column: 7)
!859 = !DILocation(line: 125, column: 7, scope: !809)
!860 = !DILocation(line: 128, column: 5, scope: !861)
!861 = distinct !DILexicalBlock(scope: !858, file: !125, line: 127, column: 3)
!862 = !DILocation(line: 128, column: 23, scope: !861)
!863 = !DILocation(line: 128, column: 38, scope: !861)
!864 = !DILocation(line: 129, column: 5, scope: !861)
!865 = !DILocation(line: 132, column: 1, scope: !809)
