; ModuleID = 'main.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.FILE = type opaque
%struct.bit_io = type { i8*, i32, i32 }
%struct.sc_obj = type { [95 x i8], i8*, i64, i32 (i8*, i8*, i8*, i64)* }

@secret = dso_local local_unnamed_addr global i8* inttoptr (i64 1128775680 to i8*), align 8, !dbg !0
@str = private unnamed_addr constant [12 x i8] c"1. Compress\00", align 1
@str.16 = private unnamed_addr constant [14 x i8] c"2. Decompress\00", align 1
@str.17 = private unnamed_addr constant [8 x i8] c"3. Quit\00", align 1
@str.18 = private unnamed_addr constant [5 x i8] c"Key?\00", align 1
@stdin = external dso_local local_unnamed_addr constant %struct.FILE*, align 8
@str.19 = private unnamed_addr constant [6 x i8] c"Data?\00", align 1
@stdout = external dso_local local_unnamed_addr constant %struct.FILE*, align 8
@.str.5 = private unnamed_addr constant [19 x i8] c"Original Size: %d\0A\00", align 1
@.str.6 = private unnamed_addr constant [28 x i8] c"Compressed Size: %d (%d%%)\0A\00", align 1
@.str.7 = private unnamed_addr constant [18 x i8] c"Compressed Data: \00", align 1
@.str.8 = private unnamed_addr constant [5 x i8] c"%02X\00", align 1
@str.20 = private unnamed_addr constant [7 x i8] c"error.\00", align 1
@str.21 = private unnamed_addr constant [5 x i8] c"Key?\00", align 1
@str.22 = private unnamed_addr constant [8 x i8] c"Length?\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "secret", scope: !2, file: !3, line: 30, type: !64, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !63, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "main.c", directory: "/home/salman/DPP/data/KPRCA_00064/src")
!4 = !{}
!5 = !{!6, !15, !19, !21, !24, !45, !18, !50, !54, !55, !60}
!6 = !DISubprogram(name: "fread", scope: !7, file: !7, line: 43, type: !8, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!7 = !DIFile(filename: "./stdio.h", directory: "/home/salman/DPP/data/KPRCA_00064/src")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !11, !12, !13}
!10 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!12 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "FILE", file: !7, line: 29, flags: DIFlagFwdDecl)
!15 = !DISubprogram(name: "fflush", scope: !7, file: !7, line: 46, type: !16, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!16 = !DISubroutineType(types: !17)
!17 = !{!18, !13}
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!21 = !DISubprogram(name: "freaduntil", scope: !7, file: !7, line: 44, type: !22, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!22 = !DISubroutineType(types: !23)
!23 = !{!10, !19, !12, !20, !13}
!24 = !DISubprogram(name: "sc_new", scope: !25, file: !25, line: 47, type: !26, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!25 = !DIFile(filename: "./sc.h", directory: "/home/salman/DPP/data/KPRCA_00064/src")
!26 = !DISubroutineType(types: !27)
!27 = !{!28, !37}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sc_obj", file: !25, line: 40, size: 960, elements: !30)
!30 = !{!31, !36, !38, !41}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !29, file: !25, line: 41, baseType: !32, size: 760)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 760, elements: !34)
!33 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!34 = !{!35}
!35 = !DISubrange(count: 95)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !29, file: !25, line: 42, baseType: !37, size: 64, offset: 768)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !29, file: !25, line: 43, baseType: !39, size: 64, offset: 832)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !40, line: 13, baseType: !12)
!40 = !DIFile(filename: "./libcgc.h", directory: "/home/salman/DPP/data/KPRCA_00064/src")
!41 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !29, file: !25, line: 44, baseType: !42, size: 64, offset: 896)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!18, !37, !37, !37, !39}
!45 = !DISubprogram(name: "sc_scompress", scope: !25, file: !25, line: 48, type: !46, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!46 = !DISubroutineType(types: !47)
!47 = !{!18, !28, !48, !49}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!50 = !DISubprogram(name: "free", scope: !51, file: !51, line: 32, type: !52, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!51 = !DIFile(filename: "./stdlib.h", directory: "/home/salman/DPP/data/KPRCA_00064/src")
!52 = !DISubroutineType(types: !53)
!53 = !{null, !11}
!54 = !DISubprogram(name: "sc_sdecompress", scope: !25, file: !25, line: 49, type: !46, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!55 = !DISubprogram(name: "fwrite", scope: !7, file: !7, line: 45, type: !56, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!56 = !DISubroutineType(types: !57)
!57 = !{!10, !58, !12, !13}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!60 = !DISubprogram(name: "fbuffered", scope: !7, file: !7, line: 47, type: !61, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !13, !18}
!63 = !{!0}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!66 = distinct !DICompileUnit(language: DW_LANG_C99, file: !67, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !68, splitDebugInlining: false, nameTableKind: None)
!67 = !DIFile(filename: "sc.c", directory: "/home/salman/DPP/data/KPRCA_00064/src")
!68 = !{!69, !11, !77, !90, !94, !95, !97, !99, !33}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "bio_t", file: !25, line: 34, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bit_io", file: !25, line: 30, size: 128, elements: !72)
!72 = !{!73, !74, !76}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !71, file: !25, line: 31, baseType: !37, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "didx", scope: !71, file: !25, line: 32, baseType: !75, size: 32, offset: 64)
!75 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "bidx", scope: !71, file: !25, line: 33, baseType: !75, size: 32, offset: 96)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "sc_obj_t", file: !25, line: 45, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sc_obj", file: !25, line: 40, size: 960, elements: !80)
!80 = !{!81, !82, !83, !86}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !79, file: !25, line: 41, baseType: !32, size: 760)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !79, file: !25, line: 42, baseType: !37, size: 64, offset: 768)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !79, file: !25, line: 43, baseType: !84, size: 64, offset: 832)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !85, line: 46, baseType: !12)
!85 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!86 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !79, file: !25, line: 44, baseType: !87, size: 64, offset: 896)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!18, !37, !37, !37, !84}
!90 = !DISubprogram(name: "sc_bwt", scope: !25, file: !25, line: 51, type: !91, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!91 = !DISubroutineType(types: !92)
!92 = !{!37, !93, !18, !49}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!94 = !DISubprogram(name: "sc_mtf", scope: !25, file: !25, line: 52, type: !91, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!95 = !DISubprogram(name: "free", scope: !96, file: !96, line: 565, type: !52, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!96 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!100 = !{!"clang version 10.0.0-4ubuntu1 "}
!101 = !{i32 7, !"Dwarf Version", i32 4}
!102 = !{i32 2, !"Debug Info Version", i32 3}
!103 = !{i32 1, !"wchar_size", i32 4}
!104 = distinct !DISubprogram(name: "bit_new", scope: !67, file: !67, line: 30, type: !105, scopeLine: 31, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !107)
!105 = !DISubroutineType(types: !106)
!106 = !{!69, !37}
!107 = !{!108, !109}
!108 = !DILocalVariable(name: "data", arg: 1, scope: !104, file: !67, line: 30, type: !37)
!109 = !DILocalVariable(name: "bio", scope: !104, file: !67, line: 32, type: !69)
!110 = !DILocation(line: 0, scope: !104)
!111 = !DILocation(line: 32, column: 28, scope: !104)
!112 = !DILocation(line: 32, column: 18, scope: !104)
!113 = !DILocation(line: 33, column: 10, scope: !104)
!114 = !DILocation(line: 33, column: 15, scope: !104)
!115 = !{!116, !117, i64 0}
!116 = !{!"bit_io", !117, i64 0, !120, i64 8, !120, i64 12}
!117 = !{!"any pointer", !118, i64 0}
!118 = !{!"omnipotent char", !119, i64 0}
!119 = !{!"Simple C/C++ TBAA"}
!120 = !{!"int", !118, i64 0}
!121 = !DILocation(line: 34, column: 10, scope: !104)
!122 = !DILocation(line: 34, column: 15, scope: !104)
!123 = !{!116, !120, i64 8}
!124 = !DILocation(line: 35, column: 10, scope: !104)
!125 = !DILocation(line: 35, column: 15, scope: !104)
!126 = !{!116, !120, i64 12}
!127 = !DILocation(line: 37, column: 5, scope: !104)
!128 = distinct !DISubprogram(name: "bit_read", scope: !67, file: !67, line: 40, type: !129, scopeLine: 41, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !131)
!129 = !DISubroutineType(types: !130)
!130 = !{!33, !69, !84}
!131 = !{!132, !133, !134, !135, !136, !137}
!132 = !DILocalVariable(name: "bio", arg: 1, scope: !128, file: !67, line: 40, type: !69)
!133 = !DILocalVariable(name: "n", arg: 2, scope: !128, file: !67, line: 40, type: !84)
!134 = !DILocalVariable(name: "i", scope: !128, file: !67, line: 42, type: !84)
!135 = !DILocalVariable(name: "b", scope: !128, file: !67, line: 43, type: !33)
!136 = !DILocalVariable(name: "ret", scope: !128, file: !67, line: 43, type: !33)
!137 = !DILocalVariable(name: "c", scope: !138, file: !67, line: 51, type: !33)
!138 = distinct !DILexicalBlock(scope: !139, file: !67, line: 45, column: 5)
!139 = distinct !DILexicalBlock(scope: !140, file: !67, line: 44, column: 5)
!140 = distinct !DILexicalBlock(scope: !128, file: !67, line: 44, column: 5)
!141 = !DILocation(line: 0, scope: !128)
!142 = !DILocation(line: 43, column: 28, scope: !128)
!143 = !DILocation(line: 43, column: 38, scope: !128)
!144 = !DILocation(line: 44, column: 19, scope: !139)
!145 = !DILocation(line: 44, column: 5, scope: !140)
!146 = !DILocation(line: 43, column: 23, scope: !128)
