; ModuleID = './main.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Command = type { [4 x i8], i64, i64, [4600 x i8] }
%struct.resource_t = type { %struct.resource_t*, [10 x i8], i64 }
%struct.user_t = type { %struct.user_t*, i64, i64, %struct.resource_t* }

@.str = private unnamed_addr constant [36 x i8] c"Authentication failed for resource \00", align 1
@.str.2 = private unnamed_addr constant [11 x i8] c"Access to \00", align 1
@.str.3 = private unnamed_addr constant [13 x i8] c" is granted!\00", align 1
@.str.4 = private unnamed_addr constant [19 x i8] c"Resource revoked.\0A\00", align 1
@.str.5 = private unnamed_addr constant [20 x i8] c"Revocation denied.\0A\00", align 1
@.str.6 = private unnamed_addr constant [5 x i8] c"AUTH\00", align 1
@.str.7 = private unnamed_addr constant [17 x i8] c"Command failed.\0A\00", align 1
@.str.8 = private unnamed_addr constant [5 x i8] c"LOUT\00", align 1
@.str.9 = private unnamed_addr constant [26 x i8] c"Logged out successfully.\0A\00", align 1
@.str.10 = private unnamed_addr constant [5 x i8] c"REQR\00", align 1
@.str.11 = private unnamed_addr constant [25 x i8] c"Please re-authenticate.\0A\00", align 1
@.str.12 = private unnamed_addr constant [16 x i8] c"Please log in.\0A\00", align 1
@.str.13 = private unnamed_addr constant [5 x i8] c"REVR\00", align 1

; Function Attrs: nounwind uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "service.c", directory: "/home/salman/DPP/data/DARPA/NRFIN_00033/src")
!2 = !{}
!3 = !{!4, !13, !18, !19, !23, !25, !26, !29, !30, !33, !36, !39, !42, !45, !57, !66}
!4 = !DISubprogram(name: "transmit_all", scope: !5, file: !5, line: 360, type: !6, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!5 = !DIFile(filename: "./libc.h", directory: "/home/salman/DPP/data/DARPA/NRFIN_00033/src")
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !8, !9, !12}
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!12 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!13 = !DISubprogram(name: "_terminate", scope: !14, file: !14, line: 50, type: !15, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !2)
!14 = !DIFile(filename: "./libcgc.h", directory: "/home/salman/DPP/data/DARPA/NRFIN_00033/src")
!15 = !DISubroutineType(types: !16)
!16 = !{null, !17}
!17 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!19 = !DISubprogram(name: "random", scope: !14, file: !14, line: 57, type: !20, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!20 = !DISubroutineType(types: !21)
!21 = !{!8, !18, !12, !22}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!26 = !DISubprogram(name: "recv", scope: !5, file: !5, line: 208, type: !27, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!27 = !DISubroutineType(types: !28)
!28 = !{!8, !8, !25, !12}
!29 = !DISubprogram(name: "recvline", scope: !5, file: !5, line: 198, type: !27, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!30 = !DISubprogram(name: "strlen", scope: !5, file: !5, line: 244, type: !31, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!31 = !DISubroutineType(types: !32)
!32 = !{!12, !25}
!33 = !DISubprogram(name: "memset", scope: !5, file: !5, line: 272, type: !34, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!34 = !DISubroutineType(types: !35)
!35 = !{!18, !18, !11, !12}
!36 = !DISubprogram(name: "strcat", scope: !5, file: !5, line: 236, type: !37, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!37 = !DISubroutineType(types: !38)
!38 = !{!25, !25, !25}
!39 = !DISubprogram(name: "strnlen", scope: !5, file: !5, line: 361, type: !40, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!40 = !DISubroutineType(types: !41)
!41 = !{!12, !9, !12}
!42 = !DISubprogram(name: "memcpy", scope: !5, file: !5, line: 282, type: !43, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!43 = !DISubroutineType(types: !44)
!44 = !{!18, !18, !18, !12}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "Resource", file: !47, line: 69, baseType: !48)
!47 = !DIFile(filename: "./service.h", directory: "/home/salman/DPP/data/DARPA/NRFIN_00033/src")
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "resource_t", file: !47, line: 65, size: 256, elements: !49)
!49 = !{!50, !52, !56}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !48, file: !47, line: 66, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !48, file: !47, line: 67, baseType: !53, size: 80, offset: 64)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 80, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 10, lowerBound: 0)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !48, file: !47, line: 68, baseType: !12, size: 64, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "User", file: !47, line: 76, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "user_t", file: !47, line: 71, size: 256, elements: !60)
!60 = !{!61, !63, !64, !65}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !59, file: !47, line: 72, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !59, file: !47, line: 73, baseType: !12, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !59, file: !47, line: 74, baseType: !12, size: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "resourceList", scope: !59, file: !47, line: 75, baseType: !45, size: 64, offset: 192)
!66 = !DISubprogram(name: "free", scope: !5, file: !5, line: 340, type: !67, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !18}
!69 = !{!"clang version 10.0.0-4ubuntu1 "}
!70 = !{i32 7, !"Dwarf Version", i32 4}
!71 = !{i32 2, !"Debug Info Version", i32 3}
!72 = !{i32 1, !"wchar_size", i32 4}
!73 = distinct !DISubprogram(name: "reportMessage", scope: !1, file: !1, line: 26, type: !74, scopeLine: 26, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !77)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !25, !76}
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !14, line: 10, baseType: !12)
!77 = !{!78, !79, !80}
!78 = !DILocalVariable(name: "message", arg: 1, scope: !73, file: !1, line: 26, type: !25)
!79 = !DILocalVariable(name: "message_size", arg: 2, scope: !73, file: !1, line: 26, type: !76)
!80 = !DILocalVariable(name: "ret", scope: !73, file: !1, line: 27, type: !8)
!81 = !DILocation(line: 0, scope: !73)
!82 = !DILocation(line: 28, column: 8, scope: !73)
!83 = !DILocation(line: 29, column: 9, scope: !84)
!84 = distinct !DILexicalBlock(scope: !73, file: !1, line: 29, column: 5)
!85 = !DILocation(line: 29, column: 5, scope: !73)
!86 = !DILocation(line: 30, column: 3, scope: !84)
!87 = !DILocation(line: 31, column: 1, scope: !73)
!88 = distinct !DISubprogram(name: "getAuthVal", scope: !1, file: !1, line: 33, type: !89, scopeLine: 33, flags: DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !91)
!89 = !DISubroutineType(types: !90)
!90 = !{!12}
!91 = !{!92, !93, !94, !95, !96}
!92 = !DILocalVariable(name: "auth_val", scope: !88, file: !1, line: 35, type: !12)
!93 = !DILocalVariable(name: "rnd_bytes", scope: !88, file: !1, line: 36, type: !76)
!94 = !DILocalVariable(name: "ret", scope: !88, file: !1, line: 37, type: !8)
!95 = !DILocalVariable(name: "b", scope: !88, file: !1, line: 39, type: !8)
!96 = !DILocalVariable(name: "byte", scope: !97, file: !1, line: 41, type: !11)
!97 = distinct !DILexicalBlock(scope: !98, file: !1, line: 40, column: 23)
!98 = distinct !DILexicalBlock(scope: !99, file: !1, line: 40, column: 2)
!99 = distinct !DILexicalBlock(scope: !88, file: !1, line: 40, column: 2)
!100 = !DILocation(line: 35, column: 2, scope: !88)
!101 = !DILocation(line: 36, column: 2, scope: !88)
!102 = !DILocation(line: 0, scope: !88)
!103 = !DILocation(line: 40, column: 2, scope: !99)
!104 = !DILocation(line: 41, column: 3, scope: !97)
!105 = !DILocation(line: 0, scope: !97)
!106 = !DILocation(line: 41, column: 8, scope: !97)
!107 = !{!108, !108, i64 0}
!108 = !{!"omnipotent char", !109, i64 0}
!109 = !{!"Simple C/C++ TBAA"}
!110 = !DILocation(line: 42, column: 3, scope: !97)
!111 = !DILocation(line: 42, column: 10, scope: !97)
!112 = !DILocation(line: 43, column: 10, scope: !113)
!113 = distinct !DILexicalBlock(scope: !97, file: !1, line: 42, column: 37)
!114 = !DILocation(line: 44, column: 11, scope: !115)
!115 = distinct !DILexicalBlock(scope: !113, file: !1, line: 44, column: 7)
!116 = !DILocation(line: 44, column: 7, scope: !113)
!117 = distinct !{!117, !110, !118}
!118 = !DILocation(line: 46, column: 3, scope: !97)
!119 = !DILocation(line: 45, column: 5, scope: !115)
!120 = !DILocation(line: 47, column: 3, scope: !97)
!121 = !DILocation(line: 47, column: 36, scope: !97)
!122 = !DILocation(line: 48, column: 2, scope: !98)
!123 = !DILocation(line: 40, column: 19, scope: !98)
!124 = !DILocation(line: 40, column: 14, scope: !98)
!125 = distinct !{!125, !103, !126}
!126 = !DILocation(line: 48, column: 2, scope: !99)
!127 = !DILocation(line: 51, column: 9, scope: !88)
!128 = !{!129, !129, i64 0}
!129 = !{!"long", !108, i64 0}
!130 = !DILocation(line: 52, column: 1, scope: !88)
!131 = !DILocation(line: 51, column: 2, scope: !88)
!132 = distinct !DISubprogram(name: "receiveCommand", scope: !1, file: !1, line: 54, type: !133, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !149)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !135}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "Command", file: !47, line: 63, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !47, line: 58, size: 36992, elements: !138)
!138 = !{!139, !143, !144, !145}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !137, file: !47, line: 59, baseType: !140, size: 32)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 32, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 4, lowerBound: 0)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !137, file: !47, line: 60, baseType: !12, size: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !137, file: !47, line: 61, baseType: !12, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !137, file: !47, line: 62, baseType: !146, size: 36800, offset: 192)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 36800, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 4600, lowerBound: 0)
!149 = !{!150, !151, !152}
!150 = !DILocalVariable(name: "command", arg: 1, scope: !132, file: !1, line: 54, type: !135)
!151 = !DILocalVariable(name: "bytesReceived", scope: !132, file: !1, line: 55, type: !8)
!152 = !DILocalVariable(name: "ret", scope: !132, file: !1, line: 56, type: !8)
!153 = !DILocation(line: 0, scope: !132)
!154 = !DILocation(line: 58, column: 30, scope: !132)
!155 = !DILocation(line: 58, column: 18, scope: !132)
!156 = !DILocation(line: 59, column: 19, scope: !157)
!157 = distinct !DILexicalBlock(scope: !132, file: !1, line: 59, column: 5)
!158 = !DILocation(line: 59, column: 5, scope: !132)
!159 = !DILocation(line: 60, column: 3, scope: !157)
!160 = !DILocation(line: 64, column: 3, scope: !161)
!161 = distinct !DILexicalBlock(scope: !162, file: !1, line: 63, column: 2)
!162 = distinct !DILexicalBlock(scope: !132, file: !1, line: 63, column: 2)
!163 = !DILocation(line: 63, column: 29, scope: !161)
!164 = !DILocation(line: 63, column: 19, scope: !161)
!165 = !DILocation(line: 63, column: 2, scope: !162)
!166 = distinct !{!166, !165, !167}
!167 = !DILocation(line: 64, column: 14, scope: !162)
!168 = !DILocation(line: 66, column: 34, scope: !132)
!169 = !DILocation(line: 66, column: 18, scope: !132)
!170 = !DILocation(line: 67, column: 19, scope: !171)
!171 = distinct !DILexicalBlock(scope: !132, file: !1, line: 67, column: 5)
!172 = !DILocation(line: 67, column: 5, scope: !132)
!173 = !DILocation(line: 68, column: 3, scope: !171)
!174 = !DILocation(line: 70, column: 1, scope: !132)
!175 = distinct !DISubprogram(name: "auth_failure", scope: !1, file: !1, line: 72, type: !176, scopeLine: 72, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !178)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !25}
!178 = !{!179, !180, !184, !185, !186}
!179 = !DILocalVariable(name: "resource", arg: 1, scope: !175, file: !1, line: 72, type: !25)
!180 = !DILocalVariable(name: "temp_buf", scope: !175, file: !1, line: 73, type: !181)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 1608, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 201, lowerBound: 0)
!184 = !DILocalVariable(name: "message_buf", scope: !175, file: !1, line: 74, type: !25)
!185 = !DILocalVariable(name: "ret", scope: !175, file: !1, line: 75, type: !8)
!186 = !DILocalVariable(name: "message_size", scope: !175, file: !1, line: 76, type: !76)
!187 = !DILocation(line: 0, scope: !175)
!188 = !DILocation(line: 78, column: 17, scope: !175)
!189 = !DILocation(line: 78, column: 57, scope: !175)
!190 = !DILocation(line: 81, column: 17, scope: !191)
!191 = distinct !DILexicalBlock(scope: !192, file: !1, line: 80, column: 26)
!192 = distinct !DILexicalBlock(scope: !175, file: !1, line: 80, column: 5)
!193 = !DILocation(line: 82, column: 18, scope: !194)
!194 = distinct !DILexicalBlock(scope: !191, file: !1, line: 82, column: 6)
!195 = !DILocation(line: 82, column: 6, scope: !191)
!196 = !DILocation(line: 83, column: 4, scope: !194)
!197 = !DILocation(line: 84, column: 3, scope: !191)
!198 = !DILocation(line: 87, column: 2, scope: !175)
!199 = !DILocation(line: 88, column: 2, scope: !175)
!200 = !DILocation(line: 89, column: 2, scope: !175)
!201 = !DILocation(line: 91, column: 29, scope: !175)
!202 = !DILocation(line: 91, column: 2, scope: !175)
!203 = !DILocation(line: 98, column: 1, scope: !175)
!204 = distinct !DISubprogram(name: "auth_success", scope: !1, file: !1, line: 100, type: !31, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !205)
!205 = !{!206, !207, !211, !212, !213, !214, !215}
