; ModuleID = './main.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.var = type { %struct.var*, i8*, i32, i32 }
%struct.viewtype = type { i8*, i64, i32 }
%struct.viewvar = type { %struct.var, %struct.arrvar*, %struct.viewtype*, i32, i8* }
%struct.arrvar = type { %struct.var, i64, [0 x i8] }
%struct.numvar = type { %struct.var, i32 }

@.str = private unnamed_addr constant [6 x i8] c"Done.\00", align 1
@cmds = internal unnamed_addr constant [4 x i8*] [i8* getelementptr inbounds ([4 x i8], [4 x i8]* @.str.1, i32 0, i32 0), i8* getelementptr inbounds ([4 x i8], [4 x i8]* @.str.2, i32 0, i32 0), i8* getelementptr inbounds ([4 x i8], [4 x i8]* @.str.3, i32 0, i32 0), i8* getelementptr inbounds ([4 x i8], [4 x i8]* @.str.4, i32 0, i32 0)], align 16, !dbg !0
@handlers = internal unnamed_addr constant [4 x i32 (...)*] [i32 (...)* bitcast (i32 ()* @handlenew to i32 (...)*), i32 (...)* bitcast (i32 ()* @handleget to i32 (...)*), i32 (...)* bitcast (i32 ()* @handleset to i32 (...)*), i32 (...)* bitcast (i32 ()* @handledel to i32 (...)*)], align 16, !dbg !105
@global_nspace.0 = internal unnamed_addr global %struct.var* null, align 8, !dbg !136
@global_nspace.1 = internal unnamed_addr global %struct.var* null, align 8, !dbg !137
@global_nspace.2 = internal unnamed_addr global i32 0, align 8, !dbg !138

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "cmds", scope: !2, file: !3, line: 212, type: !135, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !11, globals: !104, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "viewscript.c", directory: "/home/salman/DPP/data/DARPA/NRFIN_00042/src")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 65, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "NUMTYPE", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "ARRTYPE", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "VIEWTYPE", value: 2, isUnsigned: true)
!11 = !{!12, !20, !24, !27, !30, !36, !40, !43, !46, !56, !59, !62, !74, !80, !83, !84, !100, !18, !101}
!12 = !DISubprogram(name: "strlen", scope: !13, file: !13, line: 280, type: !14, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!13 = !DIFile(filename: "./libc.h", directory: "/home/salman/DPP/data/DARPA/NRFIN_00042/src")
!14 = !DISubroutineType(types: !15)
!15 = !{!16, !17}
!16 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!19 = !{}
!20 = !DISubprogram(name: "calloc", scope: !13, file: !13, line: 439, type: !21, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!21 = !DISubroutineType(types: !22)
!22 = !{!23, !16}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!24 = !DISubprogram(name: "strtok", scope: !13, file: !13, line: 354, type: !25, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!25 = !DISubroutineType(types: !26)
!26 = !{!17, !17, !18}
!27 = !DISubprogram(name: "free", scope: !13, file: !13, line: 423, type: !28, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!28 = !DISubroutineType(types: !29)
!29 = !{null, !23}
!30 = !DISubprogram(name: "sendline", scope: !13, file: !13, line: 213, type: !31, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!31 = !DISubroutineType(types: !32)
!32 = !{!33, !33, !34, !16}
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!36 = !DISubprogram(name: "_terminate", scope: !37, file: !37, line: 50, type: !38, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !19)
!37 = !DIFile(filename: "./libcgc.h", directory: "/home/salman/DPP/data/DARPA/NRFIN_00042/src")
!38 = !DISubroutineType(types: !39)
!39 = !{null, !6}
!40 = !DISubprogram(name: "streq", scope: !13, file: !13, line: 289, type: !41, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!41 = !DISubroutineType(types: !42)
!42 = !{!33, !17, !17}
!43 = !DISubprogram(name: "str2int", scope: !13, file: !13, line: 193, type: !44, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!44 = !DISubroutineType(types: !45)
!45 = !{!33, !34}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "var_t", file: !3, line: 87, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var", file: !3, line: 82, size: 192, elements: !49)
!49 = !{!50, !52, !53, !55}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !48, file: !3, line: 83, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !48, file: !3, line: 84, baseType: !17, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !48, file: !3, line: 85, baseType: !54, size: 32, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "varenum", file: !3, line: 65, baseType: !5)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !48, file: !3, line: 86, baseType: !33, size: 32, offset: 160)
!56 = !DISubprogram(name: "strcpy", scope: !13, file: !13, line: 253, type: !57, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!57 = !DISubroutineType(types: !58)
!58 = !{!16, !17, !17}
!59 = !DISubprogram(name: "str2uint", scope: !13, file: !13, line: 185, type: !60, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!60 = !DISubroutineType(types: !61)
!61 = !{!6, !34}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "arrvar_t", file: !3, line: 98, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arrvar", file: !3, line: 94, size: 256, elements: !65)
!65 = !{!66, !67, !69}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !64, file: !3, line: 95, baseType: !47, size: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !64, file: !3, line: 96, baseType: !68, size: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !37, line: 10, baseType: !16)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !64, file: !3, line: 97, baseType: !70, offset: 256)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, elements: !72)
!71 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!72 = !{!73}
!73 = !DISubrange(count: 0, lowerBound: 0)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "numvar_t", file: !3, line: 92, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "numvar", file: !3, line: 89, size: 256, elements: !77)
!77 = !{!78, !79}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !76, file: !3, line: 90, baseType: !47, size: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !76, file: !3, line: 91, baseType: !33, size: 32, offset: 192)
!80 = !DISubprogram(name: "int2str", scope: !13, file: !13, line: 177, type: !81, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!81 = !DISubroutineType(types: !82)
!82 = !{!33, !17, !33, !33}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "viewvar_t", file: !3, line: 106, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "viewvar", file: !3, line: 100, size: 448, elements: !87)
!87 = !{!88, !89, !90, !98, !99}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !86, file: !3, line: 101, baseType: !47, size: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !86, file: !3, line: 102, baseType: !62, size: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !86, file: !3, line: 103, baseType: !91, size: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "viewtype_t", file: !3, line: 71, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "viewtype", file: !3, line: 67, size: 192, elements: !94)
!94 = !{!95, !96, !97}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !93, file: !3, line: 68, baseType: !17, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !93, file: !3, line: 69, baseType: !68, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !93, file: !3, line: 70, baseType: !33, size: 32, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !86, file: !3, line: 104, baseType: !33, size: 32, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "bytesize", scope: !86, file: !3, line: 105, baseType: !17, size: 64, offset: 384)
!100 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!101 = !DISubprogram(name: "uint2str", scope: !13, file: !13, line: 167, type: !102, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!102 = !DISubroutineType(types: !103)
!103 = !{!33, !17, !33, !6}
!104 = !{!0, !105, !113, !121, !126, !130}
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "handlers", scope: !2, file: !3, line: 213, type: !107, isLocal: true, isDefinition: true)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 256, elements: !111)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!33, null}
!111 = !{!112}
!112 = !DISubrange(count: 4, lowerBound: 0)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "global_nspace", scope: !2, file: !3, line: 216, type: !115, isLocal: true, isDefinition: true)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "nspace_t", file: !3, line: 112, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nspace", file: !3, line: 108, size: 192, elements: !117)
!117 = !{!118, !119, !120}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !116, file: !3, line: 109, baseType: !46, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !116, file: !3, line: 110, baseType: !46, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !116, file: !3, line: 111, baseType: !33, size: 32, offset: 128)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "types", scope: !2, file: !3, line: 214, type: !123, isLocal: true, isDefinition: true)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 192, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 3, lowerBound: 0)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "constructors", scope: !2, file: !3, line: 215, type: !128, isLocal: true, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 192, elements: !124)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "viewtypes", scope: !2, file: !3, line: 73, type: !132, isLocal: true, isDefinition: true)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 1152, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 6, lowerBound: 0)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 256, elements: !111)
!136 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 64))
!137 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression(DW_OP_LLVM_fragment, 64, 64))
!138 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression(DW_OP_LLVM_fragment, 128, 32))
!139 = distinct !DICompileUnit(language: DW_LANG_C99, file: !140, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !19, retainedTypes: !141, splitDebugInlining: false, nameTableKind: None)
!140 = !DIFile(filename: "service.c", directory: "/home/salman/DPP/data/DARPA/NRFIN_00042/src")
!141 = !{!142, !145}
!142 = !DISubprogram(name: "recvuntil", scope: !13, file: !13, line: 234, type: !143, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!143 = !DISubroutineType(types: !144)
!144 = !{!33, !33, !17, !16, !18}
!145 = !DISubprogram(name: "run_viewscript", scope: !146, file: !146, line: 32, type: !147, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!146 = !DIFile(filename: "./viewscript.h", directory: "/home/salman/DPP/data/DARPA/NRFIN_00042/src")
!147 = !DISubroutineType(types: !148)
!148 = !{!33, !17}
!149 = !{!"clang version 10.0.0-4ubuntu1 "}
!150 = !{i32 7, !"Dwarf Version", i32 4}
!151 = !{i32 2, !"Debug Info Version", i32 3}
!152 = !{i32 1, !"wchar_size", i32 4}
!153 = distinct !DISubprogram(name: "main", scope: !140, file: !140, line: 27, type: !154, scopeLine: 27, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !139, retainedNodes: !156)
!154 = !DISubroutineType(types: !155)
!155 = !{!33}
!156 = !{!157, !161}
!157 = !DILocalVariable(name: "buf", scope: !153, file: !140, line: 28, type: !158)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 32768, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 4096, lowerBound: 0)
!161 = !DILocalVariable(name: "res", scope: !153, file: !140, line: 30, type: !33)
!162 = !DILocation(line: 28, column: 5, scope: !153)
!163 = !DILocation(line: 28, column: 10, scope: !153)
!164 = !DILocation(line: 30, column: 15, scope: !153)
!165 = !DILocation(line: 0, scope: !153)
!166 = !DILocation(line: 31, column: 13, scope: !167)
!167 = distinct !DILexicalBlock(scope: !153, file: !140, line: 31, column: 9)
!168 = !DILocation(line: 31, column: 9, scope: !153)
!169 = !DILocation(line: 34, column: 12, scope: !153)
!170 = !DILocation(line: 34, column: 5, scope: !153)
!171 = !DILocation(line: 35, column: 1, scope: !153)
