; ModuleID = './orzhttpd.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.SERVER_t = type { i64, i32, i32, [65 x i8], i8*, %struct.CONFIG_t, i32 (%struct.conn*)*, void (i32, i8*, ...)*, %struct._IO_FILE*, %struct._IO_FILE* }
%struct.CONFIG_t = type { i16, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32 }
%struct.conn = type { %struct.STATIC_BUFFER_t, %struct.STATIC_BUFFER_t, i32, i32, %struct.REQUEST_t, %struct.RESPONSE_t, %struct.DIR_t, %struct.sockaddr_in, %struct.in_addr, %struct.event, %struct.event, i32 }
%struct.STATIC_BUFFER_t = type { [4096 x i8], i32 }
%struct.REQUEST_t = type { i32, %struct.URI_t, i32, i8*, i8*, i8*, i8*, %struct.HTTP_AUTH_t }
%struct.URI_t = type { i8*, i8*, i8*, i8*, i8* }
%struct.HTTP_AUTH_t = type { i8*, i8*, i8*, i8*, i8*, i8*, i8* }
%struct.RESPONSE_t = type { i64, i8*, %struct.anon }
%struct.anon = type { i32, i8*, i64, %struct.stat* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.DIR_t = type { i8* }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%struct.event = type { %struct.event_callback, %union.anon.2, i32, %struct.event_base*, %union.anon.4, i16, i16, %struct.timespec }

!16 = !DIEnumerator(name: "HTTP_STATE_FINISH", value: 7, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 118, baseType: !7, size: 32, elements: !18)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26}
!19 = !DIEnumerator(name: "HTTP_METHOD_CONNECT", value: 0, isUnsigned: true)
!20 = !DIEnumerator(name: "HTTP_METHOD_DELETE", value: 1, isUnsigned: true)
!21 = !DIEnumerator(name: "HTTP_METHOD_GET", value: 2, isUnsigned: true)
!22 = !DIEnumerator(name: "HTTP_METHOD_HEAD", value: 3, isUnsigned: true)
!23 = !DIEnumerator(name: "HTTP_METHOD_OPTIONS", value: 4, isUnsigned: true)
!24 = !DIEnumerator(name: "HTTP_METHOD_POST", value: 5, isUnsigned: true)
!25 = !DIEnumerator(name: "HTTP_METHOD_PUT", value: 6, isUnsigned: true)
!26 = !DIEnumerator(name: "HTTP_METHOD_TRACE", value: 7, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 114, baseType: !7, size: 32, elements: !28)
!28 = !{!29, !30}
!29 = !DIEnumerator(name: "HTTP_VERSION_1_0", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "HTTP_VERSION_1_1", value: 1, isUnsigned: true)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 129, baseType: !7, size: 32, elements: !32)
!32 = !{!33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73}
!33 = !DIEnumerator(name: "HTTP_STATUS_100", value: 100, isUnsigned: true)
!34 = !DIEnumerator(name: "HTTP_STATUS_101", value: 101, isUnsigned: true)
!35 = !DIEnumerator(name: "HTTP_STATUS_200", value: 200, isUnsigned: true)
!36 = !DIEnumerator(name: "HTTP_STATUS_201", value: 201, isUnsigned: true)
!37 = !DIEnumerator(name: "HTTP_STATUS_202", value: 202, isUnsigned: true)
!38 = !DIEnumerator(name: "HTTP_STATUS_203", value: 203, isUnsigned: true)
!39 = !DIEnumerator(name: "HTTP_STATUS_204", value: 204, isUnsigned: true)
!40 = !DIEnumerator(name: "HTTP_STATUS_205", value: 205, isUnsigned: true)
!41 = !DIEnumerator(name: "HTTP_STATUS_206", value: 206, isUnsigned: true)
!42 = !DIEnumerator(name: "HTTP_STATUS_300", value: 300, isUnsigned: true)
!43 = !DIEnumerator(name: "HTTP_STATUS_301", value: 301, isUnsigned: true)
!44 = !DIEnumerator(name: "HTTP_STATUS_302", value: 302, isUnsigned: true)
!45 = !DIEnumerator(name: "HTTP_STATUS_303", value: 303, isUnsigned: true)
!46 = !DIEnumerator(name: "HTTP_STATUS_304", value: 304, isUnsigned: true)
!47 = !DIEnumerator(name: "HTTP_STATUS_305", value: 305, isUnsigned: true)
!48 = !DIEnumerator(name: "HTTP_STATUS_306", value: 306, isUnsigned: true)
!49 = !DIEnumerator(name: "HTTP_STATUS_307", value: 307, isUnsigned: true)
!50 = !DIEnumerator(name: "HTTP_STATUS_400", value: 400, isUnsigned: true)
!51 = !DIEnumerator(name: "HTTP_STATUS_401", value: 401, isUnsigned: true)
!52 = !DIEnumerator(name: "HTTP_STATUS_402", value: 402, isUnsigned: true)
!53 = !DIEnumerator(name: "HTTP_STATUS_403", value: 403, isUnsigned: true)
!54 = !DIEnumerator(name: "HTTP_STATUS_404", value: 404, isUnsigned: true)
!55 = !DIEnumerator(name: "HTTP_STATUS_405", value: 405, isUnsigned: true)
!56 = !DIEnumerator(name: "HTTP_STATUS_406", value: 406, isUnsigned: true)
!57 = !DIEnumerator(name: "HTTP_STATUS_407", value: 407, isUnsigned: true)
!58 = !DIEnumerator(name: "HTTP_STATUS_408", value: 408, isUnsigned: true)
!59 = !DIEnumerator(name: "HTTP_STATUS_409", value: 409, isUnsigned: true)
!60 = !DIEnumerator(name: "HTTP_STATUS_410", value: 410, isUnsigned: true)
!61 = !DIEnumerator(name: "HTTP_STATUS_411", value: 411, isUnsigned: true)
!62 = !DIEnumerator(name: "HTTP_STATUS_412", value: 412, isUnsigned: true)
!63 = !DIEnumerator(name: "HTTP_STATUS_413", value: 413, isUnsigned: true)
!64 = !DIEnumerator(name: "HTTP_STATUS_414", value: 414, isUnsigned: true)
!65 = !DIEnumerator(name: "HTTP_STATUS_415", value: 415, isUnsigned: true)
!66 = !DIEnumerator(name: "HTTP_STATUS_416", value: 416, isUnsigned: true)
!67 = !DIEnumerator(name: "HTTP_STATUS_417", value: 417, isUnsigned: true)
!68 = !DIEnumerator(name: "HTTP_STATUS_500", value: 500, isUnsigned: true)
!69 = !DIEnumerator(name: "HTTP_STATUS_501", value: 501, isUnsigned: true)
!70 = !DIEnumerator(name: "HTTP_STATUS_502", value: 502, isUnsigned: true)
!71 = !DIEnumerator(name: "HTTP_STATUS_503", value: 503, isUnsigned: true)
!72 = !DIEnumerator(name: "HTTP_STATUS_504", value: 504, isUnsigned: true)
!73 = !DIEnumerator(name: "HTTP_STATUS_505", value: 505, isUnsigned: true)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 184, baseType: !7, size: 32, elements: !75)
!75 = !{!76, !77}
!76 = !DIEnumerator(name: "ACCESS_LOG", value: 0, isUnsigned: true)
!77 = !DIEnumerator(name: "ERROR_LOG", value: 1, isUnsigned: true)
!78 = !{!7, !79, !82, !83}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_t", file: !6, line: 308, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 292, size: 1792, elements: !86)
!86 = !{!87, !93, !97, !98, !102, !105, !125, !351, !356, !409}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "now", scope: !85, file: !6, line: 293, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !89, line: 7, baseType: !90)
!89 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !91, line: 160, baseType: !92)
!91 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!92 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "salen", scope: !85, file: !6, line: 294, baseType: !94, size: 32, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !95, line: 33, baseType: !96)
!95 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "")
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !91, line: 209, baseType: !7)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "proc_num", scope: !85, file: !6, line: 295, baseType: !7, size: 32, offset: 96)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "sysname", scope: !85, file: !6, line: 297, baseType: !99, size: 520, offset: 128)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 520, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 65, lowerBound: 0)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "configfile", scope: !85, file: !6, line: 299, baseType: !103, size: 64, offset: 704)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !85, file: !6, line: 300, baseType: !106, size: 768, offset: 768)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONFIG_t", file: !6, line: 290, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 277, size: 768, elements: !108)
!108 = !{!109, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !107, file: !6, line: 278, baseType: !110, size: 16)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !111, line: 25, baseType: !112)
!111 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !91, line: 40, baseType: !113)
!113 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !107, file: !6, line: 279, baseType: !103, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !107, file: !6, line: 280, baseType: !103, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "basedir", scope: !107, file: !6, line: 281, baseType: !103, size: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "vhostbase", scope: !107, file: !6, line: 282, baseType: !103, size: 64, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "errmsgpath", scope: !107, file: !6, line: 283, baseType: !103, size: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "indexfile", scope: !107, file: !6, line: 284, baseType: !103, size: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "userdir", scope: !107, file: !6, line: 285, baseType: !103, size: 64, offset: 448)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "accesslog", scope: !107, file: !6, line: 286, baseType: !103, size: 64, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "errorlog", scope: !107, file: !6, line: 287, baseType: !103, size: 64, offset: 576)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "passfile", scope: !107, file: !6, line: 288, baseType: !103, size: 64, offset: 640)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !107, file: !6, line: 289, baseType: !7, size: 32, offset: 704)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !85, file: !6, line: 303, baseType: !126, size: 64, offset: 1536)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!129, !130}
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "HTTP_STATE_t", file: !6, line: 112, baseType: !5)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONN_t", file: !6, line: 275, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn", file: !6, line: 246, size: 69568, elements: !133)
!133 = !{!134, !144, !145, !146, !147, !179, !234, !239, !260, !265, !349, !350}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !132, file: !6, line: 247, baseType: !135, size: 32800)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "STATIC_BUFFER_t", file: !6, line: 191, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 188, size: 32800, elements: !137)
!137 = !{!138, !142}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !136, file: !6, line: 189, baseType: !139, size: 32768)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 32768, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 4096, lowerBound: 0)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !136, file: !6, line: 190, baseType: !143, size: 32, offset: 32768)
!143 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !132, file: !6, line: 248, baseType: !135, size: 32800, offset: 32800)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !132, file: !6, line: 250, baseType: !143, size: 32, offset: 65600)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !132, file: !6, line: 251, baseType: !129, size: 32, offset: 65632)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !132, file: !6, line: 253, baseType: !148, size: 1152, offset: 65664)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "REQUEST_t", file: !6, line: 233, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 221, size: 1152, elements: !150)
!150 = !{!151, !153, !162, !164, !165, !166, !167, !168}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !149, file: !6, line: 222, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "HTTP_METHOD_t", file: !6, line: 127, baseType: !17)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !149, file: !6, line: 223, baseType: !154, size: 320, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "URI_t", file: !6, line: 205, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 199, size: 320, elements: !156)
!156 = !{!157, !158, !159, !160, !161}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "scheme", scope: !155, file: !6, line: 200, baseType: !103, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !155, file: !6, line: 201, baseType: !103, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !155, file: !6, line: 202, baseType: !103, size: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "path_raw", scope: !155, file: !6, line: 203, baseType: !103, size: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !155, file: !6, line: 204, baseType: !103, size: 64, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !149, file: !6, line: 224, baseType: !163, size: 32, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "HTTP_VERSION_t", file: !6, line: 116, baseType: !27)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !149, file: !6, line: 226, baseType: !80, size: 64, offset: 448)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !149, file: !6, line: 228, baseType: !103, size: 64, offset: 512)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "if_modified_since", scope: !149, file: !6, line: 229, baseType: !103, size: 64, offset: 576)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "authorization", scope: !149, file: !6, line: 231, baseType: !103, size: 64, offset: 640)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !149, file: !6, line: 232, baseType: !169, size: 448, offset: 704)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "HTTP_AUTH_t", file: !6, line: 219, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 211, size: 448, elements: !171)
!171 = !{!172, !173, !174, !175, !176, !177, !178}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !170, file: !6, line: 212, baseType: !103, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !170, file: !6, line: 213, baseType: !103, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !170, file: !6, line: 214, baseType: !103, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !170, file: !6, line: 215, baseType: !103, size: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "cnonce", scope: !170, file: !6, line: 216, baseType: !103, size: 64, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "qop", scope: !170, file: !6, line: 217, baseType: !103, size: 64, offset: 320)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !170, file: !6, line: 218, baseType: !103, size: 64, offset: 384)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !132, file: !6, line: 254, baseType: !180, size: 384, offset: 66816)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESPONSE_t", file: !6, line: 244, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 235, size: 384, elements: !182)
!182 = !{!183, !187, !188}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "content_length", scope: !181, file: !6, line: 236, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !185, line: 46, baseType: !186)
!185 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!186 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !181, file: !6, line: 237, baseType: !103, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !181, file: !6, line: 243, baseType: !189, size: 256, offset: 128)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !181, file: !6, line: 238, size: 256, elements: !190)
!190 = !{!191, !192, !193, !197}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !189, file: !6, line: 239, baseType: !143, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !189, file: !6, line: 240, baseType: !80, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !189, file: !6, line: 241, baseType: !194, size: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !195, line: 63, baseType: !196)
!195 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !91, line: 152, baseType: !92)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !189, file: !6, line: 242, baseType: !198, size: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !200, line: 46, size: 1152, elements: !201)
!200 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!201 = !{!202, !204, !206, !208, !210, !212, !214, !215, !216, !217, !219, !221, !228, !229, !230}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !199, file: !200, line: 48, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !91, line: 145, baseType: !186)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !199, file: !200, line: 53, baseType: !205, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !91, line: 148, baseType: !186)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !199, file: !200, line: 61, baseType: !207, size: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !91, line: 151, baseType: !186)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !199, file: !200, line: 62, baseType: !209, size: 32, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !91, line: 150, baseType: !7)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !199, file: !200, line: 64, baseType: !211, size: 32, offset: 224)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !91, line: 146, baseType: !7)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !199, file: !200, line: 65, baseType: !213, size: 32, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !91, line: 147, baseType: !7)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !199, file: !200, line: 67, baseType: !143, size: 32, offset: 288)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !199, file: !200, line: 69, baseType: !203, size: 64, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !199, file: !200, line: 74, baseType: !196, size: 64, offset: 384)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !199, file: !200, line: 78, baseType: !218, size: 64, offset: 448)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !91, line: 174, baseType: !92)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !199, file: !200, line: 80, baseType: !220, size: 64, offset: 512)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !91, line: 179, baseType: !92)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !199, file: !200, line: 91, baseType: !222, size: 128, offset: 576)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !223, line: 10, size: 128, elements: !224)
!223 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!224 = !{!225, !226}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !222, file: !223, line: 12, baseType: !90, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !222, file: !223, line: 16, baseType: !227, size: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !91, line: 196, baseType: !92)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !199, file: !200, line: 92, baseType: !222, size: 128, offset: 704)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !199, file: !200, line: 93, baseType: !222, size: 128, offset: 832)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !199, file: !200, line: 106, baseType: !231, size: 192, offset: 960)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, size: 192, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 3, lowerBound: 0)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "basedir", scope: !132, file: !6, line: 256, baseType: !235, size: 64, offset: 67200)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR_t", file: !6, line: 209, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 207, size: 64, elements: !237)
!237 = !{!238}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !236, file: !6, line: 208, baseType: !103, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "cin", scope: !132, file: !6, line: 261, baseType: !240, size: 128, offset: 67264)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !241, line: 238, size: 128, elements: !242)
!241 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "")
!242 = !{!243, !246, !248, !255}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !240, file: !241, line: 240, baseType: !244, size: 16)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !245, line: 28, baseType: !113)
!245 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "")
!246 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !240, file: !241, line: 241, baseType: !247, size: 16, offset: 16)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !241, line: 119, baseType: !110)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !240, file: !241, line: 242, baseType: !249, size: 32, offset: 32)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !241, line: 31, size: 32, elements: !250)
!250 = !{!251}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !249, file: !241, line: 33, baseType: !252, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !241, line: 30, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !111, line: 26, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !91, line: 42, baseType: !7)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !240, file: !241, line: 245, baseType: !256, size: 64, offset: 64)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 64, elements: !258)
!257 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!258 = !{!259}
!259 = !DISubrange(count: 8, lowerBound: 0)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !132, file: !6, line: 266, baseType: !261, size: 32, offset: 67392)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !132, file: !6, line: 264, size: 32, elements: !262)
!262 = !{!263}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !261, file: !6, line: 265, baseType: !264, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "HTTP_STATUS_t", file: !6, line: 182, baseType: !31)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ev_read", scope: !132, file: !6, line: 269, baseType: !266, size: 1024, offset: 67456)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event", file: !267, line: 123, size: 1024, elements: !268)
!267 = !DIFile(filename: "/usr/include/event2/event_struct.h", directory: "")
!268 = !{!269, !303, !313, !314, !317, !346, !347, !348}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ev_evcallback", scope: !266, file: !267, line: 124, baseType: !270, size: 320)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event_callback", file: !267, line: 107, size: 320, elements: !271)
!271 = !{!272, !279, !281, !284, !285, !302}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_active_next", scope: !270, file: !267, line: 108, baseType: !273, size: 128)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !270, file: !267, line: 108, size: 128, elements: !274)
!274 = !{!275, !277}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !273, file: !267, line: 108, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !273, file: !267, line: 108, baseType: !278, size: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_flags", scope: !270, file: !267, line: 109, baseType: !280, size: 16, offset: 128)
!280 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_pri", scope: !270, file: !267, line: 110, baseType: !282, size: 8, offset: 144)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !111, line: 24, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !91, line: 38, baseType: !257)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_closure", scope: !270, file: !267, line: 111, baseType: !282, size: 8, offset: 152)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cb_union", scope: !270, file: !267, line: 118, baseType: !286, size: 64, offset: 192)
!286 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !270, file: !267, line: 113, size: 64, elements: !287)
!287 = !{!288, !292, !296, !301}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_callback", scope: !286, file: !267, line: 114, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !143, !280, !82}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_selfcb", scope: !286, file: !267, line: 115, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !276, !82}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_evfinalize", scope: !286, file: !267, line: 116, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !300, !82}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cbfinalize", scope: !286, file: !267, line: 117, baseType: !293, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_arg", scope: !270, file: !267, line: 119, baseType: !82, size: 64, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout_pos", scope: !266, file: !267, line: 130, baseType: !304, size: 128, offset: 320)
!304 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !266, file: !267, line: 127, size: 128, elements: !305)
!305 = !{!306, !312}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ev_next_with_common_timeout", scope: !304, file: !267, line: 128, baseType: !307, size: 128)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !304, file: !267, line: 128, size: 128, elements: !308)
!308 = !{!309, !310}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !307, file: !267, line: 128, baseType: !300, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !307, file: !267, line: 128, baseType: !311, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "min_heap_idx", scope: !304, file: !267, line: 129, baseType: !143, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ev_fd", scope: !266, file: !267, line: 131, baseType: !143, size: 32, offset: 448)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ev_base", scope: !266, file: !267, line: 133, baseType: !315, size: 64, offset: 512)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "event_base", file: !267, line: 122, flags: DIFlagFwdDecl)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ev_", scope: !266, file: !267, line: 149, baseType: !318, size: 256, offset: 576)
!318 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !266, file: !267, line: 135, size: 256, elements: !319)
!319 = !{!320, !335}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io", scope: !318, file: !267, line: 140, baseType: !321, size: 256)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !318, file: !267, line: 137, size: 256, elements: !322)
!322 = !{!323, !328}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io_next", scope: !321, file: !267, line: 138, baseType: !324, size: 128)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !321, file: !267, line: 138, size: 128, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !324, file: !267, line: 138, baseType: !300, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !324, file: !267, line: 138, baseType: !311, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !321, file: !267, line: 139, baseType: !329, size: 128, offset: 128)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !330, line: 8, size: 128, elements: !331)
!330 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "")
!331 = !{!332, !333}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !329, file: !330, line: 10, baseType: !90, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !329, file: !330, line: 11, baseType: !334, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !91, line: 162, baseType: !92)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal", scope: !318, file: !267, line: 148, baseType: !336, size: 256)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !318, file: !267, line: 143, size: 256, elements: !337)
!337 = !{!338, !343, !344}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal_next", scope: !336, file: !267, line: 144, baseType: !339, size: 128)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !336, file: !267, line: 144, size: 128, elements: !340)
!340 = !{!341, !342}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !339, file: !267, line: 144, baseType: !300, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !339, file: !267, line: 144, baseType: !311, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ev_ncalls", scope: !336, file: !267, line: 145, baseType: !280, size: 16, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ev_pncalls", scope: !336, file: !267, line: 147, baseType: !345, size: 64, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ev_events", scope: !266, file: !267, line: 151, baseType: !280, size: 16, offset: 832)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ev_res", scope: !266, file: !267, line: 152, baseType: !280, size: 16, offset: 848)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !266, file: !267, line: 153, baseType: !329, size: 128, offset: 896)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ev_write", scope: !132, file: !6, line: 270, baseType: !266, size: 1024, offset: 68480)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !132, file: !6, line: 273, baseType: !143, size: 32, offset: 69504)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !85, file: !6, line: 305, baseType: !352, size: 64, offset: 1600)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !355, !103, null}
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "LOG_TYPE_t", file: !6, line: 186, baseType: !74)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "access_log", scope: !85, file: !6, line: 306, baseType: !357, size: 64, offset: 1664)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !359, line: 7, baseType: !360)
!359 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !361, line: 49, size: 1728, elements: !362)
!361 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!362 = !{!363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !378, !380, !381, !382, !383, !384, !386, !390, !393, !395, !398, !401, !402, !403, !404, !405}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !360, file: !361, line: 51, baseType: !143, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !360, file: !361, line: 54, baseType: !80, size: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !360, file: !361, line: 55, baseType: !80, size: 64, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !360, file: !361, line: 56, baseType: !80, size: 64, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !360, file: !361, line: 57, baseType: !80, size: 64, offset: 256)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !360, file: !361, line: 58, baseType: !80, size: 64, offset: 320)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !360, file: !361, line: 59, baseType: !80, size: 64, offset: 384)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !360, file: !361, line: 60, baseType: !80, size: 64, offset: 448)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !360, file: !361, line: 61, baseType: !80, size: 64, offset: 512)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !360, file: !361, line: 64, baseType: !80, size: 64, offset: 576)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !360, file: !361, line: 65, baseType: !80, size: 64, offset: 640)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !360, file: !361, line: 66, baseType: !80, size: 64, offset: 704)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !360, file: !361, line: 68, baseType: !376, size: 64, offset: 768)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !361, line: 36, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !360, file: !361, line: 70, baseType: !379, size: 64, offset: 832)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !360, file: !361, line: 72, baseType: !143, size: 32, offset: 896)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !360, file: !361, line: 73, baseType: !143, size: 32, offset: 928)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !360, file: !361, line: 74, baseType: !196, size: 64, offset: 960)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !360, file: !361, line: 77, baseType: !113, size: 16, offset: 1024)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !360, file: !361, line: 78, baseType: !385, size: 8, offset: 1040)
!385 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !360, file: !361, line: 79, baseType: !387, size: 8, offset: 1048)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 8, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 1, lowerBound: 0)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !360, file: !361, line: 81, baseType: !391, size: 64, offset: 1088)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !361, line: 43, baseType: null)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !360, file: !361, line: 89, baseType: !394, size: 64, offset: 1152)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !91, line: 153, baseType: !92)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !360, file: !361, line: 91, baseType: !396, size: 64, offset: 1216)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !361, line: 37, flags: DIFlagFwdDecl)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !360, file: !361, line: 92, baseType: !399, size: 64, offset: 1280)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !361, line: 38, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !360, file: !361, line: 93, baseType: !379, size: 64, offset: 1344)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !360, file: !361, line: 94, baseType: !82, size: 64, offset: 1408)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !360, file: !361, line: 95, baseType: !184, size: 64, offset: 1472)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !360, file: !361, line: 96, baseType: !143, size: 32, offset: 1536)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !360, file: !361, line: 98, baseType: !406, size: 160, offset: 1568)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 160, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 20, lowerBound: 0)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "error_log", scope: !85, file: !6, line: 307, baseType: !357, size: 64, offset: 1728)
!410 = !{!0}
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "method_tab", scope: !413, file: !414, line: 19, type: !418, isLocal: true, isDefinition: true)
!413 = distinct !DICompileUnit(language: DW_LANG_C99, file: !414, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !415, retainedTypes: !416, globals: !417, splitDebugInlining: false, nameTableKind: None)
!414 = !DIFile(filename: "method.c", directory: "/home/salman/DPP/data/orzhttpd")
!415 = !{!5, !17, !27, !31}
!416 = !{!82}
!417 = !{!411}
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 1024, elements: !258)
!419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "HANDLER_t", file: !6, line: 313, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 310, size: 128, elements: !422)
!422 = !{!423, !424}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !421, file: !6, line: 311, baseType: !103, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !421, file: !6, line: 312, baseType: !425, size: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !428, !103}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONN_t", file: !6, line: 275, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn", file: !6, line: 246, size: 69568, elements: !431)
!431 = !{!432, !438, !439, !440, !441, !471, !506, !511, !521, !525, !597, !598}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !430, file: !6, line: 247, baseType: !433, size: 32800)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "STATIC_BUFFER_t", file: !6, line: 191, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 188, size: 32800, elements: !435)
!435 = !{!436, !437}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !434, file: !6, line: 189, baseType: !139, size: 32768)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !434, file: !6, line: 190, baseType: !143, size: 32, offset: 32768)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !430, file: !6, line: 248, baseType: !433, size: 32800, offset: 32800)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !430, file: !6, line: 250, baseType: !143, size: 32, offset: 65600)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !430, file: !6, line: 251, baseType: !129, size: 32, offset: 65632)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !430, file: !6, line: 253, baseType: !442, size: 1152, offset: 65664)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "REQUEST_t", file: !6, line: 233, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 221, size: 1152, elements: !444)
!444 = !{!445, !446, !455, !456, !457, !458, !459, !460}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !443, file: !6, line: 222, baseType: !152, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !443, file: !6, line: 223, baseType: !447, size: 320, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "URI_t", file: !6, line: 205, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 199, size: 320, elements: !449)
!449 = !{!450, !451, !452, !453, !454}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "scheme", scope: !448, file: !6, line: 200, baseType: !103, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !448, file: !6, line: 201, baseType: !103, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !448, file: !6, line: 202, baseType: !103, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "path_raw", scope: !448, file: !6, line: 203, baseType: !103, size: 64, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !448, file: !6, line: 204, baseType: !103, size: 64, offset: 256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !443, file: !6, line: 224, baseType: !163, size: 32, offset: 384)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !443, file: !6, line: 226, baseType: !80, size: 64, offset: 448)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !443, file: !6, line: 228, baseType: !103, size: 64, offset: 512)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "if_modified_since", scope: !443, file: !6, line: 229, baseType: !103, size: 64, offset: 576)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "authorization", scope: !443, file: !6, line: 231, baseType: !103, size: 64, offset: 640)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !443, file: !6, line: 232, baseType: !461, size: 448, offset: 704)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "HTTP_AUTH_t", file: !6, line: 219, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 211, size: 448, elements: !463)
!463 = !{!464, !465, !466, !467, !468, !469, !470}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !462, file: !6, line: 212, baseType: !103, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !462, file: !6, line: 213, baseType: !103, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !462, file: !6, line: 214, baseType: !103, size: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !462, file: !6, line: 215, baseType: !103, size: 64, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "cnonce", scope: !462, file: !6, line: 216, baseType: !103, size: 64, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "qop", scope: !462, file: !6, line: 217, baseType: !103, size: 64, offset: 320)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !462, file: !6, line: 218, baseType: !103, size: 64, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !430, file: !6, line: 254, baseType: !472, size: 384, offset: 66816)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESPONSE_t", file: !6, line: 244, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 235, size: 384, elements: !474)
!474 = !{!475, !476, !477}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "content_length", scope: !473, file: !6, line: 236, baseType: !184, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !473, file: !6, line: 237, baseType: !103, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !473, file: !6, line: 243, baseType: !478, size: 256, offset: 128)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !473, file: !6, line: 238, size: 256, elements: !479)
!479 = !{!480, !481, !482, !483}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !478, file: !6, line: 239, baseType: !143, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !478, file: !6, line: 240, baseType: !80, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !478, file: !6, line: 241, baseType: !194, size: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !478, file: !6, line: 242, baseType: !484, size: 64, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !200, line: 46, size: 1152, elements: !486)
!486 = !{!487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !503, !504, !505}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !485, file: !200, line: 48, baseType: !203, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !485, file: !200, line: 53, baseType: !205, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !485, file: !200, line: 61, baseType: !207, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !485, file: !200, line: 62, baseType: !209, size: 32, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !485, file: !200, line: 64, baseType: !211, size: 32, offset: 224)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !485, file: !200, line: 65, baseType: !213, size: 32, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !485, file: !200, line: 67, baseType: !143, size: 32, offset: 288)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !485, file: !200, line: 69, baseType: !203, size: 64, offset: 320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !485, file: !200, line: 74, baseType: !196, size: 64, offset: 384)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !485, file: !200, line: 78, baseType: !218, size: 64, offset: 448)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !485, file: !200, line: 80, baseType: !220, size: 64, offset: 512)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !485, file: !200, line: 91, baseType: !499, size: 128, offset: 576)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !223, line: 10, size: 128, elements: !500)
!500 = !{!501, !502}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !499, file: !223, line: 12, baseType: !90, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !499, file: !223, line: 16, baseType: !227, size: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !485, file: !200, line: 92, baseType: !499, size: 128, offset: 704)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !485, file: !200, line: 93, baseType: !499, size: 128, offset: 832)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !485, file: !200, line: 106, baseType: !231, size: 192, offset: 960)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "basedir", scope: !430, file: !6, line: 256, baseType: !507, size: 64, offset: 67200)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR_t", file: !6, line: 209, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 207, size: 64, elements: !509)
!509 = !{!510}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !508, file: !6, line: 208, baseType: !103, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "cin", scope: !430, file: !6, line: 261, baseType: !512, size: 128, offset: 67264)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !241, line: 238, size: 128, elements: !513)
!513 = !{!514, !515, !516, !520}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !512, file: !241, line: 240, baseType: !244, size: 16)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !512, file: !241, line: 241, baseType: !247, size: 16, offset: 16)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !512, file: !241, line: 242, baseType: !517, size: 32, offset: 32)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !241, line: 31, size: 32, elements: !518)
!518 = !{!519}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !517, file: !241, line: 33, baseType: !252, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !512, file: !241, line: 245, baseType: !256, size: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !430, file: !6, line: 266, baseType: !522, size: 32, offset: 67392)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !430, file: !6, line: 264, size: 32, elements: !523)
!523 = !{!524}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !522, file: !6, line: 265, baseType: !264, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ev_read", scope: !430, file: !6, line: 269, baseType: !526, size: 1024, offset: 67456)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event", file: !267, line: 123, size: 1024, elements: !527)
!527 = !{!528, !556, !566, !567, !568, !594, !595, !596}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ev_evcallback", scope: !526, file: !267, line: 124, baseType: !529, size: 320)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event_callback", file: !267, line: 107, size: 320, elements: !530)
!530 = !{!531, !538, !539, !540, !541, !555}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_active_next", scope: !529, file: !267, line: 108, baseType: !532, size: 128)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !529, file: !267, line: 108, size: 128, elements: !533)
!533 = !{!534, !536}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !532, file: !267, line: 108, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !532, file: !267, line: 108, baseType: !537, size: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_flags", scope: !529, file: !267, line: 109, baseType: !280, size: 16, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_pri", scope: !529, file: !267, line: 110, baseType: !282, size: 8, offset: 144)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_closure", scope: !529, file: !267, line: 111, baseType: !282, size: 8, offset: 152)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cb_union", scope: !529, file: !267, line: 118, baseType: !542, size: 64, offset: 192)
!542 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !529, file: !267, line: 113, size: 64, elements: !543)
!543 = !{!544, !545, !549, !554}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_callback", scope: !542, file: !267, line: 114, baseType: !289, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_selfcb", scope: !542, file: !267, line: 115, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{null, !535, !82}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_evfinalize", scope: !542, file: !267, line: 116, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{null, !553, !82}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cbfinalize", scope: !542, file: !267, line: 117, baseType: !546, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_arg", scope: !529, file: !267, line: 119, baseType: !82, size: 64, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout_pos", scope: !526, file: !267, line: 130, baseType: !557, size: 128, offset: 320)
!557 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !526, file: !267, line: 127, size: 128, elements: !558)
!558 = !{!559, !565}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ev_next_with_common_timeout", scope: !557, file: !267, line: 128, baseType: !560, size: 128)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !557, file: !267, line: 128, size: 128, elements: !561)
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !560, file: !267, line: 128, baseType: !553, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !560, file: !267, line: 128, baseType: !564, size: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "min_heap_idx", scope: !557, file: !267, line: 129, baseType: !143, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ev_fd", scope: !526, file: !267, line: 131, baseType: !143, size: 32, offset: 448)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ev_base", scope: !526, file: !267, line: 133, baseType: !315, size: 64, offset: 512)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ev_", scope: !526, file: !267, line: 149, baseType: !569, size: 256, offset: 576)
!569 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !526, file: !267, line: 135, size: 256, elements: !570)
!570 = !{!571, !584}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io", scope: !569, file: !267, line: 140, baseType: !572, size: 256)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !569, file: !267, line: 137, size: 256, elements: !573)
!573 = !{!574, !579}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io_next", scope: !572, file: !267, line: 138, baseType: !575, size: 128)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !572, file: !267, line: 138, size: 128, elements: !576)
!576 = !{!577, !578}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !575, file: !267, line: 138, baseType: !553, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !575, file: !267, line: 138, baseType: !564, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !572, file: !267, line: 139, baseType: !580, size: 128, offset: 128)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !330, line: 8, size: 128, elements: !581)
!581 = !{!582, !583}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !580, file: !330, line: 10, baseType: !90, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !580, file: !330, line: 11, baseType: !334, size: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal", scope: !569, file: !267, line: 148, baseType: !585, size: 256)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !569, file: !267, line: 143, size: 256, elements: !586)
!586 = !{!587, !592, !593}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal_next", scope: !585, file: !267, line: 144, baseType: !588, size: 128)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !585, file: !267, line: 144, size: 128, elements: !589)
!589 = !{!590, !591}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !588, file: !267, line: 144, baseType: !553, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !588, file: !267, line: 144, baseType: !564, size: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ev_ncalls", scope: !585, file: !267, line: 145, baseType: !280, size: 16, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ev_pncalls", scope: !585, file: !267, line: 147, baseType: !345, size: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ev_events", scope: !526, file: !267, line: 151, baseType: !280, size: 16, offset: 832)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ev_res", scope: !526, file: !267, line: 152, baseType: !280, size: 16, offset: 848)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !526, file: !267, line: 153, baseType: !580, size: 128, offset: 896)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ev_write", scope: !430, file: !6, line: 270, baseType: !526, size: 1024, offset: 68480)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !430, file: !6, line: 273, baseType: !143, size: 32, offset: 69504)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "header_tab", scope: !601, file: !602, line: 41, type: !604, isLocal: true, isDefinition: true)
!601 = distinct !DICompileUnit(language: DW_LANG_C99, file: !602, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !415, retainedTypes: !416, globals: !603, splitDebugInlining: false, nameTableKind: None)
!602 = !DIFile(filename: "header.c", directory: "/home/salman/DPP/data/orzhttpd")
!603 = !{!599}
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !605, size: 6016, elements: !785)
!605 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !606)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "HANDLER_t", file: !6, line: 313, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 310, size: 128, elements: !608)
!608 = !{!609, !610}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !607, file: !6, line: 311, baseType: !103, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !607, file: !6, line: 312, baseType: !611, size: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !614, !103}
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONN_t", file: !6, line: 275, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn", file: !6, line: 246, size: 69568, elements: !617)
!617 = !{!618, !624, !625, !626, !627, !657, !692, !697, !707, !711, !783, !784}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !616, file: !6, line: 247, baseType: !619, size: 32800)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "STATIC_BUFFER_t", file: !6, line: 191, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 188, size: 32800, elements: !621)
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !620, file: !6, line: 189, baseType: !139, size: 32768)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !620, file: !6, line: 190, baseType: !143, size: 32, offset: 32768)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !616, file: !6, line: 248, baseType: !619, size: 32800, offset: 32800)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !616, file: !6, line: 250, baseType: !143, size: 32, offset: 65600)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !616, file: !6, line: 251, baseType: !129, size: 32, offset: 65632)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !616, file: !6, line: 253, baseType: !628, size: 1152, offset: 65664)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "REQUEST_t", file: !6, line: 233, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 221, size: 1152, elements: !630)
!630 = !{!631, !632, !641, !642, !643, !644, !645, !646}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !629, file: !6, line: 222, baseType: !152, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !629, file: !6, line: 223, baseType: !633, size: 320, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "URI_t", file: !6, line: 205, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 199, size: 320, elements: !635)
!635 = !{!636, !637, !638, !639, !640}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "scheme", scope: !634, file: !6, line: 200, baseType: !103, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !634, file: !6, line: 201, baseType: !103, size: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !634, file: !6, line: 202, baseType: !103, size: 64, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "path_raw", scope: !634, file: !6, line: 203, baseType: !103, size: 64, offset: 192)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !634, file: !6, line: 204, baseType: !103, size: 64, offset: 256)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !629, file: !6, line: 224, baseType: !163, size: 32, offset: 384)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !629, file: !6, line: 226, baseType: !80, size: 64, offset: 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !629, file: !6, line: 228, baseType: !103, size: 64, offset: 512)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "if_modified_since", scope: !629, file: !6, line: 229, baseType: !103, size: 64, offset: 576)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "authorization", scope: !629, file: !6, line: 231, baseType: !103, size: 64, offset: 640)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !629, file: !6, line: 232, baseType: !647, size: 448, offset: 704)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "HTTP_AUTH_t", file: !6, line: 219, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 211, size: 448, elements: !649)
!649 = !{!650, !651, !652, !653, !654, !655, !656}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !648, file: !6, line: 212, baseType: !103, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !648, file: !6, line: 213, baseType: !103, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !648, file: !6, line: 214, baseType: !103, size: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !648, file: !6, line: 215, baseType: !103, size: 64, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "cnonce", scope: !648, file: !6, line: 216, baseType: !103, size: 64, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "qop", scope: !648, file: !6, line: 217, baseType: !103, size: 64, offset: 320)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !648, file: !6, line: 218, baseType: !103, size: 64, offset: 384)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !616, file: !6, line: 254, baseType: !658, size: 384, offset: 66816)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESPONSE_t", file: !6, line: 244, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 235, size: 384, elements: !660)
!660 = !{!661, !662, !663}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "content_length", scope: !659, file: !6, line: 236, baseType: !184, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !659, file: !6, line: 237, baseType: !103, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !659, file: !6, line: 243, baseType: !664, size: 256, offset: 128)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !659, file: !6, line: 238, size: 256, elements: !665)
!665 = !{!666, !667, !668, !669}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !664, file: !6, line: 239, baseType: !143, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !664, file: !6, line: 240, baseType: !80, size: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !664, file: !6, line: 241, baseType: !194, size: 64, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !664, file: !6, line: 242, baseType: !670, size: 64, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !200, line: 46, size: 1152, elements: !672)
!672 = !{!673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !689, !690, !691}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !671, file: !200, line: 48, baseType: !203, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !671, file: !200, line: 53, baseType: !205, size: 64, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !671, file: !200, line: 61, baseType: !207, size: 64, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !671, file: !200, line: 62, baseType: !209, size: 32, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !671, file: !200, line: 64, baseType: !211, size: 32, offset: 224)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !671, file: !200, line: 65, baseType: !213, size: 32, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !671, file: !200, line: 67, baseType: !143, size: 32, offset: 288)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !671, file: !200, line: 69, baseType: !203, size: 64, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !671, file: !200, line: 74, baseType: !196, size: 64, offset: 384)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !671, file: !200, line: 78, baseType: !218, size: 64, offset: 448)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !671, file: !200, line: 80, baseType: !220, size: 64, offset: 512)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !671, file: !200, line: 91, baseType: !685, size: 128, offset: 576)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !223, line: 10, size: 128, elements: !686)
!686 = !{!687, !688}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !685, file: !223, line: 12, baseType: !90, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !685, file: !223, line: 16, baseType: !227, size: 64, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !671, file: !200, line: 92, baseType: !685, size: 128, offset: 704)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !671, file: !200, line: 93, baseType: !685, size: 128, offset: 832)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !671, file: !200, line: 106, baseType: !231, size: 192, offset: 960)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "basedir", scope: !616, file: !6, line: 256, baseType: !693, size: 64, offset: 67200)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR_t", file: !6, line: 209, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 207, size: 64, elements: !695)
!695 = !{!696}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !694, file: !6, line: 208, baseType: !103, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "cin", scope: !616, file: !6, line: 261, baseType: !698, size: 128, offset: 67264)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !241, line: 238, size: 128, elements: !699)
!699 = !{!700, !701, !702, !706}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !698, file: !241, line: 240, baseType: !244, size: 16)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !698, file: !241, line: 241, baseType: !247, size: 16, offset: 16)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !698, file: !241, line: 242, baseType: !703, size: 32, offset: 32)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !241, line: 31, size: 32, elements: !704)
!704 = !{!705}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !703, file: !241, line: 33, baseType: !252, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !698, file: !241, line: 245, baseType: !256, size: 64, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !616, file: !6, line: 266, baseType: !708, size: 32, offset: 67392)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !616, file: !6, line: 264, size: 32, elements: !709)
!709 = !{!710}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !708, file: !6, line: 265, baseType: !264, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ev_read", scope: !616, file: !6, line: 269, baseType: !712, size: 1024, offset: 67456)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event", file: !267, line: 123, size: 1024, elements: !713)
!713 = !{!714, !742, !752, !753, !754, !780, !781, !782}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ev_evcallback", scope: !712, file: !267, line: 124, baseType: !715, size: 320)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event_callback", file: !267, line: 107, size: 320, elements: !716)
!716 = !{!717, !724, !725, !726, !727, !741}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_active_next", scope: !715, file: !267, line: 108, baseType: !718, size: 128)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !715, file: !267, line: 108, size: 128, elements: !719)
!719 = !{!720, !722}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !718, file: !267, line: 108, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !718, file: !267, line: 108, baseType: !723, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_flags", scope: !715, file: !267, line: 109, baseType: !280, size: 16, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_pri", scope: !715, file: !267, line: 110, baseType: !282, size: 8, offset: 144)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_closure", scope: !715, file: !267, line: 111, baseType: !282, size: 8, offset: 152)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cb_union", scope: !715, file: !267, line: 118, baseType: !728, size: 64, offset: 192)
!728 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !715, file: !267, line: 113, size: 64, elements: !729)
!729 = !{!730, !731, !735, !740}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_callback", scope: !728, file: !267, line: 114, baseType: !289, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_selfcb", scope: !728, file: !267, line: 115, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{null, !721, !82}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_evfinalize", scope: !728, file: !267, line: 116, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{null, !739, !82}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cbfinalize", scope: !728, file: !267, line: 117, baseType: !732, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_arg", scope: !715, file: !267, line: 119, baseType: !82, size: 64, offset: 256)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout_pos", scope: !712, file: !267, line: 130, baseType: !743, size: 128, offset: 320)
!743 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !712, file: !267, line: 127, size: 128, elements: !744)
!744 = !{!745, !751}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ev_next_with_common_timeout", scope: !743, file: !267, line: 128, baseType: !746, size: 128)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !743, file: !267, line: 128, size: 128, elements: !747)
!747 = !{!748, !749}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !746, file: !267, line: 128, baseType: !739, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !746, file: !267, line: 128, baseType: !750, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "min_heap_idx", scope: !743, file: !267, line: 129, baseType: !143, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ev_fd", scope: !712, file: !267, line: 131, baseType: !143, size: 32, offset: 448)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ev_base", scope: !712, file: !267, line: 133, baseType: !315, size: 64, offset: 512)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ev_", scope: !712, file: !267, line: 149, baseType: !755, size: 256, offset: 576)
!755 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !712, file: !267, line: 135, size: 256, elements: !756)
!756 = !{!757, !770}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io", scope: !755, file: !267, line: 140, baseType: !758, size: 256)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !755, file: !267, line: 137, size: 256, elements: !759)
!759 = !{!760, !765}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io_next", scope: !758, file: !267, line: 138, baseType: !761, size: 128)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !758, file: !267, line: 138, size: 128, elements: !762)
!762 = !{!763, !764}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !761, file: !267, line: 138, baseType: !739, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !761, file: !267, line: 138, baseType: !750, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !758, file: !267, line: 139, baseType: !766, size: 128, offset: 128)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !330, line: 8, size: 128, elements: !767)
!767 = !{!768, !769}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !766, file: !330, line: 10, baseType: !90, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !766, file: !330, line: 11, baseType: !334, size: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal", scope: !755, file: !267, line: 148, baseType: !771, size: 256)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !755, file: !267, line: 143, size: 256, elements: !772)
!772 = !{!773, !778, !779}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal_next", scope: !771, file: !267, line: 144, baseType: !774, size: 128)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !771, file: !267, line: 144, size: 128, elements: !775)
!775 = !{!776, !777}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !774, file: !267, line: 144, baseType: !739, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !774, file: !267, line: 144, baseType: !750, size: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ev_ncalls", scope: !771, file: !267, line: 145, baseType: !280, size: 16, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ev_pncalls", scope: !771, file: !267, line: 147, baseType: !345, size: 64, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ev_events", scope: !712, file: !267, line: 151, baseType: !280, size: 16, offset: 832)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ev_res", scope: !712, file: !267, line: 152, baseType: !280, size: 16, offset: 848)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !712, file: !267, line: 153, baseType: !766, size: 128, offset: 896)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ev_write", scope: !616, file: !6, line: 270, baseType: !712, size: 1024, offset: 68480)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !616, file: !6, line: 273, baseType: !143, size: 32, offset: 69504)
!785 = !{!786}
!786 = !DISubrange(count: 47, lowerBound: 0)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(name: "version_tab", scope: !789, file: !790, line: 5, type: !792, isLocal: true, isDefinition: true)
!789 = distinct !DICompileUnit(language: DW_LANG_C99, file: !790, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !415, globals: !791, splitDebugInlining: false, nameTableKind: None)
!790 = !DIFile(filename: "http_version.c", directory: "/home/salman/DPP/data/orzhttpd")
!791 = !{!787}
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 128, elements: !793)
!793 = !{!794}
!794 = !DISubrange(count: 2, lowerBound: 0)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "status_tab", scope: !797, file: !798, line: 74, type: !984, isLocal: true, isDefinition: true)
!797 = distinct !DICompileUnit(language: DW_LANG_C99, file: !798, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !415, retainedTypes: !799, globals: !983, splitDebugInlining: false, nameTableKind: None)
!798 = !DIFile(filename: "status.c", directory: "/home/salman/DPP/data/orzhttpd")
!799 = !{!82, !800}
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "STATUS_t", file: !798, line: 10, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "status", file: !798, line: 6, size: 192, elements: !804)
!804 = !{!805, !806, !807}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !803, file: !798, line: 7, baseType: !143, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !803, file: !798, line: 8, baseType: !103, size: 64, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !803, file: !798, line: 9, baseType: !808, size: 64, offset: 128)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{!129, !811, !982}
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONN_t", file: !6, line: 275, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn", file: !6, line: 246, size: 69568, elements: !814)
!814 = !{!815, !821, !822, !823, !824, !854, !889, !894, !904, !908, !980, !981}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !813, file: !6, line: 247, baseType: !816, size: 32800)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "STATIC_BUFFER_t", file: !6, line: 191, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 188, size: 32800, elements: !818)
!818 = !{!819, !820}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !817, file: !6, line: 189, baseType: !139, size: 32768)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !817, file: !6, line: 190, baseType: !143, size: 32, offset: 32768)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !813, file: !6, line: 248, baseType: !816, size: 32800, offset: 32800)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !813, file: !6, line: 250, baseType: !143, size: 32, offset: 65600)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !813, file: !6, line: 251, baseType: !129, size: 32, offset: 65632)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !813, file: !6, line: 253, baseType: !825, size: 1152, offset: 65664)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "REQUEST_t", file: !6, line: 233, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 221, size: 1152, elements: !827)
!827 = !{!828, !829, !838, !839, !840, !841, !842, !843}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !826, file: !6, line: 222, baseType: !152, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !826, file: !6, line: 223, baseType: !830, size: 320, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "URI_t", file: !6, line: 205, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 199, size: 320, elements: !832)
!832 = !{!833, !834, !835, !836, !837}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "scheme", scope: !831, file: !6, line: 200, baseType: !103, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !831, file: !6, line: 201, baseType: !103, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !831, file: !6, line: 202, baseType: !103, size: 64, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "path_raw", scope: !831, file: !6, line: 203, baseType: !103, size: 64, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !831, file: !6, line: 204, baseType: !103, size: 64, offset: 256)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !826, file: !6, line: 224, baseType: !163, size: 32, offset: 384)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !826, file: !6, line: 226, baseType: !80, size: 64, offset: 448)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !826, file: !6, line: 228, baseType: !103, size: 64, offset: 512)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "if_modified_since", scope: !826, file: !6, line: 229, baseType: !103, size: 64, offset: 576)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "authorization", scope: !826, file: !6, line: 231, baseType: !103, size: 64, offset: 640)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !826, file: !6, line: 232, baseType: !844, size: 448, offset: 704)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "HTTP_AUTH_t", file: !6, line: 219, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 211, size: 448, elements: !846)
!846 = !{!847, !848, !849, !850, !851, !852, !853}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !845, file: !6, line: 212, baseType: !103, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !845, file: !6, line: 213, baseType: !103, size: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !845, file: !6, line: 214, baseType: !103, size: 64, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !845, file: !6, line: 215, baseType: !103, size: 64, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "cnonce", scope: !845, file: !6, line: 216, baseType: !103, size: 64, offset: 256)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "qop", scope: !845, file: !6, line: 217, baseType: !103, size: 64, offset: 320)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !845, file: !6, line: 218, baseType: !103, size: 64, offset: 384)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !813, file: !6, line: 254, baseType: !855, size: 384, offset: 66816)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESPONSE_t", file: !6, line: 244, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 235, size: 384, elements: !857)
!857 = !{!858, !859, !860}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "content_length", scope: !856, file: !6, line: 236, baseType: !184, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !856, file: !6, line: 237, baseType: !103, size: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !856, file: !6, line: 243, baseType: !861, size: 256, offset: 128)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !856, file: !6, line: 238, size: 256, elements: !862)
!862 = !{!863, !864, !865, !866}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !861, file: !6, line: 239, baseType: !143, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !861, file: !6, line: 240, baseType: !80, size: 64, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !861, file: !6, line: 241, baseType: !194, size: 64, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !861, file: !6, line: 242, baseType: !867, size: 64, offset: 192)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !200, line: 46, size: 1152, elements: !869)
!869 = !{!870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !886, !887, !888}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !868, file: !200, line: 48, baseType: !203, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !868, file: !200, line: 53, baseType: !205, size: 64, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !868, file: !200, line: 61, baseType: !207, size: 64, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !868, file: !200, line: 62, baseType: !209, size: 32, offset: 192)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !868, file: !200, line: 64, baseType: !211, size: 32, offset: 224)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !868, file: !200, line: 65, baseType: !213, size: 32, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !868, file: !200, line: 67, baseType: !143, size: 32, offset: 288)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !868, file: !200, line: 69, baseType: !203, size: 64, offset: 320)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !868, file: !200, line: 74, baseType: !196, size: 64, offset: 384)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !868, file: !200, line: 78, baseType: !218, size: 64, offset: 448)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !868, file: !200, line: 80, baseType: !220, size: 64, offset: 512)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !868, file: !200, line: 91, baseType: !882, size: 128, offset: 576)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !223, line: 10, size: 128, elements: !883)
!883 = !{!884, !885}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !882, file: !223, line: 12, baseType: !90, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !882, file: !223, line: 16, baseType: !227, size: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !868, file: !200, line: 92, baseType: !882, size: 128, offset: 704)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !868, file: !200, line: 93, baseType: !882, size: 128, offset: 832)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !868, file: !200, line: 106, baseType: !231, size: 192, offset: 960)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "basedir", scope: !813, file: !6, line: 256, baseType: !890, size: 64, offset: 67200)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR_t", file: !6, line: 209, baseType: !891)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 207, size: 64, elements: !892)
!892 = !{!893}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !891, file: !6, line: 208, baseType: !103, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "cin", scope: !813, file: !6, line: 261, baseType: !895, size: 128, offset: 67264)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !241, line: 238, size: 128, elements: !896)
!896 = !{!897, !898, !899, !903}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !895, file: !241, line: 240, baseType: !244, size: 16)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !895, file: !241, line: 241, baseType: !247, size: 16, offset: 16)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !895, file: !241, line: 242, baseType: !900, size: 32, offset: 32)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !241, line: 31, size: 32, elements: !901)
!901 = !{!902}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !900, file: !241, line: 33, baseType: !252, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !895, file: !241, line: 245, baseType: !256, size: 64, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !813, file: !6, line: 266, baseType: !905, size: 32, offset: 67392)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !813, file: !6, line: 264, size: 32, elements: !906)
!906 = !{!907}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !905, file: !6, line: 265, baseType: !264, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "ev_read", scope: !813, file: !6, line: 269, baseType: !909, size: 1024, offset: 67456)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event", file: !267, line: 123, size: 1024, elements: !910)
!910 = !{!911, !939, !949, !950, !951, !977, !978, !979}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ev_evcallback", scope: !909, file: !267, line: 124, baseType: !912, size: 320)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event_callback", file: !267, line: 107, size: 320, elements: !913)
!913 = !{!914, !921, !922, !923, !924, !938}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_active_next", scope: !912, file: !267, line: 108, baseType: !915, size: 128)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !912, file: !267, line: 108, size: 128, elements: !916)
!916 = !{!917, !919}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !915, file: !267, line: 108, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !915, file: !267, line: 108, baseType: !920, size: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_flags", scope: !912, file: !267, line: 109, baseType: !280, size: 16, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_pri", scope: !912, file: !267, line: 110, baseType: !282, size: 8, offset: 144)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_closure", scope: !912, file: !267, line: 111, baseType: !282, size: 8, offset: 152)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cb_union", scope: !912, file: !267, line: 118, baseType: !925, size: 64, offset: 192)
!925 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !912, file: !267, line: 113, size: 64, elements: !926)
!926 = !{!927, !928, !932, !937}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_callback", scope: !925, file: !267, line: 114, baseType: !289, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_selfcb", scope: !925, file: !267, line: 115, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{null, !918, !82}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_evfinalize", scope: !925, file: !267, line: 116, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{null, !936, !82}
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cbfinalize", scope: !925, file: !267, line: 117, baseType: !929, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_arg", scope: !912, file: !267, line: 119, baseType: !82, size: 64, offset: 256)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout_pos", scope: !909, file: !267, line: 130, baseType: !940, size: 128, offset: 320)
!940 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !909, file: !267, line: 127, size: 128, elements: !941)
!941 = !{!942, !948}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "ev_next_with_common_timeout", scope: !940, file: !267, line: 128, baseType: !943, size: 128)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !940, file: !267, line: 128, size: 128, elements: !944)
!944 = !{!945, !946}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !943, file: !267, line: 128, baseType: !936, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !943, file: !267, line: 128, baseType: !947, size: 64, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "min_heap_idx", scope: !940, file: !267, line: 129, baseType: !143, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ev_fd", scope: !909, file: !267, line: 131, baseType: !143, size: 32, offset: 448)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "ev_base", scope: !909, file: !267, line: 133, baseType: !315, size: 64, offset: 512)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "ev_", scope: !909, file: !267, line: 149, baseType: !952, size: 256, offset: 576)
!952 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !909, file: !267, line: 135, size: 256, elements: !953)
!953 = !{!954, !967}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io", scope: !952, file: !267, line: 140, baseType: !955, size: 256)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !952, file: !267, line: 137, size: 256, elements: !956)
!956 = !{!957, !962}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io_next", scope: !955, file: !267, line: 138, baseType: !958, size: 128)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !955, file: !267, line: 138, size: 128, elements: !959)
!959 = !{!960, !961}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !958, file: !267, line: 138, baseType: !936, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !958, file: !267, line: 138, baseType: !947, size: 64, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !955, file: !267, line: 139, baseType: !963, size: 128, offset: 128)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !330, line: 8, size: 128, elements: !964)
!964 = !{!965, !966}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !963, file: !330, line: 10, baseType: !90, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !963, file: !330, line: 11, baseType: !334, size: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal", scope: !952, file: !267, line: 148, baseType: !968, size: 256)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !952, file: !267, line: 143, size: 256, elements: !969)
!969 = !{!970, !975, !976}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal_next", scope: !968, file: !267, line: 144, baseType: !971, size: 128)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !968, file: !267, line: 144, size: 128, elements: !972)
