; ModuleID = '/home/salman/DPP/data/sudo-1.8.3p1/src/sudo.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.signal_state = type { i32, %struct.sigaction }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, void ()* }
%union.anon = type { void (i32)* }
%struct.__sigset_t = type { [16 x i64] }
%struct.sigforward_list = type { %struct.sigforward*, %struct.sigforward* }
%struct.sigforward = type { %struct.sigforward*, %struct.sigforward*, i32 }
%struct.io_buffer = type { %struct.io_buffer*, i32, i32, i32, i32, i32 (i8*, i32)*, [16384 x i8] }
%struct.plugin_info_list = type { %struct.plugin_info*, %struct.plugin_info* }
%struct.plugin_info = type { %struct.plugin_info*, %struct.plugin_info*, i8*, i8* }
%struct.sudo_settings = type { i8*, i8* }
%struct.user_details = type { i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i32*, i32, i32, i32 }
%struct.plugin_container = type { %struct.plugin_container*, %struct.plugin_container*, i8*, i8*, %union.anon.9 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "signal_pipe", scope: !2, file: !42, line: 67, type: !169, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !18, globals: !39, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "exec.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/src")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !6, line: 24, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17}
!9 = !DIEnumerator(name: "SOCK_STREAM", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "SOCK_DGRAM", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "SOCK_RAW", value: 3, isUnsigned: true)
!12 = !DIEnumerator(name: "SOCK_RDM", value: 4, isUnsigned: true)
!13 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5, isUnsigned: true)
!14 = !DIEnumerator(name: "SOCK_DCCP", value: 6, isUnsigned: true)
!15 = !DIEnumerator(name: "SOCK_PACKET", value: 10, isUnsigned: true)
!16 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288, isUnsigned: true)
!17 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048, isUnsigned: true)
!18 = !{!19, !20, !22, !33, !29, !34, !35}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "fd_set", file: !24, line: 70, baseType: !25)
!24 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/select.h", directory: "")
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 59, size: 1024, elements: !26)
!26 = !{!27}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "fds_bits", scope: !25, file: !24, line: 64, baseType: !28, size: 1024)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 1024, elements: !31)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !24, line: 49, baseType: !30)
!30 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!31 = !{!32}
!32 = !DISubrange(count: 16, lowerBound: 0)
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !36, line: 97, baseType: !37)
!36 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !38, line: 154, baseType: !33)
!38 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!39 = !{!0, !40, !53}
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "sigfwd_list", scope: !2, file: !42, line: 75, type: !43, isLocal: true, isDefinition: true)
!42 = !DIFile(filename: "./exec.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/src")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigforward_list", file: !42, line: 74, size: 128, elements: !44)
!44 = !{!45, !52}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !43, file: !42, line: 74, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigforward", file: !42, line: 70, size: 192, elements: !48)
!48 = !{!49, !50, !51}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !47, file: !42, line: 71, baseType: !46, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !47, file: !42, line: 71, baseType: !46, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "signo", scope: !47, file: !42, line: 72, baseType: !33, size: 32, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !43, file: !42, line: 74, baseType: !46, size: 64, offset: 64)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "saved_signals", scope: !2, file: !42, line: 156, type: !55, isLocal: true, isDefinition: true)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 17920, elements: !167)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "signal_state", file: !42, line: 153, size: 1280, elements: !57)
!57 = !{!58, !59}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "signo", scope: !56, file: !42, line: 154, baseType: !33, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !56, file: !42, line: 155, baseType: !60, size: 1216, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigaction_t", file: !61, line: 162, baseType: !62)
!61 = !DIFile(filename: "../include/missing.h", directory: "/home/salman/DPP/data/sudo-1.8.3p1/src")
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !63, line: 27, size: 1216, elements: !64)
!63 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigaction.h", directory: "")
!64 = !{!65, !154, !162, !163}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !62, file: !63, line: 38, baseType: !66, size: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !62, file: !63, line: 31, size: 64, elements: !67)
!67 = !{!68, !74}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !66, file: !63, line: 34, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !70, line: 72, baseType: !71)
!70 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{null, !33}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !66, file: !63, line: 36, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{null, !33, !78, !19}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !80, line: 124, baseType: !81)
!80 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h", directory: "")
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !80, line: 36, size: 1024, elements: !82)
!82 = !{!83, !84, !85, !86, !87}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !81, file: !80, line: 38, baseType: !33, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !81, file: !80, line: 40, baseType: !33, size: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !81, file: !80, line: 42, baseType: !33, size: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !81, file: !80, line: 48, baseType: !33, size: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !81, file: !80, line: 123, baseType: !88, size: 896, offset: 128)
!88 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !81, file: !80, line: 51, size: 896, elements: !89)
!89 = !{!90, !94, !100, !112, !118, !127, !143, !148}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !88, file: !80, line: 53, baseType: !91, size: 896)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 896, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 28, lowerBound: 0)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !88, file: !80, line: 60, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !88, file: !80, line: 56, size: 64, elements: !96)
!96 = !{!97, !98}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !95, file: !80, line: 58, baseType: !37, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !95, file: !80, line: 59, baseType: !99, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !38, line: 146, baseType: !7)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !88, file: !80, line: 68, baseType: !101, size: 128)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !88, file: !80, line: 63, size: 128, elements: !102)
!102 = !{!103, !104, !105}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !101, file: !80, line: 65, baseType: !33, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !101, file: !80, line: 66, baseType: !33, size: 32, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !101, file: !80, line: 67, baseType: !106, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !107, line: 30, baseType: !108)
!107 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigval_t.h", directory: "")
!108 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !107, line: 24, size: 64, elements: !109)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !108, file: !107, line: 26, baseType: !33, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !108, file: !107, line: 27, baseType: !19, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !88, file: !80, line: 76, baseType: !113, size: 128)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !88, file: !80, line: 71, size: 128, elements: !114)
!114 = !{!115, !116, !117}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !113, file: !80, line: 73, baseType: !37, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !113, file: !80, line: 74, baseType: !99, size: 32, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !113, file: !80, line: 75, baseType: !106, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !88, file: !80, line: 86, baseType: !119, size: 256)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !88, file: !80, line: 79, size: 256, elements: !120)
!120 = !{!121, !122, !123, !124, !126}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !119, file: !80, line: 81, baseType: !37, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !119, file: !80, line: 82, baseType: !99, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !119, file: !80, line: 83, baseType: !33, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !119, file: !80, line: 84, baseType: !125, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !38, line: 156, baseType: !30)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !119, file: !80, line: 85, baseType: !125, size: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !88, file: !80, line: 105, baseType: !128, size: 256)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !88, file: !80, line: 89, size: 256, elements: !129)
!129 = !{!130, !131, !133}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !128, file: !80, line: 91, baseType: !19, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !128, file: !80, line: 93, baseType: !132, size: 16, offset: 64)
!132 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !128, file: !80, line: 104, baseType: !134, size: 128, offset: 128)
!134 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !80, line: 94, size: 128, elements: !135)
!135 = !{!136, !141}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !134, file: !80, line: 101, baseType: !137, size: 128)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !134, file: !80, line: 97, size: 128, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !137, file: !80, line: 99, baseType: !19, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !137, file: !80, line: 100, baseType: !19, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !134, file: !80, line: 103, baseType: !142, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !38, line: 42, baseType: !7)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !88, file: !80, line: 112, baseType: !144, size: 128)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !88, file: !80, line: 108, size: 128, elements: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !144, file: !80, line: 110, baseType: !30, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !144, file: !80, line: 111, baseType: !33, size: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !88, file: !80, line: 121, baseType: !149, size: 128)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !88, file: !80, line: 116, size: 128, elements: !150)
!150 = !{!151, !152, !153}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !149, file: !80, line: 118, baseType: !19, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !149, file: !80, line: 119, baseType: !33, size: 32, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !149, file: !80, line: 120, baseType: !7, size: 32, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !62, file: !63, line: 46, baseType: !155, size: 1024, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !156, line: 8, baseType: !157)
!156 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h", directory: "")
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !156, line: 5, size: 1024, elements: !158)
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !157, file: !156, line: 7, baseType: !160, size: 1024)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 1024, elements: !31)
!161 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !62, file: !63, line: 49, baseType: !33, size: 32, offset: 1088)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !62, file: !63, line: 52, baseType: !164, size: 64, offset: 1152)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{null}
!167 = !{!168}
!168 = !DISubrange(count: 14, lowerBound: 0)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 64, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 2, lowerBound: 0)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "io_fds", scope: !174, file: !187, line: 94, type: !233, isLocal: true, isDefinition: true)
!174 = distinct !DICompileUnit(language: DW_LANG_C99, file: !175, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !176, retainedTypes: !177, globals: !184, splitDebugInlining: false, nameTableKind: None)
!175 = !DIFile(filename: "exec_pty.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/src")
!176 = !{}
!177 = !{!19, !69, !33, !29, !178, !179}
!178 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "fd_set", file: !24, line: 70, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 59, size: 1024, elements: !182)
!182 = !{!183}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "fds_bits", scope: !181, file: !24, line: 64, baseType: !28, size: 1024)
!184 = !{!185, !191, !193, !195, !197, !199, !207, !172, !227, !229, !231}
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "slavename", scope: !174, file: !187, line: 92, type: !188, isLocal: true, isDefinition: true)
!187 = !DIFile(filename: "./exec_pty.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/src")
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 32768, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 4096, lowerBound: 0)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "foreground", scope: !174, file: !187, line: 93, type: !33, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "tty_initialized", scope: !174, file: !187, line: 96, type: !33, isLocal: true, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "ppgrp", scope: !174, file: !187, line: 98, type: !35, isLocal: true, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "child", scope: !174, file: !187, line: 98, type: !35, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "ttyblock", scope: !174, file: !187, line: 99, type: !201, isLocal: true, isDefinition: true)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !202, line: 7, baseType: !203)
!202 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/sigset_t.h", directory: "")
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !156, line: 8, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !156, line: 5, size: 1024, elements: !205)
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !204, file: !156, line: 7, baseType: !160, size: 1024)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "iobufs", scope: !174, file: !187, line: 100, type: !209, isLocal: true, isDefinition: true)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "io_buffer", file: !187, line: 82, size: 131328, elements: !211)
!211 = !{!212, !213, !214, !215, !216, !217, !223}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !210, file: !187, line: 83, baseType: !209, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !210, file: !187, line: 84, baseType: !33, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !210, file: !187, line: 85, baseType: !33, size: 32, offset: 96)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "rfd", scope: !210, file: !187, line: 86, baseType: !33, size: 32, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "wfd", scope: !210, file: !187, line: 87, baseType: !33, size: 32, offset: 160)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !210, file: !187, line: 88, baseType: !218, size: 64, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!33, !221, !7}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !210, file: !187, line: 89, baseType: !224, size: 131072, offset: 256)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 131072, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 16384, lowerBound: 0)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "ttymode", scope: !174, file: !187, line: 97, type: !33, isLocal: true, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "pipeline", scope: !174, file: !187, line: 95, type: !33, isLocal: true, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "child_pgrp", scope: !174, file: !187, line: 98, type: !35, isLocal: true, isDefinition: true)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 192, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 6, lowerBound: 0)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "noexec_path", scope: !238, file: !245, line: 56, type: !221, isLocal: false, isDefinition: true)
!238 = distinct !DICompileUnit(language: DW_LANG_C99, file: !239, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !176, retainedTypes: !240, globals: !241, splitDebugInlining: false, nameTableKind: None)
!239 = !DIFile(filename: "load_plugins.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/src")
!240 = !{!19}
!241 = !{!236, !242}
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "pil", scope: !244, file: !245, line: 69, type: !249, isLocal: true, isDefinition: true)
!244 = distinct !DISubprogram(name: "sudo_read_conf", scope: !245, file: !245, line: 64, type: !246, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !238, retainedNodes: !176)
!245 = !DIFile(filename: "./load_plugins.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/src")
!246 = !DISubroutineType(types: !247)
!247 = !{!248, !221}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "plugin_info_list", file: !250, line: 58, size: 128, elements: !251)
!250 = !DIFile(filename: "./sudo_plugin_int.h", directory: "/home/salman/DPP/data/sudo-1.8.3p1/src")
!251 = !{!252, !260}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !249, file: !250, line: 58, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "plugin_info", file: !250, line: 52, size: 256, elements: !255)
!255 = !{!256, !257, !258, !259}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !254, file: !250, line: 53, baseType: !253, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !254, file: !250, line: 54, baseType: !253, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !254, file: !250, line: 55, baseType: !221, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_name", scope: !254, file: !250, line: 56, baseType: !221, size: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !249, file: !250, line: 58, baseType: !253, size: 64, offset: 64)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "tgetpass_flags", scope: !263, file: !288, line: 56, type: !33, isLocal: false, isDefinition: true)
!263 = distinct !DICompileUnit(language: DW_LANG_C99, file: !264, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !265, retainedTypes: !281, globals: !285, splitDebugInlining: false, nameTableKind: None)
!264 = !DIFile(filename: "parse_args.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/src")
!265 = !{!266}
!266 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !267, line: 46, baseType: !7, size: 32, elements: !268)
!267 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!268 = !{!269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280}
!269 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!270 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!271 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!272 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!273 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!274 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!275 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!276 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!277 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!278 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!279 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!280 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!281 = !{!19, !282, !33, !34, !284, !20}
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !283, line: 46, baseType: !161)
!283 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!284 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!285 = !{!261, !286}
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "sudo_settings", scope: !263, file: !288, line: 70, type: !289, isLocal: true, isDefinition: true)
!288 = !DIFile(filename: "./parse_args.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/src")
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 2688, elements: !294)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sudo_settings", file: !288, line: 67, size: 128, elements: !291)
!291 = !{!292, !293}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !288, line: 68, baseType: !221, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !290, file: !288, line: 69, baseType: !221, size: 64, offset: 64)
!294 = !{!295}
!295 = !DISubrange(count: 21, lowerBound: 0)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "user_details", scope: !298, file: !554, line: 103, type: !698, isLocal: false, isDefinition: true)
!298 = distinct !DICompileUnit(language: DW_LANG_C99, file: !299, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !300, retainedTypes: !546, globals: !551, splitDebugInlining: false, nameTableKind: None)
!299 = !DIFile(filename: "sudo.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/src")
!300 = !{!301, !323, !328}
!301 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__rlimit_resource", file: !302, line: 31, baseType: !7, size: 32, elements: !303)
!302 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/resource.h", directory: "")
!303 = !{!304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322}
!304 = !DIEnumerator(name: "RLIMIT_CPU", value: 0, isUnsigned: true)
!305 = !DIEnumerator(name: "RLIMIT_FSIZE", value: 1, isUnsigned: true)
!306 = !DIEnumerator(name: "RLIMIT_DATA", value: 2, isUnsigned: true)
!307 = !DIEnumerator(name: "RLIMIT_STACK", value: 3, isUnsigned: true)
!308 = !DIEnumerator(name: "RLIMIT_CORE", value: 4, isUnsigned: true)
!309 = !DIEnumerator(name: "__RLIMIT_RSS", value: 5, isUnsigned: true)
!310 = !DIEnumerator(name: "RLIMIT_NOFILE", value: 7, isUnsigned: true)
!311 = !DIEnumerator(name: "__RLIMIT_OFILE", value: 7, isUnsigned: true)
!312 = !DIEnumerator(name: "RLIMIT_AS", value: 9, isUnsigned: true)
!313 = !DIEnumerator(name: "__RLIMIT_NPROC", value: 6, isUnsigned: true)
!314 = !DIEnumerator(name: "__RLIMIT_MEMLOCK", value: 8, isUnsigned: true)
!315 = !DIEnumerator(name: "__RLIMIT_LOCKS", value: 10, isUnsigned: true)
!316 = !DIEnumerator(name: "__RLIMIT_SIGPENDING", value: 11, isUnsigned: true)
!317 = !DIEnumerator(name: "__RLIMIT_MSGQUEUE", value: 12, isUnsigned: true)
!318 = !DIEnumerator(name: "__RLIMIT_NICE", value: 13, isUnsigned: true)
!319 = !DIEnumerator(name: "__RLIMIT_RTPRIO", value: 14, isUnsigned: true)
!320 = !DIEnumerator(name: "__RLIMIT_RTTIME", value: 15, isUnsigned: true)
!321 = !DIEnumerator(name: "__RLIMIT_NLIMITS", value: 16, isUnsigned: true)
!322 = !DIEnumerator(name: "__RLIM_NLIMITS", value: 16, isUnsigned: true)
!323 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__priority_which", file: !302, line: 187, baseType: !7, size: 32, elements: !324)
!324 = !{!325, !326, !327}
!325 = !DIEnumerator(name: "PRIO_PROCESS", value: 0, isUnsigned: true)
!326 = !DIEnumerator(name: "PRIO_PGRP", value: 1, isUnsigned: true)
!327 = !DIEnumerator(name: "PRIO_USER", value: 2, isUnsigned: true)
!328 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !329, line: 71, baseType: !7, size: 32, elements: !330)
!329 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/confname.h", directory: "")
!330 = !{!331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545}
!331 = !DIEnumerator(name: "_SC_ARG_MAX", value: 0, isUnsigned: true)
!332 = !DIEnumerator(name: "_SC_CHILD_MAX", value: 1, isUnsigned: true)
!333 = !DIEnumerator(name: "_SC_CLK_TCK", value: 2, isUnsigned: true)
!334 = !DIEnumerator(name: "_SC_NGROUPS_MAX", value: 3, isUnsigned: true)
!335 = !DIEnumerator(name: "_SC_OPEN_MAX", value: 4, isUnsigned: true)
!336 = !DIEnumerator(name: "_SC_STREAM_MAX", value: 5, isUnsigned: true)
!337 = !DIEnumerator(name: "_SC_TZNAME_MAX", value: 6, isUnsigned: true)
!338 = !DIEnumerator(name: "_SC_JOB_CONTROL", value: 7, isUnsigned: true)
!339 = !DIEnumerator(name: "_SC_SAVED_IDS", value: 8, isUnsigned: true)
!340 = !DIEnumerator(name: "_SC_REALTIME_SIGNALS", value: 9, isUnsigned: true)
!341 = !DIEnumerator(name: "_SC_PRIORITY_SCHEDULING", value: 10, isUnsigned: true)
!342 = !DIEnumerator(name: "_SC_TIMERS", value: 11, isUnsigned: true)
!343 = !DIEnumerator(name: "_SC_ASYNCHRONOUS_IO", value: 12, isUnsigned: true)
!344 = !DIEnumerator(name: "_SC_PRIORITIZED_IO", value: 13, isUnsigned: true)
!345 = !DIEnumerator(name: "_SC_SYNCHRONIZED_IO", value: 14, isUnsigned: true)
!346 = !DIEnumerator(name: "_SC_FSYNC", value: 15, isUnsigned: true)
!347 = !DIEnumerator(name: "_SC_MAPPED_FILES", value: 16, isUnsigned: true)
!348 = !DIEnumerator(name: "_SC_MEMLOCK", value: 17, isUnsigned: true)
!349 = !DIEnumerator(name: "_SC_MEMLOCK_RANGE", value: 18, isUnsigned: true)
!350 = !DIEnumerator(name: "_SC_MEMORY_PROTECTION", value: 19, isUnsigned: true)
!351 = !DIEnumerator(name: "_SC_MESSAGE_PASSING", value: 20, isUnsigned: true)
!352 = !DIEnumerator(name: "_SC_SEMAPHORES", value: 21, isUnsigned: true)
!353 = !DIEnumerator(name: "_SC_SHARED_MEMORY_OBJECTS", value: 22, isUnsigned: true)
!354 = !DIEnumerator(name: "_SC_AIO_LISTIO_MAX", value: 23, isUnsigned: true)
!355 = !DIEnumerator(name: "_SC_AIO_MAX", value: 24, isUnsigned: true)
!356 = !DIEnumerator(name: "_SC_AIO_PRIO_DELTA_MAX", value: 25, isUnsigned: true)
!357 = !DIEnumerator(name: "_SC_DELAYTIMER_MAX", value: 26, isUnsigned: true)
!358 = !DIEnumerator(name: "_SC_MQ_OPEN_MAX", value: 27, isUnsigned: true)
!359 = !DIEnumerator(name: "_SC_MQ_PRIO_MAX", value: 28, isUnsigned: true)
!360 = !DIEnumerator(name: "_SC_VERSION", value: 29, isUnsigned: true)
!361 = !DIEnumerator(name: "_SC_PAGESIZE", value: 30, isUnsigned: true)
!362 = !DIEnumerator(name: "_SC_RTSIG_MAX", value: 31, isUnsigned: true)
!363 = !DIEnumerator(name: "_SC_SEM_NSEMS_MAX", value: 32, isUnsigned: true)
!364 = !DIEnumerator(name: "_SC_SEM_VALUE_MAX", value: 33, isUnsigned: true)
!365 = !DIEnumerator(name: "_SC_SIGQUEUE_MAX", value: 34, isUnsigned: true)
!366 = !DIEnumerator(name: "_SC_TIMER_MAX", value: 35, isUnsigned: true)
!367 = !DIEnumerator(name: "_SC_BC_BASE_MAX", value: 36, isUnsigned: true)
!368 = !DIEnumerator(name: "_SC_BC_DIM_MAX", value: 37, isUnsigned: true)
!369 = !DIEnumerator(name: "_SC_BC_SCALE_MAX", value: 38, isUnsigned: true)
!370 = !DIEnumerator(name: "_SC_BC_STRING_MAX", value: 39, isUnsigned: true)
!371 = !DIEnumerator(name: "_SC_COLL_WEIGHTS_MAX", value: 40, isUnsigned: true)
!372 = !DIEnumerator(name: "_SC_EQUIV_CLASS_MAX", value: 41, isUnsigned: true)
!373 = !DIEnumerator(name: "_SC_EXPR_NEST_MAX", value: 42, isUnsigned: true)
!374 = !DIEnumerator(name: "_SC_LINE_MAX", value: 43, isUnsigned: true)
!375 = !DIEnumerator(name: "_SC_RE_DUP_MAX", value: 44, isUnsigned: true)
!376 = !DIEnumerator(name: "_SC_CHARCLASS_NAME_MAX", value: 45, isUnsigned: true)
!377 = !DIEnumerator(name: "_SC_2_VERSION", value: 46, isUnsigned: true)
!378 = !DIEnumerator(name: "_SC_2_C_BIND", value: 47, isUnsigned: true)
!379 = !DIEnumerator(name: "_SC_2_C_DEV", value: 48, isUnsigned: true)
!380 = !DIEnumerator(name: "_SC_2_FORT_DEV", value: 49, isUnsigned: true)
!381 = !DIEnumerator(name: "_SC_2_FORT_RUN", value: 50, isUnsigned: true)
!382 = !DIEnumerator(name: "_SC_2_SW_DEV", value: 51, isUnsigned: true)
!383 = !DIEnumerator(name: "_SC_2_LOCALEDEF", value: 52, isUnsigned: true)
!384 = !DIEnumerator(name: "_SC_PII", value: 53, isUnsigned: true)
!385 = !DIEnumerator(name: "_SC_PII_XTI", value: 54, isUnsigned: true)
!386 = !DIEnumerator(name: "_SC_PII_SOCKET", value: 55, isUnsigned: true)
!387 = !DIEnumerator(name: "_SC_PII_INTERNET", value: 56, isUnsigned: true)
!388 = !DIEnumerator(name: "_SC_PII_OSI", value: 57, isUnsigned: true)
!389 = !DIEnumerator(name: "_SC_POLL", value: 58, isUnsigned: true)
!390 = !DIEnumerator(name: "_SC_SELECT", value: 59, isUnsigned: true)
!391 = !DIEnumerator(name: "_SC_UIO_MAXIOV", value: 60, isUnsigned: true)
!392 = !DIEnumerator(name: "_SC_IOV_MAX", value: 60, isUnsigned: true)
!393 = !DIEnumerator(name: "_SC_PII_INTERNET_STREAM", value: 61, isUnsigned: true)
!394 = !DIEnumerator(name: "_SC_PII_INTERNET_DGRAM", value: 62, isUnsigned: true)
!395 = !DIEnumerator(name: "_SC_PII_OSI_COTS", value: 63, isUnsigned: true)
!396 = !DIEnumerator(name: "_SC_PII_OSI_CLTS", value: 64, isUnsigned: true)
!397 = !DIEnumerator(name: "_SC_PII_OSI_M", value: 65, isUnsigned: true)
!398 = !DIEnumerator(name: "_SC_T_IOV_MAX", value: 66, isUnsigned: true)
!399 = !DIEnumerator(name: "_SC_THREADS", value: 67, isUnsigned: true)
!400 = !DIEnumerator(name: "_SC_THREAD_SAFE_FUNCTIONS", value: 68, isUnsigned: true)
!401 = !DIEnumerator(name: "_SC_GETGR_R_SIZE_MAX", value: 69, isUnsigned: true)
!402 = !DIEnumerator(name: "_SC_GETPW_R_SIZE_MAX", value: 70, isUnsigned: true)
!403 = !DIEnumerator(name: "_SC_LOGIN_NAME_MAX", value: 71, isUnsigned: true)
!404 = !DIEnumerator(name: "_SC_TTY_NAME_MAX", value: 72, isUnsigned: true)
!405 = !DIEnumerator(name: "_SC_THREAD_DESTRUCTOR_ITERATIONS", value: 73, isUnsigned: true)
!406 = !DIEnumerator(name: "_SC_THREAD_KEYS_MAX", value: 74, isUnsigned: true)
!407 = !DIEnumerator(name: "_SC_THREAD_STACK_MIN", value: 75, isUnsigned: true)
!408 = !DIEnumerator(name: "_SC_THREAD_THREADS_MAX", value: 76, isUnsigned: true)
!409 = !DIEnumerator(name: "_SC_THREAD_ATTR_STACKADDR", value: 77, isUnsigned: true)
!410 = !DIEnumerator(name: "_SC_THREAD_ATTR_STACKSIZE", value: 78, isUnsigned: true)
!411 = !DIEnumerator(name: "_SC_THREAD_PRIORITY_SCHEDULING", value: 79, isUnsigned: true)
!412 = !DIEnumerator(name: "_SC_THREAD_PRIO_INHERIT", value: 80, isUnsigned: true)
!413 = !DIEnumerator(name: "_SC_THREAD_PRIO_PROTECT", value: 81, isUnsigned: true)
!414 = !DIEnumerator(name: "_SC_THREAD_PROCESS_SHARED", value: 82, isUnsigned: true)
!415 = !DIEnumerator(name: "_SC_NPROCESSORS_CONF", value: 83, isUnsigned: true)
!416 = !DIEnumerator(name: "_SC_NPROCESSORS_ONLN", value: 84, isUnsigned: true)
!417 = !DIEnumerator(name: "_SC_PHYS_PAGES", value: 85, isUnsigned: true)
!418 = !DIEnumerator(name: "_SC_AVPHYS_PAGES", value: 86, isUnsigned: true)
!419 = !DIEnumerator(name: "_SC_ATEXIT_MAX", value: 87, isUnsigned: true)
!420 = !DIEnumerator(name: "_SC_PASS_MAX", value: 88, isUnsigned: true)
!421 = !DIEnumerator(name: "_SC_XOPEN_VERSION", value: 89, isUnsigned: true)
!422 = !DIEnumerator(name: "_SC_XOPEN_XCU_VERSION", value: 90, isUnsigned: true)
!423 = !DIEnumerator(name: "_SC_XOPEN_UNIX", value: 91, isUnsigned: true)
!424 = !DIEnumerator(name: "_SC_XOPEN_CRYPT", value: 92, isUnsigned: true)
!425 = !DIEnumerator(name: "_SC_XOPEN_ENH_I18N", value: 93, isUnsigned: true)
!426 = !DIEnumerator(name: "_SC_XOPEN_SHM", value: 94, isUnsigned: true)
!427 = !DIEnumerator(name: "_SC_2_CHAR_TERM", value: 95, isUnsigned: true)
!428 = !DIEnumerator(name: "_SC_2_C_VERSION", value: 96, isUnsigned: true)
!429 = !DIEnumerator(name: "_SC_2_UPE", value: 97, isUnsigned: true)
!430 = !DIEnumerator(name: "_SC_XOPEN_XPG2", value: 98, isUnsigned: true)
!431 = !DIEnumerator(name: "_SC_XOPEN_XPG3", value: 99, isUnsigned: true)
!432 = !DIEnumerator(name: "_SC_XOPEN_XPG4", value: 100, isUnsigned: true)
!433 = !DIEnumerator(name: "_SC_CHAR_BIT", value: 101, isUnsigned: true)
!434 = !DIEnumerator(name: "_SC_CHAR_MAX", value: 102, isUnsigned: true)
!435 = !DIEnumerator(name: "_SC_CHAR_MIN", value: 103, isUnsigned: true)
!436 = !DIEnumerator(name: "_SC_INT_MAX", value: 104, isUnsigned: true)
!437 = !DIEnumerator(name: "_SC_INT_MIN", value: 105, isUnsigned: true)
!438 = !DIEnumerator(name: "_SC_LONG_BIT", value: 106, isUnsigned: true)
!439 = !DIEnumerator(name: "_SC_WORD_BIT", value: 107, isUnsigned: true)
!440 = !DIEnumerator(name: "_SC_MB_LEN_MAX", value: 108, isUnsigned: true)
!441 = !DIEnumerator(name: "_SC_NZERO", value: 109, isUnsigned: true)
!442 = !DIEnumerator(name: "_SC_SSIZE_MAX", value: 110, isUnsigned: true)
!443 = !DIEnumerator(name: "_SC_SCHAR_MAX", value: 111, isUnsigned: true)
!444 = !DIEnumerator(name: "_SC_SCHAR_MIN", value: 112, isUnsigned: true)
!445 = !DIEnumerator(name: "_SC_SHRT_MAX", value: 113, isUnsigned: true)
!446 = !DIEnumerator(name: "_SC_SHRT_MIN", value: 114, isUnsigned: true)
!447 = !DIEnumerator(name: "_SC_UCHAR_MAX", value: 115, isUnsigned: true)
!448 = !DIEnumerator(name: "_SC_UINT_MAX", value: 116, isUnsigned: true)
!449 = !DIEnumerator(name: "_SC_ULONG_MAX", value: 117, isUnsigned: true)
!450 = !DIEnumerator(name: "_SC_USHRT_MAX", value: 118, isUnsigned: true)
!451 = !DIEnumerator(name: "_SC_NL_ARGMAX", value: 119, isUnsigned: true)
!452 = !DIEnumerator(name: "_SC_NL_LANGMAX", value: 120, isUnsigned: true)
!453 = !DIEnumerator(name: "_SC_NL_MSGMAX", value: 121, isUnsigned: true)
!454 = !DIEnumerator(name: "_SC_NL_NMAX", value: 122, isUnsigned: true)
!455 = !DIEnumerator(name: "_SC_NL_SETMAX", value: 123, isUnsigned: true)
!456 = !DIEnumerator(name: "_SC_NL_TEXTMAX", value: 124, isUnsigned: true)
!457 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFF32", value: 125, isUnsigned: true)
!458 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFFBIG", value: 126, isUnsigned: true)
!459 = !DIEnumerator(name: "_SC_XBS5_LP64_OFF64", value: 127, isUnsigned: true)
!460 = !DIEnumerator(name: "_SC_XBS5_LPBIG_OFFBIG", value: 128, isUnsigned: true)
!461 = !DIEnumerator(name: "_SC_XOPEN_LEGACY", value: 129, isUnsigned: true)
!462 = !DIEnumerator(name: "_SC_XOPEN_REALTIME", value: 130, isUnsigned: true)
!463 = !DIEnumerator(name: "_SC_XOPEN_REALTIME_THREADS", value: 131, isUnsigned: true)
!464 = !DIEnumerator(name: "_SC_ADVISORY_INFO", value: 132, isUnsigned: true)
!465 = !DIEnumerator(name: "_SC_BARRIERS", value: 133, isUnsigned: true)
!466 = !DIEnumerator(name: "_SC_BASE", value: 134, isUnsigned: true)
!467 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT", value: 135, isUnsigned: true)
!468 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT_R", value: 136, isUnsigned: true)
!469 = !DIEnumerator(name: "_SC_CLOCK_SELECTION", value: 137, isUnsigned: true)
!470 = !DIEnumerator(name: "_SC_CPUTIME", value: 138, isUnsigned: true)
!471 = !DIEnumerator(name: "_SC_THREAD_CPUTIME", value: 139, isUnsigned: true)
!472 = !DIEnumerator(name: "_SC_DEVICE_IO", value: 140, isUnsigned: true)
!473 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC", value: 141, isUnsigned: true)
!474 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC_R", value: 142, isUnsigned: true)
!475 = !DIEnumerator(name: "_SC_FD_MGMT", value: 143, isUnsigned: true)
!476 = !DIEnumerator(name: "_SC_FIFO", value: 144, isUnsigned: true)
!477 = !DIEnumerator(name: "_SC_PIPE", value: 145, isUnsigned: true)
!478 = !DIEnumerator(name: "_SC_FILE_ATTRIBUTES", value: 146, isUnsigned: true)
!479 = !DIEnumerator(name: "_SC_FILE_LOCKING", value: 147, isUnsigned: true)
!480 = !DIEnumerator(name: "_SC_FILE_SYSTEM", value: 148, isUnsigned: true)
!481 = !DIEnumerator(name: "_SC_MONOTONIC_CLOCK", value: 149, isUnsigned: true)
!482 = !DIEnumerator(name: "_SC_MULTI_PROCESS", value: 150, isUnsigned: true)
!483 = !DIEnumerator(name: "_SC_SINGLE_PROCESS", value: 151, isUnsigned: true)
!484 = !DIEnumerator(name: "_SC_NETWORKING", value: 152, isUnsigned: true)
!485 = !DIEnumerator(name: "_SC_READER_WRITER_LOCKS", value: 153, isUnsigned: true)
!486 = !DIEnumerator(name: "_SC_SPIN_LOCKS", value: 154, isUnsigned: true)
!487 = !DIEnumerator(name: "_SC_REGEXP", value: 155, isUnsigned: true)
!488 = !DIEnumerator(name: "_SC_REGEX_VERSION", value: 156, isUnsigned: true)
!489 = !DIEnumerator(name: "_SC_SHELL", value: 157, isUnsigned: true)
!490 = !DIEnumerator(name: "_SC_SIGNALS", value: 158, isUnsigned: true)
!491 = !DIEnumerator(name: "_SC_SPAWN", value: 159, isUnsigned: true)
!492 = !DIEnumerator(name: "_SC_SPORADIC_SERVER", value: 160, isUnsigned: true)
!493 = !DIEnumerator(name: "_SC_THREAD_SPORADIC_SERVER", value: 161, isUnsigned: true)
!494 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162, isUnsigned: true)
!495 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163, isUnsigned: true)
!496 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164, isUnsigned: true)
!497 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165, isUnsigned: true)
!498 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166, isUnsigned: true)
!499 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167, isUnsigned: true)
!500 = !DIEnumerator(name: "_SC_2_PBS", value: 168, isUnsigned: true)
!501 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169, isUnsigned: true)
!502 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170, isUnsigned: true)
!503 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171, isUnsigned: true)
!504 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172, isUnsigned: true)
!505 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173, isUnsigned: true)
!506 = !DIEnumerator(name: "_SC_STREAMS", value: 174, isUnsigned: true)
!507 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175, isUnsigned: true)
!508 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176, isUnsigned: true)
!509 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177, isUnsigned: true)
!510 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178, isUnsigned: true)
!511 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179, isUnsigned: true)
!512 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180, isUnsigned: true)
!513 = !DIEnumerator(name: "_SC_TRACE", value: 181, isUnsigned: true)
!514 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182, isUnsigned: true)
!515 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183, isUnsigned: true)
!516 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184, isUnsigned: true)
!517 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185, isUnsigned: true)
!518 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186, isUnsigned: true)
!519 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187, isUnsigned: true)
!520 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188, isUnsigned: true)
!521 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189, isUnsigned: true)
!522 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190, isUnsigned: true)
!523 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191, isUnsigned: true)
!524 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192, isUnsigned: true)
!525 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193, isUnsigned: true)
!526 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194, isUnsigned: true)
!527 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195, isUnsigned: true)
!528 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196, isUnsigned: true)
!529 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197, isUnsigned: true)
!530 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198, isUnsigned: true)
!531 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199, isUnsigned: true)
!532 = !DIEnumerator(name: "_SC_IPV6", value: 235, isUnsigned: true)
!533 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236, isUnsigned: true)
!534 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237, isUnsigned: true)
!535 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238, isUnsigned: true)
!536 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239, isUnsigned: true)
!537 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240, isUnsigned: true)
!538 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241, isUnsigned: true)
!539 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242, isUnsigned: true)
!540 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243, isUnsigned: true)
!541 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244, isUnsigned: true)
!542 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245, isUnsigned: true)
!543 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246, isUnsigned: true)
!544 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247, isUnsigned: true)
!545 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248, isUnsigned: true)
!546 = !{!19, !7, !547, !178, !33, !548, !550}
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "__rlim_t", file: !38, line: 157, baseType: !161)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !36, line: 64, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !38, line: 147, baseType: !7)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !36, line: 79, baseType: !99)
!551 = !{!552, !675, !296, !681, !683, !685, !687, !689, !696}
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "policy_plugin", scope: !298, file: !554, line: 101, type: !555, isLocal: false, isDefinition: true)
!554 = !DIFile(filename: "./sudo.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/src")
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "plugin_container", file: !250, line: 60, size: 320, elements: !556)
!556 = !{!557, !559, !560, !561, !562}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !555, file: !250, line: 61, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !555, file: !250, line: 62, baseType: !558, size: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !555, file: !250, line: 63, baseType: !221, size: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !555, file: !250, line: 64, baseType: !19, size: 64, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !555, file: !250, line: 70, baseType: !563, size: 64, offset: 256)
!563 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !555, file: !250, line: 65, size: 64, elements: !564)
!564 = !{!565, !571, !641, !658}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !563, file: !250, line: 66, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "generic_plugin", file: !250, line: 23, size: 64, elements: !568)
!568 = !{!569, !570}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !567, file: !250, line: 24, baseType: !7, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !567, file: !250, line: 25, baseType: !7, size: 32, offset: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !563, file: !250, line: 67, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "policy_plugin", file: !574, line: 59, size: 576, elements: !575)
!574 = !DIFile(filename: "../include/sudo_plugin.h", directory: "/home/salman/DPP/data/sudo-1.8.3p1/src")
!575 = !{!576, !577, !578, !603, !607, !611, !617, !621, !625, !626}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !573, file: !574, line: 61, baseType: !7, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !573, file: !574, line: 62, baseType: !7, size: 32, offset: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !573, file: !574, line: 63, baseType: !579, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!33, !7, !582, !597, !601, !601, !601}
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "sudo_conv_t", file: !574, line: 53, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!33, !33, !586, !593}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sudo_conv_message", file: !574, line: 37, size: 128, elements: !589)
!589 = !{!590, !591, !592}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "msg_type", scope: !588, file: !574, line: 44, baseType: !33, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !588, file: !574, line: 45, baseType: !33, size: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !588, file: !574, line: 46, baseType: !221, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sudo_conv_reply", file: !574, line: 49, size: 64, elements: !595)
!595 = !{!596}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !594, file: !574, line: 50, baseType: !20, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "sudo_printf_t", file: !574, line: 55, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{!33, !33, !221, null}
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !573, file: !574, line: 66, baseType: !604, size: 64, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{null, !33, !33}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "show_version", scope: !573, file: !574, line: 67, baseType: !608, size: 64, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!33, !33}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "check_policy", scope: !573, file: !574, line: 68, baseType: !612, size: 64, offset: 256)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!33, !33, !601, !615, !616, !616, !616}
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !573, file: !574, line: 71, baseType: !618, size: 64, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!33, !33, !601, !33, !221}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "validate", scope: !573, file: !574, line: 73, baseType: !622, size: 64, offset: 384)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!33}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "invalidate", scope: !573, file: !574, line: 74, baseType: !71, size: 64, offset: 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "init_session", scope: !573, file: !574, line: 75, baseType: !627, size: 64, offset: 512)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!33, !630}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !632, line: 49, size: 384, elements: !633)
!632 = !DIFile(filename: "/usr/include/pwd.h", directory: "")
!633 = !{!634, !635, !636, !637, !638, !639, !640}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !631, file: !632, line: 51, baseType: !20, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !631, file: !632, line: 52, baseType: !20, size: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !631, file: !632, line: 54, baseType: !99, size: 32, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !631, file: !632, line: 55, baseType: !549, size: 32, offset: 160)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !631, file: !632, line: 56, baseType: !20, size: 64, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !631, file: !632, line: 57, baseType: !20, size: 64, offset: 256)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !631, file: !632, line: 58, baseType: !20, size: 64, offset: 320)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !563, file: !250, line: 68, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "io_plugin", file: !574, line: 79, size: 576, elements: !644)
!644 = !{!645, !646, !647, !651, !652, !653, !654, !655, !656, !657}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !643, file: !574, line: 81, baseType: !7, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !643, file: !574, line: 82, baseType: !7, size: 32, offset: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !643, file: !574, line: 83, baseType: !648, size: 64, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!33, !7, !582, !597, !601, !601, !601, !33, !601, !601}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !643, file: !574, line: 87, baseType: !604, size: 64, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "show_version", scope: !643, file: !574, line: 88, baseType: !608, size: 64, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "log_ttyin", scope: !643, file: !574, line: 89, baseType: !218, size: 64, offset: 256)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "log_ttyout", scope: !643, file: !574, line: 90, baseType: !218, size: 64, offset: 320)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "log_stdin", scope: !643, file: !574, line: 91, baseType: !218, size: 64, offset: 384)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "log_stdout", scope: !643, file: !574, line: 92, baseType: !218, size: 64, offset: 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "log_stderr", scope: !643, file: !574, line: 93, baseType: !218, size: 64, offset: 512)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "io_1_0", scope: !563, file: !250, line: 69, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "io_plugin_1_0", file: !250, line: 32, size: 576, elements: !661)
!661 = !{!662, !663, !664, !668, !669, !670, !671, !672, !673, !674}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !660, file: !250, line: 33, baseType: !7, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !660, file: !250, line: 34, baseType: !7, size: 32, offset: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !660, file: !250, line: 35, baseType: !665, size: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!33, !7, !582, !597, !601, !601, !33, !601, !601}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !660, file: !250, line: 39, baseType: !604, size: 64, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "show_version", scope: !660, file: !250, line: 40, baseType: !608, size: 64, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "log_ttyin", scope: !660, file: !250, line: 41, baseType: !218, size: 64, offset: 256)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "log_ttyout", scope: !660, file: !250, line: 42, baseType: !218, size: 64, offset: 320)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "log_stdin", scope: !660, file: !250, line: 43, baseType: !218, size: 64, offset: 384)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "log_stdout", scope: !660, file: !250, line: 44, baseType: !218, size: 64, offset: 448)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "log_stderr", scope: !660, file: !250, line: 45, baseType: !218, size: 64, offset: 512)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "io_plugins", scope: !298, file: !554, line: 102, type: !677, isLocal: false, isDefinition: true)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "plugin_container_list", file: !250, line: 72, size: 128, elements: !678)
!678 = !{!679, !680}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !677, file: !250, line: 72, baseType: !558, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !677, file: !250, line: 72, baseType: !558, size: 64, offset: 64)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "list_user", scope: !298, file: !554, line: 104, type: !221, isLocal: false, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "runas_user", scope: !298, file: !554, line: 104, type: !221, isLocal: false, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "runas_group", scope: !298, file: !554, line: 104, type: !221, isLocal: false, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "debug_level", scope: !298, file: !554, line: 105, type: !33, isLocal: false, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "corelimit", scope: !298, file: !554, line: 150, type: !691, isLocal: true, isDefinition: true)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rlimit", file: !302, line: 139, size: 128, elements: !692)
!692 = !{!693, !695}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_cur", scope: !691, file: !302, line: 142, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "rlim_t", file: !302, line: 131, baseType: !547)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_max", scope: !691, file: !302, line: 144, baseType: !694, size: 64, offset: 64)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "nproclimit", scope: !298, file: !554, line: 153, type: !691, isLocal: true, isDefinition: true)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "user_details", file: !699, line: 95, size: 640, elements: !700)
!699 = !DIFile(filename: "./sudo.h", directory: "/home/salman/DPP/data/sudo-1.8.3p1/src")
!700 = !{!701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !712, !713, !714}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !698, file: !699, line: 96, baseType: !550, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "euid", scope: !698, file: !699, line: 97, baseType: !550, size: 32, offset: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !698, file: !699, line: 98, baseType: !550, size: 32, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "egid", scope: !698, file: !699, line: 99, baseType: !550, size: 32, offset: 96)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !698, file: !699, line: 100, baseType: !221, size: 64, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "cwd", scope: !698, file: !699, line: 101, baseType: !221, size: 64, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "tty", scope: !698, file: !699, line: 102, baseType: !221, size: 64, offset: 256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !698, file: !699, line: 103, baseType: !221, size: 64, offset: 320)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "shell", scope: !698, file: !699, line: 104, baseType: !221, size: 64, offset: 384)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !698, file: !699, line: 105, baseType: !711, size: 64, offset: 448)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ngroups", scope: !698, file: !699, line: 106, baseType: !33, size: 32, offset: 512)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ts_cols", scope: !698, file: !699, line: 107, baseType: !33, size: 32, offset: 544)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ts_lines", scope: !698, file: !699, line: 108, baseType: !33, size: 32, offset: 576)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "askpass_path", scope: !717, file: !724, line: 67, type: !221, isLocal: false, isDefinition: true)
!717 = distinct !DICompileUnit(language: DW_LANG_C99, file: !718, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !176, retainedTypes: !719, globals: !720, splitDebugInlining: false, nameTableKind: None)
!718 = !DIFile(filename: "tgetpass.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/src")
!719 = !{!19, !69, !7, !20}
!720 = !{!721, !727, !732, !715, !741, !746}
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "askpass", scope: !723, file: !724, line: 79, type: !221, isLocal: true, isDefinition: true)
!723 = distinct !DISubprogram(name: "tgetpass", scope: !724, file: !724, line: 74, type: !725, scopeLine: 75, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !717, retainedNodes: !176)
!724 = !DIFile(filename: "./tgetpass.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/src")
!725 = !DISubroutineType(types: !726)
!726 = !{!20, !221, !33, !33}
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "buf", scope: !723, file: !724, line: 80, type: !729, isLocal: true, isDefinition: true)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2056, elements: !730)
!730 = !{!731}
!731 = !DISubrange(count: 257, lowerBound: 0)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "signo", scope: !717, file: !724, line: 58, type: !734, isLocal: true, isDefinition: true)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !735, size: 2080, elements: !739)
!735 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !736)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !737, line: 8, baseType: !738)
!737 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/sig_atomic_t.h", directory: "")
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sig_atomic_t", file: !38, line: 214, baseType: !33)
!739 = !{!740}
!740 = !DISubrange(count: 65, lowerBound: 0)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "buf", scope: !743, file: !724, line: 215, type: !729, isLocal: true, isDefinition: true)
!743 = distinct !DISubprogram(name: "sudo_askpass", scope: !724, file: !724, line: 213, type: !744, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !717, retainedNodes: !176)
!744 = !DISubroutineType(types: !745)
!745 = !{!20, !221, !221}
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "pass", scope: !743, file: !724, line: 215, type: !20, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "buf", scope: !750, file: !751, line: 153, type: !810, isLocal: true, isDefinition: true)
!750 = distinct !DISubprogram(name: "sudo_parseln", scope: !751, file: !751, line: 149, type: !752, scopeLine: 150, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !806, retainedNodes: !176)
!751 = !DIFile(filename: "./fileops.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/common")
!752 = !DISubroutineType(types: !753)
!753 = !{!20, !754}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !756, line: 7, baseType: !757)
!756 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !758, line: 49, size: 1728, elements: !759)
!758 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!759 = !{!760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !775, !777, !778, !779, !781, !782, !783, !787, !790, !792, !795, !798, !799, !800, !801, !802}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !757, file: !758, line: 51, baseType: !33, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !757, file: !758, line: 54, baseType: !20, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !757, file: !758, line: 55, baseType: !20, size: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !757, file: !758, line: 56, baseType: !20, size: 64, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !757, file: !758, line: 57, baseType: !20, size: 64, offset: 256)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !757, file: !758, line: 58, baseType: !20, size: 64, offset: 320)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !757, file: !758, line: 59, baseType: !20, size: 64, offset: 384)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !757, file: !758, line: 60, baseType: !20, size: 64, offset: 448)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !757, file: !758, line: 61, baseType: !20, size: 64, offset: 512)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !757, file: !758, line: 64, baseType: !20, size: 64, offset: 576)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !757, file: !758, line: 65, baseType: !20, size: 64, offset: 640)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !757, file: !758, line: 66, baseType: !20, size: 64, offset: 704)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !757, file: !758, line: 68, baseType: !773, size: 64, offset: 768)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !758, line: 36, flags: DIFlagFwdDecl)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !757, file: !758, line: 70, baseType: !776, size: 64, offset: 832)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !757, file: !758, line: 72, baseType: !33, size: 32, offset: 896)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !757, file: !758, line: 73, baseType: !33, size: 32, offset: 928)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !757, file: !758, line: 74, baseType: !780, size: 64, offset: 960)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !38, line: 152, baseType: !30)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !757, file: !758, line: 77, baseType: !284, size: 16, offset: 1024)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !757, file: !758, line: 78, baseType: !178, size: 8, offset: 1040)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !757, file: !758, line: 79, baseType: !784, size: 8, offset: 1048)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8, elements: !785)
!785 = !{!786}
!786 = !DISubrange(count: 1, lowerBound: 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !757, file: !758, line: 81, baseType: !788, size: 64, offset: 1088)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !758, line: 43, baseType: null)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !757, file: !758, line: 89, baseType: !791, size: 64, offset: 1152)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !38, line: 153, baseType: !30)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !757, file: !758, line: 91, baseType: !793, size: 64, offset: 1216)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !758, line: 37, flags: DIFlagFwdDecl)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !757, file: !758, line: 92, baseType: !796, size: 64, offset: 1280)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !758, line: 38, flags: DIFlagFwdDecl)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !757, file: !758, line: 93, baseType: !776, size: 64, offset: 1344)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !757, file: !758, line: 94, baseType: !19, size: 64, offset: 1408)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !757, file: !758, line: 95, baseType: !282, size: 64, offset: 1472)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !757, file: !758, line: 96, baseType: !33, size: 32, offset: 1536)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !757, file: !758, line: 98, baseType: !803, size: 160, offset: 1568)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 160, elements: !804)
!804 = !{!805}
!805 = !DISubrange(count: 20, lowerBound: 0)
!806 = distinct !DICompileUnit(language: DW_LANG_C99, file: !807, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !265, retainedTypes: !808, globals: !809, splitDebugInlining: false, nameTableKind: None)
!807 = !DIFile(filename: "fileops.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/common")
!808 = !{!19, !33, !34, !284}
!809 = !{!748}
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 16384, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 2048, lowerBound: 0)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "term_erase", scope: !815, file: !820, line: 66, type: !33, isLocal: false, isDefinition: true)
!815 = distinct !DICompileUnit(language: DW_LANG_C99, file: !816, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !176, globals: !817, splitDebugInlining: false, nameTableKind: None)
!816 = !DIFile(filename: "term.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/common")
!817 = !{!818, !839, !841, !813, !843}
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "term", scope: !815, file: !820, line: 64, type: !821, isLocal: true, isDefinition: true)
!820 = !DIFile(filename: "./term.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/common")
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "termios", file: !822, line: 24, size: 480, elements: !823)
!822 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/termios-struct.h", directory: "")
!823 = !{!824, !827, !828, !829, !830, !832, !836, !838}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "c_iflag", scope: !821, file: !822, line: 26, baseType: !825, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcflag_t", file: !826, line: 25, baseType: !7)
!826 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/termios.h", directory: "")
!827 = !DIDerivedType(tag: DW_TAG_member, name: "c_oflag", scope: !821, file: !822, line: 27, baseType: !825, size: 32, offset: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "c_cflag", scope: !821, file: !822, line: 28, baseType: !825, size: 32, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "c_lflag", scope: !821, file: !822, line: 29, baseType: !825, size: 32, offset: 96)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "c_line", scope: !821, file: !822, line: 30, baseType: !831, size: 8, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "cc_t", file: !826, line: 23, baseType: !34)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "c_cc", scope: !821, file: !822, line: 31, baseType: !833, size: 256, offset: 136)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !831, size: 256, elements: !834)
!834 = !{!835}
!835 = !DISubrange(count: 32, lowerBound: 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "c_ispeed", scope: !821, file: !822, line: 32, baseType: !837, size: 32, offset: 416)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "speed_t", file: !826, line: 24, baseType: !7)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "c_ospeed", scope: !821, file: !822, line: 33, baseType: !837, size: 32, offset: 448)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "oterm", scope: !815, file: !820, line: 64, type: !821, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "changed", scope: !815, file: !820, line: 65, type: !33, isLocal: true, isDefinition: true)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "term_kill", scope: !815, file: !820, line: 67, type: !33, isLocal: false, isDefinition: true)
!845 = distinct !DICompileUnit(language: DW_LANG_C99, file: !846, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !176, retainedTypes: !240, splitDebugInlining: false, nameTableKind: None)
!846 = !DIFile(filename: "conversation.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/src")
!847 = distinct !DICompileUnit(language: DW_LANG_C99, file: !848, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !176, retainedTypes: !240, splitDebugInlining: false, nameTableKind: None)
!848 = !DIFile(filename: "error.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/src")
!849 = distinct !DICompileUnit(language: DW_LANG_C99, file: !850, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !176, retainedTypes: !240, splitDebugInlining: false, nameTableKind: None)
!850 = !DIFile(filename: "get_pty.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/src")
!851 = distinct !DICompileUnit(language: DW_LANG_C99, file: !852, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !853, retainedTypes: !873, splitDebugInlining: false, nameTableKind: None)
!852 = !DIFile(filename: "net_ifs.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/src")
!853 = !{!854}
!854 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !855, line: 42, baseType: !7, size: 32, elements: !856)
!855 = !DIFile(filename: "/usr/include/net/if.h", directory: "")
!856 = !{!857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872}
!857 = !DIEnumerator(name: "IFF_UP", value: 1, isUnsigned: true)
!858 = !DIEnumerator(name: "IFF_BROADCAST", value: 2, isUnsigned: true)
!859 = !DIEnumerator(name: "IFF_DEBUG", value: 4, isUnsigned: true)
!860 = !DIEnumerator(name: "IFF_LOOPBACK", value: 8, isUnsigned: true)
!861 = !DIEnumerator(name: "IFF_POINTOPOINT", value: 16, isUnsigned: true)
!862 = !DIEnumerator(name: "IFF_NOTRAILERS", value: 32, isUnsigned: true)
!863 = !DIEnumerator(name: "IFF_RUNNING", value: 64, isUnsigned: true)
!864 = !DIEnumerator(name: "IFF_NOARP", value: 128, isUnsigned: true)
!865 = !DIEnumerator(name: "IFF_PROMISC", value: 256, isUnsigned: true)
!866 = !DIEnumerator(name: "IFF_ALLMULTI", value: 512, isUnsigned: true)
!867 = !DIEnumerator(name: "IFF_MASTER", value: 1024, isUnsigned: true)
!868 = !DIEnumerator(name: "IFF_SLAVE", value: 2048, isUnsigned: true)
!869 = !DIEnumerator(name: "IFF_MULTICAST", value: 4096, isUnsigned: true)
!870 = !DIEnumerator(name: "IFF_PORTSEL", value: 8192, isUnsigned: true)
!871 = !DIEnumerator(name: "IFF_AUTOMEDIA", value: 16384, isUnsigned: true)
!872 = !DIEnumerator(name: "IFF_DYNAMIC", value: 32768, isUnsigned: true)
!873 = !{!19, !874, !896}
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !876, line: 238, size: 128, elements: !877)
!876 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "")
!877 = !{!878, !881, !886, !892}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !875, file: !876, line: 240, baseType: !879, size: 16)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !880, line: 28, baseType: !284)
!880 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "")
!881 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !875, file: !876, line: 241, baseType: !882, size: 16, offset: 16)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !876, line: 119, baseType: !883)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !884, line: 25, baseType: !885)
!884 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !38, line: 40, baseType: !284)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !875, file: !876, line: 242, baseType: !887, size: 32, offset: 32)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !876, line: 31, size: 32, elements: !888)
!888 = !{!889}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !887, file: !876, line: 33, baseType: !890, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !876, line: 30, baseType: !891)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !884, line: 26, baseType: !142)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !875, file: !876, line: 245, baseType: !893, size: 64, offset: 64)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 64, elements: !894)
!894 = !{!895}
!895 = !DISubrange(count: 8, lowerBound: 0)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !876, line: 253, size: 224, elements: !898)
!898 = !{!899, !900, !901, !902, !918}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !897, file: !876, line: 255, baseType: !879, size: 16)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !897, file: !876, line: 256, baseType: !882, size: 16, offset: 16)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !897, file: !876, line: 257, baseType: !891, size: 32, offset: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !897, file: !876, line: 258, baseType: !903, size: 128, offset: 64)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !876, line: 212, size: 128, elements: !904)
!904 = !{!905}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !903, file: !876, line: 219, baseType: !906, size: 128)
!906 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !903, file: !876, line: 214, size: 128, elements: !907)
!907 = !{!908, !912, !914}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !906, file: !876, line: 216, baseType: !909, size: 128)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !910, size: 128, elements: !31)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !884, line: 24, baseType: !911)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !38, line: 38, baseType: !34)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !906, file: !876, line: 217, baseType: !913, size: 128)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !883, size: 128, elements: !894)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !906, file: !876, line: 218, baseType: !915, size: 128)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !891, size: 128, elements: !916)
!916 = !{!917}
!917 = !DISubrange(count: 4, lowerBound: 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !897, file: !876, line: 259, baseType: !891, size: 32, offset: 192)
!919 = distinct !DICompileUnit(language: DW_LANG_C99, file: !920, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !176, retainedTypes: !921, splitDebugInlining: false, nameTableKind: None)
!920 = !DIFile(filename: "sudo_edit.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/src")
!921 = !{!19, !33, !282, !615}
!922 = distinct !DICompileUnit(language: DW_LANG_C99, file: !923, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !176, retainedTypes: !240, splitDebugInlining: false, nameTableKind: None)
!923 = !DIFile(filename: "ttysize.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/src")
!924 = distinct !DICompileUnit(language: DW_LANG_C99, file: !925, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !176, retainedTypes: !240, splitDebugInlining: false, nameTableKind: None)
!925 = !DIFile(filename: "utmp.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/src")
!926 = distinct !DICompileUnit(language: DW_LANG_C99, file: !927, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !176, retainedTypes: !928, splitDebugInlining: false, nameTableKind: None)
!927 = !DIFile(filename: "alloc.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/common")
!928 = !{!19, !20}
!929 = distinct !DICompileUnit(language: DW_LANG_C99, file: !930, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !176, splitDebugInlining: false, nameTableKind: None)
!930 = !DIFile(filename: "atobool.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/common")
!931 = distinct !DICompileUnit(language: DW_LANG_C99, file: !932, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !176, retainedTypes: !240, splitDebugInlining: false, nameTableKind: None)
!932 = !DIFile(filename: "fmt_string.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/common")
!933 = distinct !DICompileUnit(language: DW_LANG_C99, file: !934, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !265, retainedTypes: !808, splitDebugInlining: false, nameTableKind: None)
!934 = !DIFile(filename: "lbuf.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/common")
!935 = distinct !DICompileUnit(language: DW_LANG_C99, file: !936, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !176, retainedTypes: !937, splitDebugInlining: false, nameTableKind: None)
!936 = !DIFile(filename: "list.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/common")
!937 = !{!938, !19, !943}
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head_proto", file: !940, line: 43, size: 128, elements: !941)
!940 = !DIFile(filename: "./list.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/common")
!941 = !{!942, !948}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !939, file: !940, line: 44, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_proto", file: !940, line: 38, size: 128, elements: !945)
!945 = !{!946, !947}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !944, file: !940, line: 39, baseType: !943, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !944, file: !940, line: 40, baseType: !943, size: 64, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !939, file: !940, line: 45, baseType: !943, size: 64, offset: 64)
!949 = distinct !DICompileUnit(language: DW_LANG_C99, file: !950, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !951, retainedTypes: !624, splitDebugInlining: false, nameTableKind: None)
!950 = !DIFile(filename: "setgroups.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/common")
!951 = !{!328}
!952 = distinct !DICompileUnit(language: DW_LANG_C99, file: !953, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !176, splitDebugInlining: false, nameTableKind: None)
!953 = !DIFile(filename: "zero_bytes.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/common")
!954 = distinct !DICompileUnit(language: DW_LANG_C99, file: !955, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !176, splitDebugInlining: false, nameTableKind: None)
!955 = !DIFile(filename: "strlcpy.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/compat")
!956 = distinct !DICompileUnit(language: DW_LANG_C99, file: !957, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !951, retainedTypes: !958, splitDebugInlining: false, nameTableKind: None)
!957 = !DIFile(filename: "closefrom.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/compat")
!958 = !{!33, !19}
!959 = !{!"clang version 10.0.0-4ubuntu1 "}
!960 = !{i32 7, !"Dwarf Version", i32 4}
!961 = !{i32 2, !"Debug Info Version", i32 3}
!962 = !{i32 1, !"wchar_size", i32 4}
!963 = !{i32 7, !"PIC Level", i32 2}
!964 = distinct !DISubprogram(name: "sudo_conversation", scope: !965, file: !965, line: 57, type: !966, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !845, retainedNodes: !176)
!965 = !DIFile(filename: "./conversation.c", directory: "/home/salman/DPP/data/sudo-1.8.3p1/src")
!966 = !DISubroutineType(types: !967)
!967 = !{!33, !33, !968, !975}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sudo_conv_message", file: !574, line: 37, size: 128, elements: !971)
!971 = !{!972, !973, !974}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "msg_type", scope: !970, file: !574, line: 44, baseType: !33, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !970, file: !574, line: 45, baseType: !33, size: 32, offset: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !970, file: !574, line: 46, baseType: !221, size: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sudo_conv_reply", file: !574, line: 49, size: 64, elements: !977)
!977 = !{!978}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !976, file: !574, line: 50, baseType: !20, size: 64)
!979 = !DILocalVariable(name: "num_msgs", arg: 1, scope: !964, file: !965, line: 57, type: !33)
!980 = !DILocation(line: 57, column: 23, scope: !964)
!981 = !DILocalVariable(name: "msgs", arg: 2, scope: !964, file: !965, line: 57, type: !968)
!982 = !DILocation(line: 57, column: 64, scope: !964)
!983 = !DILocalVariable(name: "replies", arg: 3, scope: !964, file: !965, line: 58, type: !975)
!984 = !DILocation(line: 58, column: 28, scope: !964)
!985 = !DILocalVariable(name: "repl", scope: !964, file: !965, line: 60, type: !975)
!986 = !DILocation(line: 60, column: 29, scope: !964)
!987 = !DILocalVariable(name: "msg", scope: !964, file: !965, line: 61, type: !968)
!988 = !DILocation(line: 61, column: 37, scope: !964)
!989 = !DILocalVariable(name: "pass", scope: !964, file: !965, line: 62, type: !20)
!990 = !DILocation(line: 62, column: 11, scope: !964)
!991 = !DILocalVariable(name: "n", scope: !964, file: !965, line: 63, type: !33)
!992 = !DILocation(line: 63, column: 9, scope: !964)
!993 = !DILocalVariable(name: "flags", scope: !964, file: !965, line: 63, type: !33)
!994 = !DILocation(line: 63, column: 12, scope: !964)
!995 = !DILocation(line: 63, column: 20, scope: !964)
!996 = !DILocation(line: 65, column: 12, scope: !997)
!997 = distinct !DILexicalBlock(scope: !964, file: !965, line: 65, column: 5)
!998 = !DILocation(line: 65, column: 10, scope: !997)
!999 = !DILocation(line: 65, column: 17, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !997, file: !965, line: 65, column: 5)
!1001 = !DILocation(line: 65, column: 21, scope: !1000)
!1002 = !DILocation(line: 65, column: 19, scope: !1000)
!1003 = !DILocation(line: 65, column: 5, scope: !997)
!1004 = !DILocation(line: 66, column: 9, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !1000, file: !965, line: 65, column: 36)
!1006 = !DILocation(line: 66, column: 14, scope: !1005)
!1007 = !DILocation(line: 66, column: 6, scope: !1005)
!1008 = !DILocation(line: 67, column: 10, scope: !1005)
!1009 = !DILocation(line: 67, column: 18, scope: !1005)
!1010 = !DILocation(line: 67, column: 7, scope: !1005)
!1011 = !DILocation(line: 68, column: 10, scope: !1005)
!1012 = !DILocation(line: 68, column: 15, scope: !1005)
!1013 = !DILocation(line: 68, column: 24, scope: !1005)
!1014 = !DILocation(line: 68, column: 2, scope: !1005)
!1015 = !DILocation(line: 71, column: 7, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1017, file: !965, line: 71, column: 7)
!1017 = distinct !DILexicalBlock(scope: !1005, file: !965, line: 68, column: 32)
!1018 = !DILocation(line: 71, column: 12, scope: !1016)
!1019 = !DILocation(line: 71, column: 21, scope: !1016)
!1020 = !DILocation(line: 71, column: 7, scope: !1017)
!1021 = !DILocation(line: 72, column: 7, scope: !1016)
!1022 = !DILocation(line: 74, column: 7, scope: !1016)
!1023 = !DILocation(line: 71, column: 24, scope: !1016)
!1024 = !DILocation(line: 77, column: 7, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !1017, file: !965, line: 77, column: 7)
!1026 = !DILocation(line: 77, column: 7, scope: !1017)
!1027 = !DILocation(line: 78, column: 7, scope: !1025)
!1028 = !DILocation(line: 80, column: 19, scope: !1017)
!1029 = !DILocation(line: 80, column: 24, scope: !1017)
!1030 = !DILocation(line: 80, column: 29, scope: !1017)
!1031 = !DILocation(line: 80, column: 34, scope: !1017)
!1032 = !DILocation(line: 80, column: 43, scope: !1017)
!1033 = !DILocation(line: 80, column: 10, scope: !1017)
!1034 = !DILocation(line: 80, column: 8, scope: !1017)
!1035 = !DILocation(line: 81, column: 7, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1017, file: !965, line: 81, column: 7)
!1037 = !DILocation(line: 81, column: 12, scope: !1036)
!1038 = !DILocation(line: 81, column: 7, scope: !1017)
!1039 = !DILocation(line: 82, column: 7, scope: !1036)
!1040 = !DILocation(line: 83, column: 25, scope: !1017)
!1041 = !DILocation(line: 83, column: 17, scope: !1017)
!1042 = !DILocation(line: 83, column: 3, scope: !1017)
!1043 = !DILocation(line: 83, column: 9, scope: !1017)
!1044 = !DILocation(line: 83, column: 15, scope: !1017)
!1045 = !DILocation(line: 84, column: 14, scope: !1017)
!1046 = !DILocation(line: 84, column: 27, scope: !1017)
!1047 = !DILocation(line: 84, column: 20, scope: !1017)
!1048 = !DILocation(line: 84, column: 3, scope: !1017)
!1049 = !DILocation(line: 85, column: 3, scope: !1017)
!1050 = !DILocation(line: 87, column: 7, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1017, file: !965, line: 87, column: 7)
!1052 = !DILocation(line: 87, column: 12, scope: !1051)
!1053 = !DILocation(line: 87, column: 7, scope: !1017)
!1054 = !DILocation(line: 88, column: 20, scope: !1051)
!1055 = !DILocation(line: 88, column: 25, scope: !1051)
!1056 = !DILocation(line: 88, column: 30, scope: !1051)
!1057 = !DILocation(line: 88, column: 14, scope: !1051)
!1058 = !DILocation(line: 88, column: 7, scope: !1051)
!1059 = !DILocation(line: 89, column: 3, scope: !1017)
!1060 = !DILocation(line: 91, column: 7, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1017, file: !965, line: 91, column: 7)
!1062 = !DILocation(line: 91, column: 12, scope: !1061)
!1063 = !DILocation(line: 91, column: 7, scope: !1017)
!1064 = !DILocation(line: 92, column: 20, scope: !1061)
!1065 = !DILocation(line: 92, column: 25, scope: !1061)
!1066 = !DILocation(line: 92, column: 30, scope: !1061)
!1067 = !DILocation(line: 92, column: 14, scope: !1061)
!1068 = !DILocation(line: 92, column: 7, scope: !1061)
!1069 = !DILocation(line: 93, column: 3, scope: !1017)
!1070 = !DILocation(line: 95, column: 3, scope: !1017)
!1071 = !DILocation(line: 97, column: 5, scope: !1005)
!1072 = !DILocation(line: 65, column: 32, scope: !1000)
!1073 = !DILocation(line: 65, column: 5, scope: !1000)
!1074 = distinct !{!1074, !1003, !1075}
!1075 = !DILocation(line: 97, column: 5, scope: !997)
!1076 = !DILocation(line: 99, column: 5, scope: !964)
!1077 = !DILabel(scope: !964, name: "err", file: !965, line: 101)
!1078 = !DILocation(line: 101, column: 1, scope: !964)
!1079 = !DILocation(line: 103, column: 5, scope: !964)
!1080 = !DILocation(line: 104, column: 10, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !964, file: !965, line: 103, column: 8)
!1082 = !DILocation(line: 104, column: 18, scope: !1081)
!1083 = !DILocation(line: 104, column: 7, scope: !1081)
!1084 = !DILocation(line: 105, column: 6, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1081, file: !965, line: 105, column: 6)
!1086 = !DILocation(line: 105, column: 12, scope: !1085)
!1087 = !DILocation(line: 105, column: 18, scope: !1085)
!1088 = !DILocation(line: 105, column: 6, scope: !1081)
!1089 = !DILocation(line: 106, column: 17, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1085, file: !965, line: 105, column: 27)
!1091 = !DILocation(line: 106, column: 23, scope: !1090)
!1092 = !DILocation(line: 106, column: 37, scope: !1090)
!1093 = !DILocation(line: 106, column: 43, scope: !1090)
!1094 = !DILocation(line: 106, column: 30, scope: !1090)
!1095 = !DILocation(line: 106, column: 6, scope: !1090)
!1096 = !DILocation(line: 107, column: 11, scope: !1090)
!1097 = !DILocation(line: 107, column: 17, scope: !1090)
!1098 = !DILocation(line: 107, column: 6, scope: !1090)
!1099 = !DILocation(line: 108, column: 6, scope: !1090)
!1100 = !DILocation(line: 108, column: 12, scope: !1090)
